ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263X/CPSW_CPSW_52800000h.xml
<module name="CPSW" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="CPSW_IDVER_REG" acronym="CPSW_IDVER_REG" offset="0" width="32" description="ID Version Register.">
		<bitfield id="IDENT" width="16" begin="31" end="16" resetval="0x27552" description="Identification value" range="31:16" rwaccess="R"/>
	<bitfield id="RTL_VER" width="5" begin="15" end="11" resetval="0x3" description="RTL version value" range="15:11" rwaccess="R"/>
	<bitfield id="MAJOR_VER" width="3" begin="10" end="8" resetval="0x1" description="Major version value" range="10:8" rwaccess="R"/>
	<bitfield id="MINOR_VER" width="8" begin="7" end="0" resetval="0x3" description="Minor version value" range="7:0" rwaccess="R"/>
	</register><register id="CPSW_SS_SYNCE_COUNT_REG" acronym="CPSW_SS_SYNCE_COUNT_REG" offset="4" width="32" description="SS SYNCE Count Register.">
		<bitfield id="SYNCE_CNT" width="32" begin="31" end="0" resetval="0x0" description="SyncE Count Value - This value determines the toggle rate of the TS_SYNCE output.  When this value is zero the TS_SYNCE output is disabled (low).   When this value is non-zero, the TS_SYNCE output toggles each time the synce count value is reached.   If this value is to be changed to another non-zero value then it should be written with a zero value before Writing the new non-zero value." range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_SS_SYNCE_MUX_REG" acronym="CPSW_SS_SYNCE_MUX_REG" offset="8" width="32" description="SS Synce Mux Register.">
		<bitfield id="SYNCE_SEL" width="2" begin="5" end="4" resetval="0x0" description="Sync E Interface Select.  00 - GMIIn_MRCLK_I input clock from selected GMII port  01 - RMII_MHZ_50_CLK  (same for all ports if RMII included)  10 - RGMIIn_RXC_I input clock from selected port (If RGMII included)  11 - SERDESn_RXCLK from selected port (If SGMII included)" range="5:4" rwaccess="R/W"/>
	<bitfield id="SYNCE_PORT_SEL" width="4" begin="3" end="0" resetval="0x0" description="Sync E Port Select - This field selects the port that will be used for the synchronous Ethernet receive clock.  The port interface is selected with synce_sel.  0 - Port 1  1 - Port 2  ...  7 - Port 8  8-15 - Reserved" range="3:0" rwaccess="R/W"/>
	</register><register id="CPSW_SS_CONTROL_REG" acronym="CPSW_SS_CONTROL_REG" offset="12" width="32" description="SS Control Register.">
		<bitfield id="EEE_PHY_ONLY" width="1" begin="1" end="1" resetval="0x0" description="Energy Efficient Enable Phy Only Mode.  0 - The low power indicate state (LPI) includes gating off the CPPI_GCLK to the CPSW.  1 - The low power indicate state (LPI) does not gate the clock to the CPSW" range="1" rwaccess="R/W"/>
	<bitfield id="EEE_EN" width="1" begin="0" end="0" resetval="0x0" description="Energy Efficient Ethernet Enable.  0 - EEE is disabled  1 - EEE is enabled" range="0" rwaccess="R/W"/>
	</register><register id="CPSW_SS_INT_CONTROL_REG" acronym="CPSW_SS_INT_CONTROL_REG" offset="24" width="32" description="SS Interrupt Control Register.">
		<bitfield id="INT_TEST" width="1" begin="31" end="31" resetval="0x0" description="Interrupt Test - Test bit to the interrupt pacing blocks" range="31" rwaccess="R/W"/>
	<bitfield id="INT_SEL_VEC_EN" width="1" begin="30" end="30" resetval="0x0" description="Interrupt Select Vector Enable.   0 - in_vector is an 8-bit mask for tx_pend, rx_pend, and rx_thresh_pend.  1 - in_vector is the 3-bit encoded value of the highest interrupt channel set for tx_pend, rx_pend, and rx_thresh_pend." range="30" rwaccess="R/W"/>
	<bitfield id="INT_PACE_EN" width="6" begin="21" end="16" resetval="0x0" description="Interrupt Pacing Enable Bus.   int_pace_en[0] - Enables C0_Rx_Pulse Pacing (0 is pacing bypass)   int_pace_en[1] - Enables C0_Tx_Pulse Pacing (0 is pacing bypass)   int_pace_en[2] - Enables C1_Rx_Pulse Pacing (0 is pacing bypass)   int_pace_en[3] - Enables C1_Tx_Pulse Pacing (0 is pacing bypass)   int_pace_en[4] - Enables C2_Rx_Pulse Pacing (0 is pacing bypass)   int_pace_en[5] - Enables C2_Tx_Pulse Pacing (0 is pacing bypass)" range="21:16" rwaccess="R/W"/>
	<bitfield id="INT_PRESCALE" width="12" begin="11" end="0" resetval="0x0" description="Interrupt Counter Prescaler -  The number of  VBUSP_CLK periods in 4us." range="11:0" rwaccess="R/W"/>
	</register><register id="CPSW_SS_STATUS_REG" acronym="CPSW_SS_STATUS_REG" offset="28" width="32" description="SS Status Register.">
		<bitfield id="EEE_CLKSTOP_ACK" width="1" begin="0" end="0" resetval="0x0" description="Energy Efficient Ethernet clockstop acknowledge from CPSW" range="0" rwaccess="R"/>
	</register><register id="CPSW_SUBSYSTEM_CONFIG_REG" acronym="CPSW_SUBSYSTEM_CONFIG_REG" offset="32" width="32" description="Subsystem Configuration Register.">
		<bitfield id="XGMII" width="8" begin="27" end="20" resetval="0x0" description="The Number of XGMII Ports included in the CPSW" range="27:20" rwaccess="R"/>
	<bitfield id="QSGMII" width="1" begin="19" end="19" resetval="0x0" description="QSGMII is included in the CPSW" range="19" rwaccess="R"/>
	<bitfield id="SGMII" width="1" begin="18" end="18" resetval="0x0" description="SGMII  is included in the CPSW" range="18" rwaccess="R"/>
	<bitfield id="RGMII" width="1" begin="17" end="17" resetval="0x1" description="RGMII  is included in the CPSW" range="17" rwaccess="R"/>
	<bitfield id="RMII" width="1" begin="16" end="16" resetval="0x1" description="RMII   is included in the CPSW" range="16" rwaccess="R"/>
	<bitfield id="NUM_GENF" width="5" begin="12" end="8" resetval="0x2" description="The number of CPTS GENF outputs" range="12:8" rwaccess="R"/>
	<bitfield id="NUM_PORTS" width="8" begin="7" end="0" resetval="0x3" description="The total number of ports including the host port 0" range="7:0" rwaccess="R"/>
	</register><register id="CPSW_RGMII1_STATUS_REG" acronym="CPSW_RGMII1_STATUS_REG" offset="48" width="32" description="RGMII1 Status Register.">
		<bitfield id="FULLDUPLEX" width="1" begin="3" end="3" resetval="0x0" description="Rgmii1 Full-duplex   0 - Half-duplex   1 - Full-duplex" range="3" rwaccess="R"/>
	<bitfield id="SPEED" width="2" begin="2" end="1" resetval="0x0" description="Rgmii1 Speed  00 - 10Mbps   01 - 100Mbps   10 - 1000Mbps   11 - reserved" range="2:1" rwaccess="R"/>
	<bitfield id="LINK" width="1" begin="0" end="0" resetval="0x0" description="Rgmii1 Link Indicator     0 - Link is down   1 - Link is up" range="0" rwaccess="R"/>
	</register><register id="CPSW_RGMII2_STATUS_REG" acronym="CPSW_RGMII2_STATUS_REG" offset="52" width="32" description="RGMII2 Status Register.">
		<bitfield id="FULLDUPLEX" width="1" begin="3" end="3" resetval="0x0" description="Rgmii2 Full-duplex   0 - Half-duplex   1 - Full-duplex" range="3" rwaccess="R"/>
	<bitfield id="SPEED" width="2" begin="2" end="1" resetval="0x0" description="Rgmii2 Speed  00 - 10Mbps   01 - 100Mbps   10 - 1000Mbps   11 - reserved" range="2:1" rwaccess="R"/>
	<bitfield id="LINK" width="1" begin="0" end="0" resetval="0x0" description="Rgmii2 Link Indicator     0 - Link is down   1 - Link is up" range="0" rwaccess="R"/>
	</register><register id="CPSW_MDIO_VERSION_REG" acronym="CPSW_MDIO_VERSION_REG" offset="3840" width="32" description="MDIO Version Register">
		<bitfield id="SCHEME" width="2" begin="31" end="30" resetval="0x0" description="Scheme" range="31:30" rwaccess="R"/>
	<bitfield id="BU" width="2" begin="29" end="28" resetval="0x0" description="bu" range="29:28" rwaccess="R"/>
	<bitfield id="MODULE_ID" width="12" begin="27" end="16" resetval="0x7" description="Module ID" range="27:16" rwaccess="R"/>
	<bitfield id="REVRTL" width="5" begin="15" end="11" resetval="0x2" description="RTL version" range="15:11" rwaccess="R"/>
	<bitfield id="REVMAJ" width="3" begin="10" end="8" resetval="0x1" description="Major version" range="10:8" rwaccess="R"/>
	<bitfield id="CUSTOM" width="2" begin="7" end="6" resetval="0x0" description="Custom version" range="7:6" rwaccess="R"/>
	<bitfield id="REVMIN" width="6" begin="5" end="0" resetval="0x7" description="Minor version" range="5:0" rwaccess="R"/>
	</register><register id="CPSW_MDIO_CONTROL_REG" acronym="CPSW_MDIO_CONTROL_REG" offset="3844" width="32" description="MDIO Control Register">
		<bitfield id="IDLE" width="1" begin="31" end="31" resetval="0x1" description="MDIO state machine IDLE.  Set to 1 by the hardware when the state machine is in the idle state." range="31" rwaccess="R"/>
	<bitfield id="ENABLE" width="1" begin="30" end="30" resetval="0x0" description="Enable control.  Writing a 1 to this bit enables the MDIO state machine, writing a 0 disables it.  If the MDIO state machine is active at the time it is disabled, it will complete the current operation before halting and setting the idle bit. If using byte access, the enable bit has to be the last bit written in this register." range="30" rwaccess="R/W"/>
	<bitfield id="HIGHEST_USER_CHANNEL" width="5" begin="28" end="24" resetval="0x1" description="Highest user channel. This field specifies the highest useraccess channel that is available in the module and is currently set to 1. This implies that MDIOUserAccess1 is the highest available user access channel." range="28:24" rwaccess="R"/>
	<bitfield id="PREAMBLE" width="1" begin="20" end="20" resetval="0x0" description="Preamble disable.  Writing a 1 to this bit disables this device from sending MDIO frame preambles in clause 22 mode of operation.  This bit has no effect in clause 45 mode of operation." range="20" rwaccess="R/W"/>
	<bitfield id="FAULT" width="1" begin="19" end="19" resetval="0x0" description="Fault indicator.  This bit is set to 1 if the MDIO pins fail to read back what the device is driving onto them.  This indicates a physical layer fault and the module state machine is reset. Writing a 1 to it clears this bit." range="19" rwaccess="R/W"/>
	<bitfield id="FAULT_DETECT_ENABLE" width="1" begin="18" end="18" resetval="0x0" description="Fault detect enable. This bit has to be set to 1 to enable the physical layer fault detection." range="18" rwaccess="R/W"/>
	<bitfield id="INT_TEST_ENABLE" width="1" begin="17" end="17" resetval="0x0" description="Interrupt test enable. This bit can be set to 1 to enable the host to set the userint and linkint bits for test purposes." range="17" rwaccess="R/W"/>
	<bitfield id="CLKDIV" width="16" begin="15" end="0" resetval="0x255" description="Clock Divider.  This field specifies the division ratio between CLK and the frequency of MDCLK.  MDCLK is disabled when clkdiv is set to 0. MDCLK frequency = clk frequency/(clkdiv+1). " range="15:0" rwaccess="R/W"/>
	</register><register id="CPSW_MDIO_ALIVE_REG" acronym="CPSW_MDIO_ALIVE_REG" offset="3848" width="32" description="MDIO Alive Register">
		<bitfield id="ALIVE" width="32" begin="31" end="0" resetval="0x0" description="MDIO Alive.  Each of the 32 bits of this register is set if the most recent access to the PHY with address corresponding to the register bit number was acknowledged by the PHY, the bit is reset if the PHY fails to acknowledge the access.  Both the user and polling accesses to a PHY will cause the corresponding alive bit to be updated.  The alive bits are intended to be used to give an indication of the presence or not of the PHY with the corresponding address.  Writing a 1 to any bit will clear it, writing a 0 has no effect." range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_MDIO_LINK_REG" acronym="CPSW_MDIO_LINK_REG" offset="3852" width="32" description="MDIO Link Register">
		<bitfield id="LINK" width="32" begin="31" end="0" resetval="0x0" description="MDIO Link state.  This register is updated after a read of the Generic Status Register of a PHY. The corresponding bit is set if the PHY with the corresponding address has link and the PHY acknowledges the read transaction. The bit is cleared to zero if the PHY indicates it does not have link or fails to acknowledge the read transaction.  Writes to the register have no effect. In addition, in Normal Mode Operation, the status of the two PHYs specified in the MDIOUserPhySel registers can be determined using the MLINK input pins. This is determined by the linksel bit in the MDIOUserPhySel register.  In State Change Mode the MLINK input pins are unused." range="31:0" rwaccess="R"/>
	</register><register id="CPSW_MDIO_LINK_INT_RAW_REG" acronym="CPSW_MDIO_LINK_INT_RAW_REG" offset="3856" width="32" description="MDIO Link Interrupt Raw Register">
		<bitfield id="LINKINTRAW" width="2" begin="1" end="0" resetval="0x0" description="MDIO link change event raw value. Normal mode operation: When asserted, a bit indicates that there was an MDIO link change event (i.e. change in the MDIOLink register) corresponding to the PHY address in the MDIOUserPhySel register. linkintraw[0] and linkintraw[1] correspond to MDIOUserPhySel0 and MDIOUserPhysel1, respectively. Writing a 1 will clear the event and writing 0 has no effect. If the int_test bit in the MDIOControl register is set, the host may set linkintraw bits to a 1 which may be used for test purposes. MDIO link change event raw value. State Change Mode operation: The linkintraw[0] bit will be asserted when any bit (for any PHY) in the MDIOAlive or MDIOLink registers changes due to MDIO operations.  The linkintraw[1] bit is unused in State Change Mode.  State Change Mode allows any state change in any PHY to issue an interrupt.  If the int_test bit in the MDIOControl register is set, the host may set the linkintraw[0] bit high which may be used for test purposes." range="1:0" rwaccess="R/W"/>
	</register><register id="CPSW_MDIO_LINK_INT_MASKED_REG" acronym="CPSW_MDIO_LINK_INT_MASKED_REG" offset="3860" width="32" description="MDIO Link Interrupt Masked Register">
		<bitfield id="LINKINTMASKED" width="2" begin="1" end="0" resetval="0x0" description="MDIO link change interrupt masked value. Normal mode operation: When asserted, a bit indicates that there was an MDIO link change event (i.e. change in the MDIOLink register) corresponding to the PHY address in the MDIOUserPhySel register and the corresponding linkint_enable bit was set.  linkintmasked[0] and linkintmasked[1] correspond to MDIOUserPhySel0 and MDIOUserPhysel1, respectively. Writing a 1 will clear the interrupt and writing 0 has no effect.  These masked interrupt bits are the MDIO_LINKINT[1:0] pin values. MDIO link change interrupt masked value.  State Change Mode operation: The linkintmasked[0] bit will be asserted when linkintraw[0] is asserted and when the linkintmaskset bit is set to 1.  Writing a 1 will clear linkintmasked[0] (and the MDIO_LINKINT[0] output) and writing 0 has no effect.  The linkintmasked[1] bit is not used in State Change Mode (MDIO_LINKINT[1] is therefore also unused in State Change Mode)." range="1:0" rwaccess="R/W"/>
	</register><register id="CPSW_MDIO_LINK_INT_MASK_SET_REG" acronym="CPSW_MDIO_LINK_INT_MASK_SET_REG" offset="3864" width="32" description="MDIO Link Interrupt Mask Set Register">
		<bitfield id="LINKINTMASKSET" width="1" begin="0" end="0" resetval="0x0" description="MDIO link interrupt mask set.  Normal Mode Operation: This register is not used in normal mode.  In normal mode the MDIO_LINKINT[1:0] interrupts are enabled with the linkint_enable bit in the associated MDIOUserPhySel0/1 register. MDIO link interrupt mask set.  State Change Mode Operation: Writing this bit to 1 will enable the MDIO link status change interrupt (MDIO_LINKINT[0]) to be asserted when linkintraw[0] is asserted.  " range="0" rwaccess="R/W"/>
	</register><register id="CPSW_MDIO_LINK_INT_MASK_CLEAR_REG" acronym="CPSW_MDIO_LINK_INT_MASK_CLEAR_REG" offset="3868" width="32" description="MDIO Link Interrupt Mask Clear Register">
		<bitfield id="LINKINTMASKCLR" width="1" begin="0" end="0" resetval="0x0" description="MDIO link interrupt mask clear.  Normal Mode Operation: This register is not used in normal mode.  In normal mode the MDIO_LINKINT[1:0] interrupts are enabled with the linkint_enable bit in the associated MDIOUserPhySel0/1 register. MDIO link interrupt mask clear.  State Change Mode Operation: Writing this bit to 1 will disable the MDIO link status change interrupt (MDIO_LINKINT[0]) regardless of the linkintraw[0] bit value." range="0" rwaccess="R/W"/>
	</register><register id="CPSW_MDIO_USER_INT_RAW_REG" acronym="CPSW_MDIO_USER_INT_RAW_REG" offset="3872" width="32" description="MDIO User Interrupt Raw Register">
		<bitfield id="USERINTRAW" width="2" begin="1" end="0" resetval="0x0" description="Raw value of MDIO user command complete event for MDIOUserAccess1 through MDIOUserAccess0, respectively. When asserted, a bit indicates that the previously scheduled PHY read or write command using that particular MDIOUserAccess register has completed. Writing a 1 will clear the event and writing 0 has no effect.  If the int_test bit in the MDIOControl register is set, the host may set the userintraw bits to a 1. This mode may be used for test purposes." range="1:0" rwaccess="R/W"/>
	</register><register id="CPSW_MDIO_USER_INT_MASKED_REG" acronym="CPSW_MDIO_USER_INT_MASKED_REG" offset="3876" width="32" description="MDIO User Interrupt Masked Register">
		<bitfield id="USERINTMASKED" width="2" begin="1" end="0" resetval="0x0" description="Masked value of MDIO user command complete interrupt for MDIOUserAccess1 through MDIOUserAccess0, respectively. When asserted, a bit indicates that the previously scheduled PHY read or write command using that particular MDIOUserAccess register has completed and the corresponding userintmaskset bit is set to 1.  Writing a 1 will clear the interrupt and writing 0 has no effect.  If the int_test bit in the MDIOControl register is set, the host may set the userintmasked bits to a 1. This mode may be used for test purposes." range="1:0" rwaccess="R/W"/>
	</register><register id="CPSW_MDIO_USER_INT_MASK_SET_REG" acronym="CPSW_MDIO_USER_INT_MASK_SET_REG" offset="3880" width="32" description="MDIO User Interrupt Mask Set Register">
		<bitfield id="USERINTMASKSET" width="2" begin="1" end="0" resetval="0x0" description="MDIO user interrupt mask set for userintmasked[1:0], respectively. Writing a bit to 1 will enable MDIO user command complete interrupts for that particular MDIOUserAccess register. MDIO user interrupt for a particular MDIOUserAccess register is disabled if the corresponding bit is 0.  Writing a 0 to this register has no effect." range="1:0" rwaccess="R/W"/>
	</register><register id="CPSW_MDIO_USER_INT_MASK_CLEAR_REG" acronym="CPSW_MDIO_USER_INT_MASK_CLEAR_REG" offset="3884" width="32" description="MDIO User Interrupt Mask Clear Register">
		<bitfield id="USERINTMASKCLR" width="2" begin="1" end="0" resetval="0x0" description="MDIO user command complete interrupt mask clear for userintmasked[1:0], respectively. Writing a bit to 1 will disable further user command complete interrupts for that particular MDIOUserAccess register. Writing a 0 to this register has no effect." range="1:0" rwaccess="R/W"/>
	</register><register id="CPSW_MDIO_MANUAL_IF_REG" acronym="CPSW_MDIO_MANUAL_IF_REG" offset="3888" width="32" description="MDIO Manual Interface  Register">
		<bitfield id="MDIO_MDCLK_O" width="1" begin="2" end="2" resetval="0x0" description="MDIO Clock Output - This value is the MDCLK_O output value when the manualmode bit is set in the MDIO_POLL_IPG register." range="2" rwaccess="R/W"/>
	<bitfield id="MDIO_OE" width="1" begin="1" end="1" resetval="0x0" description="MDIO Output Enable - This value is inverted and output on the MDIO_OE_N output when the manualmode bit is set in the MDIO_POLL_IPG register." range="1" rwaccess="R/W"/>
	<bitfield id="MDIO_PIN" width="1" begin="0" end="0" resetval="0x0" description="MDIO_Pin Value - This is the external MDIO data pin value when the manualmode bit is set in the MDIO_POLL_IPG register.  That is, this value is driven on the MDIO_O (the MDIO serial data output) when MDIO_OE is asserted.  The read value for this bit comes from MDIO_I (the MDIO serial data input).  If MDIO_OE is asserted and MDIO_PIN is written with a 1 then MDIO_PIN should read a 1 if there are no external devices pulling the MDIO data line low.  " range="0" rwaccess="R/W"/>
	</register><register id="CPSW_MDIO_POLL_REG" acronym="CPSW_MDIO_POLL_REG" offset="3892" width="32" description="MDIO Poll Register">
		<bitfield id="MANUALMODE" width="1" begin="31" end="31" resetval="0x0" description="Polling Inter Packet Gap  Value - This value is the number of MDCLK_O clocks between each poll when polling is enabled. " range="31" rwaccess="R/W"/>
	<bitfield id="STATECHANGEMODE" width="1" begin="30" end="30" resetval="0x0" description="State Change Mode - When set, the MDIO is operating in State Change Mode.  When clear, the MDIO is operating in normal mode.  State change mode effects interrupt operations." range="30" rwaccess="R/W"/>
	<bitfield id="IPG" width="8" begin="7" end="0" resetval="0x0" description="Manual Mode - When set, the MDIO pins are directly controlled by software through the bits in the MDIOManual_IF register" range="7:0" rwaccess="R/W"/>
	</register><register id="CPSW_MDIO_POLL_EN_REG" acronym="CPSW_MDIO_POLL_EN_REG" offset="3896" width="32" description="MDIO Poll Enable Register">
		<bitfield id="POLL_EN" width="32" begin="31" end="0" resetval="0x4294967295" description="Poll Enable - When set, the bit indicates that the associated PHY will be included in polling operations.  When clear, the associated PHY will not be polled.  Each bit in this field is associated with a PHY.  Bit zero is associated with PHY 0 and so on.  Due to a limitation in the hardware, bit 31 must always be set, regardless of the value of the preamble disable bit in the MDIO_CONTROL register.  However, there does not have to be a PHY at address 31." range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_MDIO_CLAUS45_REG" acronym="CPSW_MDIO_CLAUS45_REG" offset="3900" width="32" description="MDIO Clause45 Register">
		<bitfield id="CLAUSE45" width="32" begin="31" end="0" resetval="0x0" description="MDIO clause 45 mode.  When a clause45 bit is cleared, the PHY associated with the clause45 bit is operating in the clause 22 mode.  When set, the PHY associated with the clause45 bit is operating in the clause 45 mode.  Bit 0 is associated with PHY 0 and so on." range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_MDIO_USER_ADDR0_REG" acronym="CPSW_MDIO_USER_ADDR0_REG" offset="3904" width="32" description="MDIO Address 0 Register">
		<bitfield id="USER_ADDR0" width="16" begin="15" end="0" resetval="0x0" description="User Address 0 - In clause 45 mode, this field value is the address transferred in the address transfer inititated before each MDIOUserAccess0 access.  This is not used for PHYs operating in clause22 mode as there is no address transfer preceeding each MDIOUserAccess0 access." range="15:0" rwaccess="R/W"/>
	</register><register id="CPSW_MDIO_USER_ADDR1_REG" acronym="CPSW_MDIO_USER_ADDR1_REG" offset="3908" width="32" description="MDIO Address 1 Register">
		<bitfield id="USER_ADDR1" width="16" begin="15" end="0" resetval="0x0" description="User Address 1 - In clause 45 mode, this field value is the address transferred in the address transfer inititated before each MDIOUserAccess1 access.  This is not used for PHYs operating in clause22 mode as there is no address transfer preceeding each MDIOUserAccess1 access." range="15:0" rwaccess="R/W"/>
	</register><register id="CPSW_REGS_INT_SS_C0_TH_THRESH_PULSE_EN_REG" acronym="CPSW_REGS_INT_SS_C0_TH_THRESH_PULSE_EN_REG" offset="6144" width="32" description="Core 0 THost Threshold Pulse Interrupt Enable Register">
		<bitfield id="TH_THRESH_PULSE_EN" width="8" begin="7" end="0" resetval="0x0" description="Core 0 THost Threshold Enable - Each bit in this register corresponds to the bit in the THost threshold interrupt that is enabled to generate an interrupt on C0_TH_THRESH_PULSE." range="7:0" rwaccess="R/W"/>
