ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263X/CPSW_CPSW_52800000h.xml
	</register><register id="CPSW_REGS_INT_SS_C0_TH_PULSE_EN_REG" acronym="CPSW_REGS_INT_SS_C0_TH_PULSE_EN_REG" offset="6148" width="32" description="Core 0 THost Pulse Interrupt Enable Register">
		<bitfield id="TH_PULSE_EN" width="8" begin="7" end="0" resetval="0x0" description="Core 0 THost Enable - Each bit in this register corresponds to the bit in the THost interrupt that is enabled to generate an interrupt on C0_TH_PULSE." range="7:0" rwaccess="R/W"/>
	</register><register id="CPSW_REGS_INT_SS_C0_FH_PULSE_EN_REG" acronym="CPSW_REGS_INT_SS_C0_FH_PULSE_EN_REG" offset="6152" width="32" description="Core 0 FHost Pulse Interrupt Enable Register">
		<bitfield id="FH_PULSE_EN" width="8" begin="7" end="0" resetval="0x0" description="Core 0 FHost Interrupt Enable - Each bit in this register corresponds to the bit in the FHost interrupt that is enabled to generate an interrupt on C0_FH_PULSE." range="7:0" rwaccess="R/W"/>
	</register><register id="CPSW_REGS_INT_SS_C0_MISC_EN_REG" acronym="CPSW_REGS_INT_SS_C0_MISC_EN_REG" offset="6156" width="32" description="Core 0 Misc Interrupt Enable Register">
		<bitfield id="DED_PEND_EN" width="1" begin="6" end="6" resetval="0x0" description="Core 0 MISC DED Memory Protect Error Interrupt Enable - enabled to generate an interrupt on C0_Misc_PULSE" range="6" rwaccess="R/W"/>
	<bitfield id="SEC_PEND_EN" width="1" begin="5" end="5" resetval="0x0" description="Core 0 MISC SEC Memory Protect Error Interrupt Enable - enabled to generate an interrupt on C0_Misc_PULSE" range="5" rwaccess="R/W"/>
	<bitfield id="EVNT_PEND_EN" width="1" begin="4" end="4" resetval="0x0" description="Core 0 MISC CPTS Event Interrupt Enable - enabled to generate an interrupt on C0_Misc_PULSE" range="4" rwaccess="R/W"/>
	<bitfield id="STAT_PEND_EN" width="1" begin="3" end="3" resetval="0x0" description="Core 0 MISC Statistics Interrupt Enable - Logical OR of all port statistics bits (bits n downto 0) - enabled to generate an interrupt on C0_Misc_PULSE" range="3" rwaccess="R/W"/>
	<bitfield id="HOST_PEND_EN" width="1" begin="2" end="2" resetval="0x0" description="Core 0 MISC Host Interrupt Enable - enabled to generate an interrupt on C0_Misc_PULSE" range="2" rwaccess="R/W"/>
	<bitfield id="MDIO_LINKINT_EN" width="1" begin="1" end="1" resetval="0x0" description="Core 0 MISC MDIO linkint - Logical OR of bits 1 and 0 - enabled to generate an interrupt on C0_Misc_PULSE" range="1" rwaccess="R/W"/>
	<bitfield id="MDIO_USERINT_EN" width="1" begin="0" end="0" resetval="0x0" description="Core 0 MISC_MDIO userint interrupt enable - Logical OR of bits 1 and 0 - enabled to generate an interrupt on C0_Misc_PULSE" range="0" rwaccess="R/W"/>
	</register><register id="CPSW_REGS_INT_SS_C0_TH_THRESH_PULSE_STATUS_REG" acronym="CPSW_REGS_INT_SS_C0_TH_THRESH_PULSE_STATUS_REG" offset="6160" width="32" description="THost Threshold Pulse Interrupt Status Register">
		<bitfield id="TH_THRESH_PULSE_STATUS" width="8" begin="7" end="0" resetval="0x0" description="Core 0 THost Threshold Masked Interrupt Status - Each bit in this read only register corresponds to the bit in the THost threshold interrupt that is enabled and generating an interrupt on C0_TH_THRESH_PULSE." range="7:0" rwaccess="R"/>
	</register><register id="CPSW_REGS_INT_SS_C0_TH_PULSE_STATUS_REG" acronym="CPSW_REGS_INT_SS_C0_TH_PULSE_STATUS_REG" offset="6164" width="32" description="THost Pulse Interrupt Status Register">
		<bitfield id="TH_PULSE_STATUS" width="8" begin="7" end="0" resetval="0x0" description="Core 0 THost Pulse Interrupt Status Register - Each bit in this read only register corresponds to the bit in the Rx interrupt that is enabled and generating an interrupt on C0_TH_PULSE." range="7:0" rwaccess="R"/>
	</register><register id="CPSW_REGS_INT_SS_C0_FH_PULSE_STATUS_REG" acronym="CPSW_REGS_INT_SS_C0_FH_PULSE_STATUS_REG" offset="6168" width="32" description="FHost Pulse Interrupt Status Register">
		<bitfield id="FH_PULSE_STATUS" width="8" begin="7" end="0" resetval="0x0" description="Core 0 FHost Pulse Interrupt Status Register - Each bit in this read only register corresponds to the bit in the Tx interrupt that is enabled and generating an interrupt on C0_FH_PULSE ." range="7:0" rwaccess="R"/>
	</register><register id="CPSW_REGS_INT_SS_C0_MISC_STATUS_REG" acronym="CPSW_REGS_INT_SS_C0_MISC_STATUS_REG" offset="6172" width="32" description="Misc Interrupt Status Register - Set bits in this register indicate that an enabled interrupt is asserted">
		<bitfield id="DED_PEND" width="1" begin="6" end="6" resetval="0x0" description="Core 0 MISC DED Memory Protect Error Interrupt" range="6" rwaccess="R/W"/>
	<bitfield id="SEC_PEND" width="1" begin="5" end="5" resetval="0x0" description="Core 0 MISC SEC Memory Protect Error Interrupt" range="5" rwaccess="R/W"/>
	<bitfield id="EVNT_PEND" width="1" begin="4" end="4" resetval="0x0" description="Core 0 MISC CPTS Event Interrupt" range="4" rwaccess="R/W"/>
	<bitfield id="STAT_PEND" width="1" begin="3" end="3" resetval="0x0" description="Core 0 MISC Statistics Interrupt - Logical OR of bits n downto 0" range="3" rwaccess="R/W"/>
	<bitfield id="HOST_PEND" width="1" begin="2" end="2" resetval="0x0" description="Core 0 MISC Host Interrupt Enable" range="2" rwaccess="R/W"/>
	<bitfield id="MDIO_LINKINT" width="1" begin="1" end="1" resetval="0x0" description="Core 0 MISC MDIO linkint - Logical OR of bits 1 and 0" range="1" rwaccess="R/W"/>
	<bitfield id="MDIO_USERINT" width="1" begin="0" end="0" resetval="0x0" description="Core 0 MISC_MDIO userint interrupt - Logical OR of bits 1 and 0" range="0" rwaccess="R/W"/>
	</register><register id="CPSW_REGS_INT_SS_C0_TH_IMAX_REG" acronym="CPSW_REGS_INT_SS_C0_TH_IMAX_REG" offset="6176" width="32" description="Core 0 THost Interrupt Max Register Register">
		<bitfield id="TH_IMAX" width="6" begin="5" end="0" resetval="0x0" description="Core 0 THost Interrupts per millisecond - The maximum number of interrupts per millisecond generated on C0_TH_PULSE if pacing is enabled for this interrupt." range="5:0" rwaccess="R/W"/>
	</register><register id="CPSW_REGS_INT_SS_C0_FH_IMAX_REG" acronym="CPSW_REGS_INT_SS_C0_FH_IMAX_REG" offset="6180" width="32" description="Core 0 FHost Interrupt Max Register Register">
		<bitfield id="FH_IMAX" width="6" begin="5" end="0" resetval="0x0" description="Core 0 FHost Interrupts per millisecond - The maximum number of interrupts per millisecond generated on C0_FH_PULSE if pacing is enabled for this interrupt." range="5:0" rwaccess="R/W"/>
	</register><register id="CPSW_REGS_INT_SS_C1_TH_THRESH_PULSE_EN_REG" acronym="CPSW_REGS_INT_SS_C1_TH_THRESH_PULSE_EN_REG" offset="6208" width="32" description="Core 1 THost Threshold Pulse Interrupt Enable Register">
		<bitfield id="TH_THRESH_PULSE_EN" width="8" begin="7" end="0" resetval="0x0" description="Core 1 THost Threshold Enable - Each bit in this register corresponds to the bit in the THost threshold interrupt that is enabled to generate an interrupt on C1_TH_THRESH_PULSE." range="7:0" rwaccess="R/W"/>
	</register><register id="CPSW_REGS_INT_SS_C1_TH_PULSE_EN_REG" acronym="CPSW_REGS_INT_SS_C1_TH_PULSE_EN_REG" offset="6212" width="32" description="Core 1 THost Pulse Interrupt Enable Register">
		<bitfield id="TH_PULSE_EN" width="8" begin="7" end="0" resetval="0x0" description="Core 1 THost Enable - Each bit in this register corresponds to the bit in the THost interrupt that is enabled to generate an interrupt on C1_TH_PULSE." range="7:0" rwaccess="R/W"/>
	</register><register id="CPSW_REGS_INT_SS_C1_FH_PULSE_EN_REG" acronym="CPSW_REGS_INT_SS_C1_FH_PULSE_EN_REG" offset="6216" width="32" description="Core 1 FHost Pulse Interrupt Enable Register">
		<bitfield id="FH_PULSE_EN" width="8" begin="7" end="0" resetval="0x0" description="Core 1 FHost Interrupt Enable - Each bit in this register corresponds to the bit in the FHost interrupt that is enabled to generate an interrupt on C1_FH_PULSE." range="7:0" rwaccess="R/W"/>
	</register><register id="CPSW_REGS_INT_SS_C1_MISC_EN_REG" acronym="CPSW_REGS_INT_SS_C1_MISC_EN_REG" offset="6220" width="32" description="Core 1 Misc Interrupt Enable Register">
		<bitfield id="DED_PEND_EN" width="1" begin="6" end="6" resetval="0x0" description="Core 1 MISC DED Memory Protect Error Interrupt Enable - enabled to generate an interrupt on C1_Misc_PULSE" range="6" rwaccess="R/W"/>
	<bitfield id="SEC_PEND_EN" width="1" begin="5" end="5" resetval="0x0" description="Core 1 MISC SEC Memory Protect Error Interrupt Enable - enabled to generate an interrupt on C1_Misc_PULSE" range="5" rwaccess="R/W"/>
	<bitfield id="EVNT_PEND_EN" width="1" begin="4" end="4" resetval="0x0" description="Core 1 MISC CPTS Event Interrupt Enable - enabled to generate an interrupt on C1_Misc_PULSE" range="4" rwaccess="R/W"/>
	<bitfield id="STAT_PEND_EN" width="1" begin="3" end="3" resetval="0x0" description="Core 1 MISC Statistics Interrupt Enable - Logical OR of all port statistics bits (bits n downto 0) - enabled to generate an interrupt on C1_Misc_PULSE" range="3" rwaccess="R/W"/>
	<bitfield id="HOST_PEND_EN" width="1" begin="2" end="2" resetval="0x0" description="Core 1 MISC Host Interrupt Enable - enabled to generate an interrupt on C1_Misc_PULSE" range="2" rwaccess="R/W"/>
	<bitfield id="MDIO_LINKINT_EN" width="1" begin="1" end="1" resetval="0x0" description="Core 1 MISC MDIO linkint - Logical OR of bits 1 and 0 - enabled to generate an interrupt on C1_Misc_PULSE" range="1" rwaccess="R/W"/>
	<bitfield id="MDIO_USERINT_EN" width="1" begin="0" end="0" resetval="0x0" description="Core 1 MISC_MDIO userint interrupt enable - Logical OR of bits 1 and 0 - enabled to generate an interrupt on C1_Misc_PULSE" range="0" rwaccess="R/W"/>
	</register><register id="CPSW_REGS_INT_SS_C1_TH_THRESH_PULSE_STATUS_REG" acronym="CPSW_REGS_INT_SS_C1_TH_THRESH_PULSE_STATUS_REG" offset="6224" width="32" description="THost Threshold Pulse Interrupt Status Register">
		<bitfield id="TH_THRESH_PULSE_STATUS" width="8" begin="7" end="0" resetval="0x0" description="Core 1 THost Threshold Masked Interrupt Status - Each bit in this read only register corresponds to the bit in the THost threshold interrupt that is enabled and generating an interrupt on C1_TH_THRESH_PULSE." range="7:0" rwaccess="R"/>
	</register><register id="CPSW_REGS_INT_SS_C1_TH_PULSE_STATUS_REG" acronym="CPSW_REGS_INT_SS_C1_TH_PULSE_STATUS_REG" offset="6228" width="32" description="THost Pulse Interrupt Status Register">
		<bitfield id="TH_PULSE_STATUS" width="8" begin="7" end="0" resetval="0x0" description="Core 1 THost Pulse Interrupt Status Register - Each bit in this read only register corresponds to the bit in the Rx interrupt that is enabled and generating an interrupt on C1_TH_PULSE." range="7:0" rwaccess="R"/>
	</register><register id="CPSW_REGS_INT_SS_C1_FH_PULSE_STATUS_REG" acronym="CPSW_REGS_INT_SS_C1_FH_PULSE_STATUS_REG" offset="6232" width="32" description="FHost Pulse Interrupt Status Register">
		<bitfield id="FH_PULSE_STATUS" width="8" begin="7" end="0" resetval="0x0" description="Core 1 FHost Pulse Interrupt Status Register - Each bit in this read only register corresponds to the bit in the Tx interrupt that is enabled and generating an interrupt on C1_FH_PULSE ." range="7:0" rwaccess="R"/>
	</register><register id="CPSW_REGS_INT_SS_C1_MISC_STATUS_REG" acronym="CPSW_REGS_INT_SS_C1_MISC_STATUS_REG" offset="6236" width="32" description="Misc Interrupt Status Register - Set bits in this register indicate that an enabled interrupt is asserted">
		<bitfield id="DED_PEND" width="1" begin="6" end="6" resetval="0x0" description="Core 1 MISC DED Memory Protect Error Interrupt" range="6" rwaccess="R/W"/>
	<bitfield id="SEC_PEND" width="1" begin="5" end="5" resetval="0x0" description="Core 1 MISC SEC Memory Protect Error Interrupt" range="5" rwaccess="R/W"/>
	<bitfield id="EVNT_PEND" width="1" begin="4" end="4" resetval="0x0" description="Core 1 MISC CPTS Event Interrupt" range="4" rwaccess="R/W"/>
	<bitfield id="STAT_PEND" width="1" begin="3" end="3" resetval="0x0" description="Core 1 MISC Statistics Interrupt - Logical OR of bits n downto 0" range="3" rwaccess="R/W"/>
	<bitfield id="HOST_PEND" width="1" begin="2" end="2" resetval="0x0" description="Core 1 MISC Host Interrupt Enable" range="2" rwaccess="R/W"/>
	<bitfield id="MDIO_LINKINT" width="1" begin="1" end="1" resetval="0x0" description="Core 1 MISC MDIO linkint - Logical OR of bits 1 and 0" range="1" rwaccess="R/W"/>
	<bitfield id="MDIO_USERINT" width="1" begin="0" end="0" resetval="0x0" description="Core 1 MISC_MDIO userint interrupt - Logical OR of bits 1 and 0" range="0" rwaccess="R/W"/>
	</register><register id="CPSW_REGS_INT_SS_C1_TH_IMAX_REG" acronym="CPSW_REGS_INT_SS_C1_TH_IMAX_REG" offset="6240" width="32" description="Core 1 THost Interrupt Max Register Register">
		<bitfield id="TH_IMAX" width="6" begin="5" end="0" resetval="0x0" description="Core 1 THost Interrupts per millisecond - The maximum number of interrupts per millisecond generated on C1_TH_PULSE if pacing is enabled for this interrupt." range="5:0" rwaccess="R/W"/>
	</register><register id="CPSW_REGS_INT_SS_C1_FH_IMAX_REG" acronym="CPSW_REGS_INT_SS_C1_FH_IMAX_REG" offset="6244" width="32" description="Core 1 FHost Interrupt Max Register Register">
		<bitfield id="FH_IMAX" width="6" begin="5" end="0" resetval="0x0" description="Core 1 FHost Interrupts per millisecond - The maximum number of interrupts per millisecond generated on C1_FH_PULSE if pacing is enabled for this interrupt." range="5:0" rwaccess="R/W"/>
	</register><register id="CPSW_REGS_INT_SS_C2_TH_THRESH_PULSE_EN_REG" acronym="CPSW_REGS_INT_SS_C2_TH_THRESH_PULSE_EN_REG" offset="6272" width="32" description="Core 2 THost Threshold Pulse Interrupt Enable Register">
		<bitfield id="TH_THRESH_PULSE_EN" width="8" begin="7" end="0" resetval="0x0" description="Core 2 THost Threshold Enable - Each bit in this register corresponds to the bit in the THost threshold interrupt that is enabled to generate an interrupt on C2_TH_THRESH_PULSE." range="7:0" rwaccess="R/W"/>
	</register><register id="CPSW_REGS_INT_SS_C2_TH_PULSE_EN_REG" acronym="CPSW_REGS_INT_SS_C2_TH_PULSE_EN_REG" offset="6276" width="32" description="Core 2 THost Pulse Interrupt Enable Register">
		<bitfield id="TH_PULSE_EN" width="8" begin="7" end="0" resetval="0x0" description="Core 2 THost Enable - Each bit in this register corresponds to the bit in the THost interrupt that is enabled to generate an interrupt on C2_TH_PULSE." range="7:0" rwaccess="R/W"/>
	</register><register id="CPSW_REGS_INT_SS_C2_FH_PULSE_EN_REG" acronym="CPSW_REGS_INT_SS_C2_FH_PULSE_EN_REG" offset="6280" width="32" description="Core 2 FHost Pulse Interrupt Enable Register">
		<bitfield id="FH_PULSE_EN" width="8" begin="7" end="0" resetval="0x0" description="Core 2 FHost Interrupt Enable - Each bit in this register corresponds to the bit in the FHost interrupt that is enabled to generate an interrupt on C2_FH_PULSE." range="7:0" rwaccess="R/W"/>
	</register><register id="CPSW_REGS_INT_SS_C2_MISC_EN_REG" acronym="CPSW_REGS_INT_SS_C2_MISC_EN_REG" offset="6284" width="32" description="Core 2 Misc Interrupt Enable Register">
		<bitfield id="DED_PEND_EN" width="1" begin="6" end="6" resetval="0x0" description="Core 2 MISC DED Memory Protect Error Interrupt Enable - enabled to generate an interrupt on C2_Misc_PULSE" range="6" rwaccess="R/W"/>
	<bitfield id="SEC_PEND_EN" width="1" begin="5" end="5" resetval="0x0" description="Core 2 MISC SEC Memory Protect Error Interrupt Enable - enabled to generate an interrupt on C2_Misc_PULSE" range="5" rwaccess="R/W"/>
	<bitfield id="EVNT_PEND_EN" width="1" begin="4" end="4" resetval="0x0" description="Core 2 MISC CPTS Event Interrupt Enable - enabled to generate an interrupt on C2_Misc_PULSE" range="4" rwaccess="R/W"/>
	<bitfield id="STAT_PEND_EN" width="1" begin="3" end="3" resetval="0x0" description="Core 2 MISC Statistics Interrupt Enable - Logical OR of all port statistics bits (bits n downto 0) - enabled to generate an interrupt on C2_Misc_PULSE" range="3" rwaccess="R/W"/>
	<bitfield id="HOST_PEND_EN" width="1" begin="2" end="2" resetval="0x0" description="Core 2 MISC Host Interrupt Enable - enabled to generate an interrupt on C2_Misc_PULSE" range="2" rwaccess="R/W"/>
	<bitfield id="MDIO_LINKINT_EN" width="1" begin="1" end="1" resetval="0x0" description="Core 2 MISC MDIO linkint - Logical OR of bits 1 and 0 - enabled to generate an interrupt on C2_Misc_PULSE" range="1" rwaccess="R/W"/>
	<bitfield id="MDIO_USERINT_EN" width="1" begin="0" end="0" resetval="0x0" description="Core 2 MISC_MDIO userint interrupt enable - Logical OR of bits 1 and 0 - enabled to generate an interrupt on C2_Misc_PULSE" range="0" rwaccess="R/W"/>
	</register><register id="CPSW_REGS_INT_SS_C2_TH_THRESH_PULSE_STATUS_REG" acronym="CPSW_REGS_INT_SS_C2_TH_THRESH_PULSE_STATUS_REG" offset="6288" width="32" description="THost Threshold Pulse Interrupt Status Register">
		<bitfield id="TH_THRESH_PULSE_STATUS" width="8" begin="7" end="0" resetval="0x0" description="Core 2 THost Threshold Masked Interrupt Status - Each bit in this read only register corresponds to the bit in the THost threshold interrupt that is enabled and generating an interrupt on C2_TH_THRESH_PULSE." range="7:0" rwaccess="R"/>
	</register><register id="CPSW_REGS_INT_SS_C2_TH_PULSE_STATUS_REG" acronym="CPSW_REGS_INT_SS_C2_TH_PULSE_STATUS_REG" offset="6292" width="32" description="THost Pulse Interrupt Status Register">
		<bitfield id="TH_PULSE_STATUS" width="8" begin="7" end="0" resetval="0x0" description="Core 2 THost Pulse Interrupt Status Register - Each bit in this read only register corresponds to the bit in the Rx interrupt that is enabled and generating an interrupt on C2_TH_PULSE." range="7:0" rwaccess="R"/>
	</register><register id="CPSW_REGS_INT_SS_C2_FH_PULSE_STATUS_REG" acronym="CPSW_REGS_INT_SS_C2_FH_PULSE_STATUS_REG" offset="6296" width="32" description="FHost Pulse Interrupt Status Register">
		<bitfield id="FH_PULSE_STATUS" width="8" begin="7" end="0" resetval="0x0" description="Core 2 FHost Pulse Interrupt Status Register - Each bit in this read only register corresponds to the bit in the Tx interrupt that is enabled and generating an interrupt on C2_FH_PULSE ." range="7:0" rwaccess="R"/>
	</register><register id="CPSW_REGS_INT_SS_C2_MISC_STATUS_REG" acronym="CPSW_REGS_INT_SS_C2_MISC_STATUS_REG" offset="6300" width="32" description="Misc Interrupt Status Register - Set bits in this register indicate that an enabled interrupt is asserted">
		<bitfield id="DED_PEND" width="1" begin="6" end="6" resetval="0x0" description="Core 2 MISC DED Memory Protect Error Interrupt" range="6" rwaccess="R/W"/>
	<bitfield id="SEC_PEND" width="1" begin="5" end="5" resetval="0x0" description="Core 2 MISC SEC Memory Protect Error Interrupt" range="5" rwaccess="R/W"/>
	<bitfield id="EVNT_PEND" width="1" begin="4" end="4" resetval="0x0" description="Core 2 MISC CPTS Event Interrupt" range="4" rwaccess="R/W"/>
	<bitfield id="STAT_PEND" width="1" begin="3" end="3" resetval="0x0" description="Core 2 MISC Statistics Interrupt - Logical OR of bits n downto 0" range="3" rwaccess="R/W"/>
	<bitfield id="HOST_PEND" width="1" begin="2" end="2" resetval="0x0" description="Core 2 MISC Host Interrupt Enable" range="2" rwaccess="R/W"/>
	<bitfield id="MDIO_LINKINT" width="1" begin="1" end="1" resetval="0x0" description="Core 2 MISC MDIO linkint - Logical OR of bits 1 and 0" range="1" rwaccess="R/W"/>
	<bitfield id="MDIO_USERINT" width="1" begin="0" end="0" resetval="0x0" description="Core 2 MISC_MDIO userint interrupt - Logical OR of bits 1 and 0" range="0" rwaccess="R/W"/>
	</register><register id="CPSW_REGS_INT_SS_C2_TH_IMAX_REG" acronym="CPSW_REGS_INT_SS_C2_TH_IMAX_REG" offset="6304" width="32" description="Core 2 THost Interrupt Max Register Register">
		<bitfield id="TH_IMAX" width="6" begin="5" end="0" resetval="0x0" description="Core 2 THost Interrupts per millisecond - The maximum number of interrupts per millisecond generated on C2_TH_PULSE if pacing is enabled for this interrupt." range="5:0" rwaccess="R/W"/>
	</register><register id="CPSW_REGS_INT_SS_C2_FH_IMAX_REG" acronym="CPSW_REGS_INT_SS_C2_FH_IMAX_REG" offset="6308" width="32" description="Core 2 FHost Interrupt Max Register Register">
		<bitfield id="FH_IMAX" width="6" begin="5" end="0" resetval="0x0" description="Core 2 FHost Interrupts per millisecond - The maximum number of interrupts per millisecond generated on C2_FH_PULSE if pacing is enabled for this interrupt." range="5:0" rwaccess="R/W"/>
	</register><register id="CPSW_REGS_INT_SS_C3_TH_THRESH_PULSE_EN_REG" acronym="CPSW_REGS_INT_SS_C3_TH_THRESH_PULSE_EN_REG" offset="6336" width="32" description="Core 3 THost Threshold Pulse Interrupt Enable Register">
		<bitfield id="TH_THRESH_PULSE_EN" width="8" begin="7" end="0" resetval="0x0" description="Core 3 THost Threshold Enable - Each bit in this register corresponds to the bit in the THost threshold interrupt that is enabled to generate an interrupt on C3_TH_THRESH_PULSE." range="7:0" rwaccess="R/W"/>
	</register><register id="CPSW_REGS_INT_SS_C3_TH_PULSE_EN_REG" acronym="CPSW_REGS_INT_SS_C3_TH_PULSE_EN_REG" offset="6340" width="32" description="Core 3 THost Pulse Interrupt Enable Register">
		<bitfield id="TH_PULSE_EN" width="8" begin="7" end="0" resetval="0x0" description="Core 3 THost Enable - Each bit in this register corresponds to the bit in the THost interrupt that is enabled to generate an interrupt on C3_TH_PULSE." range="7:0" rwaccess="R/W"/>
	</register><register id="CPSW_REGS_INT_SS_C3_FH_PULSE_EN_REG" acronym="CPSW_REGS_INT_SS_C3_FH_PULSE_EN_REG" offset="6344" width="32" description="Core 3 FHost Pulse Interrupt Enable Register">
		<bitfield id="FH_PULSE_EN" width="8" begin="7" end="0" resetval="0x0" description="Core 3 FHost Interrupt Enable - Each bit in this register corresponds to the bit in the FHost interrupt that is enabled to generate an interrupt on C3_FH_PULSE." range="7:0" rwaccess="R/W"/>
	</register><register id="CPSW_REGS_INT_SS_C3_MISC_EN_REG" acronym="CPSW_REGS_INT_SS_C3_MISC_EN_REG" offset="6348" width="32" description="Core 3 Misc Interrupt Enable Register">
		<bitfield id="DED_PEND_EN" width="1" begin="6" end="6" resetval="0x0" description="Core 3 MISC DED Memory Protect Error Interrupt Enable - enabled to generate an interrupt on C3_Misc_PULSE" range="6" rwaccess="R/W"/>
	<bitfield id="SEC_PEND_EN" width="1" begin="5" end="5" resetval="0x0" description="Core 3 MISC SEC Memory Protect Error Interrupt Enable - enabled to generate an interrupt on C3_Misc_PULSE" range="5" rwaccess="R/W"/>
	<bitfield id="EVNT_PEND_EN" width="1" begin="4" end="4" resetval="0x0" description="Core 3 MISC CPTS Event Interrupt Enable - enabled to generate an interrupt on C3_Misc_PULSE" range="4" rwaccess="R/W"/>
	<bitfield id="STAT_PEND_EN" width="1" begin="3" end="3" resetval="0x0" description="Core 3 MISC Statistics Interrupt Enable - Logical OR of all port statistics bits (bits n downto 0) - enabled to generate an interrupt on C3_Misc_PULSE" range="3" rwaccess="R/W"/>
	<bitfield id="HOST_PEND_EN" width="1" begin="2" end="2" resetval="0x0" description="Core 3 MISC Host Interrupt Enable - enabled to generate an interrupt on C3_Misc_PULSE" range="2" rwaccess="R/W"/>
	<bitfield id="MDIO_LINKINT_EN" width="1" begin="1" end="1" resetval="0x0" description="Core 3 MISC MDIO linkint - Logical OR of bits 1 and 0 - enabled to generate an interrupt on C3_Misc_PULSE" range="1" rwaccess="R/W"/>
	<bitfield id="MDIO_USERINT_EN" width="1" begin="0" end="0" resetval="0x0" description="Core 3 MISC_MDIO userint interrupt enable - Logical OR of bits 1 and 0 - enabled to generate an interrupt on C3_Misc_PULSE" range="0" rwaccess="R/W"/>
	</register><register id="CPSW_REGS_INT_SS_C3_TH_THRESH_PULSE_STATUS_REG" acronym="CPSW_REGS_INT_SS_C3_TH_THRESH_PULSE_STATUS_REG" offset="6352" width="32" description="THost Threshold Pulse Interrupt Status Register">
