ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263X/CPSW_CPSW_52800000h.xml
		<bitfield id="TH_THRESH_PULSE_STATUS" width="8" begin="7" end="0" resetval="0x0" description="Core 3 THost Threshold Masked Interrupt Status - Each bit in this read only register corresponds to the bit in the THost threshold interrupt that is enabled and generating an interrupt on C3_TH_THRESH_PULSE." range="7:0" rwaccess="R"/>
	</register><register id="CPSW_REGS_INT_SS_C3_TH_PULSE_STATUS_REG" acronym="CPSW_REGS_INT_SS_C3_TH_PULSE_STATUS_REG" offset="6356" width="32" description="THost Pulse Interrupt Status Register">
		<bitfield id="TH_PULSE_STATUS" width="8" begin="7" end="0" resetval="0x0" description="Core 3 THost Pulse Interrupt Status Register - Each bit in this read only register corresponds to the bit in the Rx interrupt that is enabled and generating an interrupt on C3_TH_PULSE." range="7:0" rwaccess="R"/>
	</register><register id="CPSW_REGS_INT_SS_C3_FH_PULSE_STATUS_REG" acronym="CPSW_REGS_INT_SS_C3_FH_PULSE_STATUS_REG" offset="6360" width="32" description="FHost Pulse Interrupt Status Register">
		<bitfield id="FH_PULSE_STATUS" width="8" begin="7" end="0" resetval="0x0" description="Core 3 FHost Pulse Interrupt Status Register - Each bit in this read only register corresponds to the bit in the Tx interrupt that is enabled and generating an interrupt on C3_FH_PULSE ." range="7:0" rwaccess="R"/>
	</register><register id="CPSW_REGS_INT_SS_C3_MISC_STATUS_REG" acronym="CPSW_REGS_INT_SS_C3_MISC_STATUS_REG" offset="6364" width="32" description="Misc Interrupt Status Register - Set bits in this register indicate that an enabled interrupt is asserted">
		<bitfield id="DED_PEND" width="1" begin="6" end="6" resetval="0x0" description="Core 3 MISC DED Memory Protect Error Interrupt" range="6" rwaccess="R/W"/>
	<bitfield id="SEC_PEND" width="1" begin="5" end="5" resetval="0x0" description="Core 3 MISC SEC Memory Protect Error Interrupt" range="5" rwaccess="R/W"/>
	<bitfield id="EVNT_PEND" width="1" begin="4" end="4" resetval="0x0" description="Core 3 MISC CPTS Event Interrupt" range="4" rwaccess="R/W"/>
	<bitfield id="STAT_PEND" width="1" begin="3" end="3" resetval="0x0" description="Core 3 MISC Statistics Interrupt - Logical OR of bits n downto 0" range="3" rwaccess="R/W"/>
	<bitfield id="HOST_PEND" width="1" begin="2" end="2" resetval="0x0" description="Core 3 MISC Host Interrupt Enable" range="2" rwaccess="R/W"/>
	<bitfield id="MDIO_LINKINT" width="1" begin="1" end="1" resetval="0x0" description="Core 3 MISC MDIO linkint - Logical OR of bits 1 and 0" range="1" rwaccess="R/W"/>
	<bitfield id="MDIO_USERINT" width="1" begin="0" end="0" resetval="0x0" description="Core 3 MISC_MDIO userint interrupt - Logical OR of bits 1 and 0" range="0" rwaccess="R/W"/>
	</register><register id="CPSW_REGS_INT_SS_C3_TH_IMAX_REG" acronym="CPSW_REGS_INT_SS_C3_TH_IMAX_REG" offset="6368" width="32" description="Core 3 THost Interrupt Max Register Register">
		<bitfield id="TH_IMAX" width="6" begin="5" end="0" resetval="0x0" description="Core 3 THost Interrupts per millisecond - The maximum number of interrupts per millisecond generated on C3_TH_PULSE if pacing is enabled for this interrupt." range="5:0" rwaccess="R/W"/>
	</register><register id="CPSW_REGS_INT_SS_C3_FH_IMAX_REG" acronym="CPSW_REGS_INT_SS_C3_FH_IMAX_REG" offset="6372" width="32" description="Core 3 FHost Interrupt Max Register Register">
		<bitfield id="FH_IMAX" width="6" begin="5" end="0" resetval="0x0" description="Core 3 FHost Interrupts per millisecond - The maximum number of interrupts per millisecond generated on C3_FH_PULSE if pacing is enabled for this interrupt." range="5:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_VER_REG" acronym="CPSW_NC_VER_REG" offset="131072" width="32" description="CPSW ID Version">
		<bitfield id="IDENT" width="16" begin="31" end="16" resetval="0x27536" description="Identification Value" range="31:16" rwaccess="R"/>
	<bitfield id="RTL_VER" width="5" begin="15" end="11" resetval="0x6" description="RTL Version Value" range="15:11" rwaccess="R"/>
	<bitfield id="MAJOR_VER" width="3" begin="10" end="8" resetval="0x1" description="Major Version Value" range="10:8" rwaccess="R"/>
	<bitfield id="MINOR_VER" width="8" begin="7" end="0" resetval="0x3" description="Minor Version Value" range="7:0" rwaccess="R"/>
	</register><register id="CPSW_NC_CONTROL_REG" acronym="CPSW_NC_CONTROL_REG" offset="131076" width="32" description="CPSW Switch Control">
		<bitfield id="ECC_CRC_MODE" width="1" begin="31" end="31" resetval="0x0" description="ECC CRC Mode -        0 - ECC errors induced through the ECC aggregator flip bits in the packet headers (not in packet data).     1 - ECC errors induced through the ECC aggregator flip bits in the packet data (not in the packet headers)." range="31" rwaccess="R/W"/>
	<bitfield id="EST_ENABLE" width="1" begin="18" end="18" resetval="0x0" description="Enhanced Scheduled Traffic enable (EST) -        0 - EST is disabled.       1 - EST is enabled" range="18" rwaccess="R/W"/>
	<bitfield id="EEE_ENABLE" width="1" begin="16" end="16" resetval="0x0" description="Energy Efficient Ethernet enable -      0 - Energy Efficient Ethernet is disabled.     1 - Energy Efficient Ethernet is enabled." range="16" rwaccess="R/W"/>
	<bitfield id="P0_FH_PASS_CRC_ERR" width="1" begin="15" end="15" resetval="0x0" description="Port 0 Pass Received CRC errors -      0 - Packets received with CRC errors on port 0 are dropped.     1 - Packets received with CRC errors on port 0 are transferred to the destination ports." range="15" rwaccess="R/W"/>
	<bitfield id="P0_FH_PAD" width="1" begin="14" end="14" resetval="0x0" description="Port 0 Receive Short Packet Pad -      0 - short packets are dropped.     1 - short packets are padded to 64-bytes (with pad and added CRC) if the CRC is not passed in.  Short packets are dropped if the CRC is passed (in the Info0 word)." range="14" rwaccess="R/W"/>
	<bitfield id="P0_TH_CRC_REMOVE" width="1" begin="13" end="13" resetval="0x0" description="Port 0 Transmit CRC remove -      0 - Do not remove the CRC on Port 0 THost (egress) packets.     1 - Remove the CRC on all Port 0 THost (egress) packets." range="13" rwaccess="R/W"/>
	<bitfield id="P8_PASS_PRI_TAGGED" width="1" begin="11" end="11" resetval="0x0" description="Port 8 Pass Priority Tagged -          0 - Priority tagged packets have the zero VID replaced with the input port Enet_P8_PORT_VLAN[11:0] on ingress.         1 - Priority tagged packets are processed unchanged." range="11" rwaccess="R/W"/>
	<bitfield id="P7_PASS_PRI_TAGGED" width="1" begin="10" end="10" resetval="0x0" description="Port 7 Pass Priority Tagged -          0 - Priority tagged packets have the zero VID replaced with the input port Enet_P7_PORT_VLAN[11:0] on ingress.         1 - Priority tagged packets are processed unchanged." range="10" rwaccess="R/W"/>
	<bitfield id="P6_PASS_PRI_TAGGED" width="1" begin="9" end="9" resetval="0x0" description="Port 6 Pass Priority Tagged -          0 - Priority tagged packets have the zero VID replaced with the input port Enet_P6_PORT_VLAN[11:0] on ingress.         1 - Priority tagged packets are processed unchanged." range="9" rwaccess="R/W"/>
	<bitfield id="P5_PASS_PRI_TAGGED" width="1" begin="8" end="8" resetval="0x0" description="Port 5 Pass Priority Tagged -          0 - Priority tagged packets have the zero VID replaced with the input port Enet_P5_PORT_VLAN[11:0] on ingress.         1 - Priority tagged packets are processed unchanged." range="8" rwaccess="R/W"/>
	<bitfield id="P4_PASS_PRI_TAGGED" width="1" begin="7" end="7" resetval="0x0" description="Port 4 Pass Priority Tagged -          0 - Priority tagged packets have the zero VID replaced with the input port Enet_P4_PORT_VLAN[11:0] on ingress.         1 - Priority tagged packets are processed unchanged." range="7" rwaccess="R/W"/>
	<bitfield id="P3_PASS_PRI_TAGGED" width="1" begin="6" end="6" resetval="0x0" description="Port 3 Pass Priority Tagged -          0 - Priority tagged packets have the zero VID replaced with the input port Enet_P3_PORT_VLAN[11:0] on ingress.         1 - Priority tagged packets are processed unchanged." range="6" rwaccess="R/W"/>
	<bitfield id="P2_PASS_PRI_TAGGED" width="1" begin="5" end="5" resetval="0x0" description="Port 2 Pass Priority Tagged -          0 - Priority tagged packets have the zero VID replaced with the input port Enet_P2_PORT_VLAN[11:0] on ingress.         1 - Priority tagged packets are processed unchanged." range="5" rwaccess="R/W"/>
	<bitfield id="P1_PASS_PRI_TAGGED" width="1" begin="4" end="4" resetval="0x0" description="Port 1 Pass Priority Tagged -          0 - Priority tagged packets have the zero VID replaced with the input port Enet_P1_PORT_VLAN[11:0] on ingress.         1 - Priority tagged packets are processed unchanged." range="4" rwaccess="R/W"/>
	<bitfield id="P0_PASS_PRI_TAGGED" width="1" begin="3" end="3" resetval="0x0" description="Port 0 Pass Priority Tagged -          0 - Priority tagged packets have the zero VID replaced with the input port Enet_P0_PORT_VLAN[11:0] on ingress.         1 - Priority tagged packets are processed unchanged." range="3" rwaccess="R/W"/>
	<bitfield id="P0_ENABLE" width="1" begin="2" end="2" resetval="0x0" description="Port 0 Enable -        0 - Port 0 is disabled       1 - Port 0 is enabled" range="2" rwaccess="R/W"/>
	<bitfield id="VLAN_AWARE" width="1" begin="1" end="1" resetval="0x0" description="VLAN Aware Mode -      0 - CPSW_NU is in the VLAN unaware mode.      1 - CPSW_NU is in the VLAN aware mode." range="1" rwaccess="R/W"/>
	<bitfield id="S_CN_SWITCH" width="1" begin="0" end="0" resetval="0x0" description="Service or Customer VLAN switch.        0 - Customer switch.  VLAN processing uses the inner_vlan_ltype.     1 - Service switch.   VLAN processing uses the outer_vlan_ltype." range="0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_STATUS_REG" acronym="CPSW_NC_STATUS_REG" offset="131084" width="32" description="CPSW Status">
		<bitfield id="CPPI_IDLE" width="1" begin="0" end="0" resetval="0x1" description="CPPI Idle - Indicates when set that the CPPI port transmit and receive are idle." range="0" rwaccess="R"/>
	</register><register id="CPSW_NC_EM_CONTROL_REG" acronym="CPSW_NC_EM_CONTROL_REG" offset="131088" width="32" description="CPSW Emulation Control">
		<bitfield id="SOFT" width="1" begin="1" end="1" resetval="0x0" description="Emulation Soft Bit" range="1" rwaccess="R/W"/>
	<bitfield id="FREE" width="1" begin="0" end="0" resetval="0x0" description="Emulation Free Bit" range="0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_STAT_PORT_EN_REG" acronym="CPSW_NC_STAT_PORT_EN_REG" offset="131092" width="32" description="CPSW Statistics Port Enable">
		<bitfield id="P8_STAT_EN" width="1" begin="8" end="8" resetval="0x0" description="Port 8 Statistics Enable        0 - Statistics are disabled for the port.       1 - Statistics are enabled for the port." range="8" rwaccess="R/W"/>
	<bitfield id="P7_STAT_EN" width="1" begin="7" end="7" resetval="0x0" description="Port 7 Statistics Enable        0 - Statistics are disabled for the port.       1 - Statistics are enabled for the port." range="7" rwaccess="R/W"/>
	<bitfield id="P6_STAT_EN" width="1" begin="6" end="6" resetval="0x0" description="Port 6 Statistics Enable        0 - Statistics are disabled for the port.       1 - Statistics are enabled for the port." range="6" rwaccess="R/W"/>
	<bitfield id="P5_STAT_EN" width="1" begin="5" end="5" resetval="0x0" description="Port 5 Statistics Enable        0 - Statistics are disabled for the port.       1 - Statistics are enabled for the port." range="5" rwaccess="R/W"/>
	<bitfield id="P4_STAT_EN" width="1" begin="4" end="4" resetval="0x0" description="Port 4 Statistics Enable        0 - Statistics are disabled for the port.       1 - Statistics are enabled for the port." range="4" rwaccess="R/W"/>
	<bitfield id="P3_STAT_EN" width="1" begin="3" end="3" resetval="0x0" description="Port 3 Statistics Enable        0 - Statistics are disabled for the port.       1 - Statistics are enabled for the port." range="3" rwaccess="R/W"/>
	<bitfield id="P2_STAT_EN" width="1" begin="2" end="2" resetval="0x0" description="Port 2 Statistics Enable        0 - Statistics are disabled for the port.       1 - Statistics are enabled for the port." range="2" rwaccess="R/W"/>
	<bitfield id="P1_STAT_EN" width="1" begin="1" end="1" resetval="0x0" description="Port 1 Statistics Enable        0 - Statistics are disabled for the port.       1 - Statistics are enabled for the port." range="1" rwaccess="R/W"/>
	<bitfield id="P0_STAT_EN" width="1" begin="0" end="0" resetval="0x0" description="Port 0 Statistics Enable        0 - Statistics are disabled for the port.       1 - Statistics are enabled for the port." range="0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_PTYPE_REG" acronym="CPSW_NC_PTYPE_REG" offset="131096" width="32" description="CPSW Transmit Priority Type">
		<bitfield id="P8_PTYPE_ESC" width="1" begin="16" end="16" resetval="0x0" description="Port 8 Priority Type Escalate -          0 - Priority Type Fixed.         1 - Priority Type Escalate" range="16" rwaccess="R/W"/>
	<bitfield id="P7_PTYPE_ESC" width="1" begin="15" end="15" resetval="0x0" description="Port 7 Priority Type Escalate -          0 - Priority Type Fixed.         1 - Priority Type Escalate" range="15" rwaccess="R/W"/>
	<bitfield id="P6_PTYPE_ESC" width="1" begin="14" end="14" resetval="0x0" description="Port 6 Priority Type Escalate -          0 - Priority Type Fixed.         1 - Priority Type Escalate" range="14" rwaccess="R/W"/>
	<bitfield id="P5_PTYPE_ESC" width="1" begin="13" end="13" resetval="0x0" description="Port 5 Priority Type Escalate -          0 - Priority Type Fixed.         1 - Priority Type Escalate" range="13" rwaccess="R/W"/>
	<bitfield id="P4_PTYPE_ESC" width="1" begin="12" end="12" resetval="0x0" description="Port 4 Priority Type Escalate -          0 - Priority Type Fixed.         1 - Priority Type Escalate" range="12" rwaccess="R/W"/>
	<bitfield id="P3_PTYPE_ESC" width="1" begin="11" end="11" resetval="0x0" description="Port 3 Priority Type Escalate -          0 - Priority Type Fixed.         1 - Priority Type Escalate" range="11" rwaccess="R/W"/>
	<bitfield id="P2_PTYPE_ESC" width="1" begin="10" end="10" resetval="0x0" description="Port 2 Priority Type Escalate -          0 - Priority Type Fixed.         1 - Priority Type Escalate" range="10" rwaccess="R/W"/>
	<bitfield id="P1_PTYPE_ESC" width="1" begin="9" end="9" resetval="0x0" description="Port 1 Priority Type Escalate -          0 - Priority Type Fixed.         1 - Priority Type Escalate" range="9" rwaccess="R/W"/>
	<bitfield id="P0_PTYPE_ESC" width="1" begin="8" end="8" resetval="0x0" description="Port 0 Priority Type Escalate -          0 - Priority Type Fixed.         1 - Priority Type Escalate" range="8" rwaccess="R/W"/>
	<bitfield id="ESC_PRI_LD_VAL" width="5" begin="4" end="0" resetval="0x0" description="Escalate Priority Load Value -  When a port is in escalate priority, this is the number of higher priority packets sent before the next lower priority is allowed to send a packet.  Escalate priority allows lower priority packets to be sent at a fixed rate relative to the next higher priority.  The min value of esc_pri_ld_val = 2." range="4:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_SOFT_IDLE_REG" acronym="CPSW_NC_SOFT_IDLE_REG" offset="131100" width="32" description="CPSW Software Idle">
		<bitfield id="SOFT_IDLE" width="1" begin="0" end="0" resetval="0x0" description="Software Idle -      0 - Software idle not commanded.     1 - Command CPSW software idle.  When set, port 0 packet DMA operations stop at the next packet boundary. " range="0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_THRU_RATE_REG" acronym="CPSW_NC_THRU_RATE_REG" offset="131104" width="32" description="CPSW Thru Rate">
		<bitfield id="SL_RX_THRU_RATE" width="4" begin="15" end="12" resetval="0x3" description="This is not a field intended to be changed by software" range="15:12" rwaccess="R/W"/>
	<bitfield id="P0_FH_THRU_RATE" width="4" begin="3" end="0" resetval="0x1" description="This is not a field intended to be changed by software" range="3:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_GAP_THRESH_REG" acronym="CPSW_NC_GAP_THRESH_REG" offset="131108" width="32" description="CPSW Transmit FIFO Short Gap Threshold">
		<bitfield id="GAP_THRESH" width="5" begin="4" end="0" resetval="0x11" description="Ethernet Port Short Gap Threshold -    This is the Ethernet port associated FIFO transmit block usage value for triggering transmit short gap (when short gap is enabled)." range="4:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_EEE_PRESCALE_REG" acronym="CPSW_NC_EEE_PRESCALE_REG" offset="131116" width="32" description="CPSW Energy Efficient Ethernet Prescale Value">
		<bitfield id="EEE_PRESCALE" width="12" begin="11" end="0" resetval="0x0" description="Energy Efficient Ethernet Prescale count load value -   This value is loaded into the EEE pre-scale counter each time the pre-scale count decrements to zero.  The EEE counters are enabled to decrement each time the pre-scale counter reaches zero (and the EEE counters are enabled to count time).  If this value is zero then the EEE counters decrement on every clock.  If this value is 0x001 then the counters decrement on every other clock (and so on). " range="11:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_TX_G_OFLOW_THRESH_SET_REG" acronym="CPSW_NC_TX_G_OFLOW_THRESH_SET_REG" offset="131120" width="32" description="CPSW PFC Tx Global Out Flow Threshold Set">
		<bitfield id="PRI7" width="4" begin="31" end="28" resetval="0x15" description="Priority Based Flow Control Global Outflow Usage Threshold for Pri 7" range="31:28" rwaccess="R/W"/>
	<bitfield id="PRI6" width="4" begin="27" end="24" resetval="0x15" description="Priority Based Flow Control Global Outflow Usage Threshold for Pri 6" range="27:24" rwaccess="R/W"/>
	<bitfield id="PRI5" width="4" begin="23" end="20" resetval="0x15" description="Priority Based Flow Control Global Outflow Usage Threshold for Pri 5" range="23:20" rwaccess="R/W"/>
	<bitfield id="PRI4" width="4" begin="19" end="16" resetval="0x15" description="Priority Based Flow Control Global Outflow Usage Threshold for Pri 4" range="19:16" rwaccess="R/W"/>
	<bitfield id="PRI3" width="4" begin="15" end="12" resetval="0x15" description="Priority Based Flow Control Global Outflow Usage Threshold for Pri 3" range="15:12" rwaccess="R/W"/>
	<bitfield id="PRI2" width="4" begin="11" end="8" resetval="0x15" description="Priority Based Flow Control Global Outflow Usage Threshold for Pri 2" range="11:8" rwaccess="R/W"/>
	<bitfield id="PRI1" width="4" begin="7" end="4" resetval="0x15" description="Priority Based Flow Control Global Outflow Usage Threshold for Pri 1" range="7:4" rwaccess="R/W"/>
	<bitfield id="PRI0" width="4" begin="3" end="0" resetval="0x15" description="Priority Based Flow Control Global Outflow Usage Threshold for Pri 0" range="3:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_TX_G_OFLOW_THRESH_CLR_REG" acronym="CPSW_NC_TX_G_OFLOW_THRESH_CLR_REG" offset="131124" width="32" description="CPSW PFC Tx Global Out Flow Threshold Clear">
		<bitfield id="PRI7" width="4" begin="31" end="28" resetval="0x0" description="Priority Based Flow Control Global Outflow Usage Threshold for Pri 7" range="31:28" rwaccess="R/W"/>
	<bitfield id="PRI6" width="4" begin="27" end="24" resetval="0x0" description="Priority Based Flow Control Global Outflow Usage Threshold for Pri 6" range="27:24" rwaccess="R/W"/>
	<bitfield id="PRI5" width="4" begin="23" end="20" resetval="0x0" description="Priority Based Flow Control Global Outflow Usage Threshold for Pri 5" range="23:20" rwaccess="R/W"/>
	<bitfield id="PRI4" width="4" begin="19" end="16" resetval="0x0" description="Priority Based Flow Control Global Outflow Usage Threshold for Pri 4" range="19:16" rwaccess="R/W"/>
	<bitfield id="PRI3" width="4" begin="15" end="12" resetval="0x0" description="Priority Based Flow Control Global Outflow Usage Threshold for Pri 3" range="15:12" rwaccess="R/W"/>
	<bitfield id="PRI2" width="4" begin="11" end="8" resetval="0x0" description="Priority Based Flow Control Global Outflow Usage Threshold for Pri 2" range="11:8" rwaccess="R/W"/>
	<bitfield id="PRI1" width="4" begin="7" end="4" resetval="0x0" description="Priority Based Flow Control Global Outflow Usage Threshold for Pri 1" range="7:4" rwaccess="R/W"/>
	<bitfield id="PRI0" width="4" begin="3" end="0" resetval="0x0" description="Priority Based Flow Control Global Outflow Usage Threshold for Pri 0" range="3:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_TX_G_BUF_THRESH_SET_L_REG" acronym="CPSW_NC_TX_G_BUF_THRESH_SET_L_REG" offset="131128" width="32" description="CPSW PFC Global Tx Buffer Threshold Set Low">
		<bitfield id="PRI3" width="8" begin="31" end="24" resetval="0x255" description="Priority Based Flow Control Global Buffer Usage Threshold for Priority 3" range="31:24" rwaccess="R/W"/>
	<bitfield id="PRI2" width="8" begin="23" end="16" resetval="0x255" description="Priority Based Flow Control Global Buffer Usage Threshold for Priority 2" range="23:16" rwaccess="R/W"/>
	<bitfield id="PRI1" width="8" begin="15" end="8" resetval="0x255" description="Priority Based Flow Control Global Buffer Usage Threshold for Priority 1" range="15:8" rwaccess="R/W"/>
	<bitfield id="PRI0" width="8" begin="7" end="0" resetval="0x255" description="Priority Based Flow Control Global Buffer Usage Threshold for Priority 0" range="7:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_TX_G_BUF_THRESH_SET_H_REG" acronym="CPSW_NC_TX_G_BUF_THRESH_SET_H_REG" offset="131132" width="32" description="CPSW PFC Global Tx Buffer Threshold Set High">
		<bitfield id="PRI7" width="8" begin="31" end="24" resetval="0x255" description="Priority Based Flow Control Global Buffer Usage Threshold for Priority 7" range="31:24" rwaccess="R/W"/>
	<bitfield id="PRI6" width="8" begin="23" end="16" resetval="0x255" description="Priority Based Flow Control Global Buffer Usage Threshold for Priority 6" range="23:16" rwaccess="R/W"/>
	<bitfield id="PRI5" width="8" begin="15" end="8" resetval="0x255" description="Priority Based Flow Control Global Buffer Usage Threshold for Priority 5" range="15:8" rwaccess="R/W"/>
	<bitfield id="PRI4" width="8" begin="7" end="0" resetval="0x255" description="Priority Based Flow Control Global Buffer Usage Threshold for Priority 4" range="7:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_TX_G_BUF_THRESH_CLR_L_REG" acronym="CPSW_NC_TX_G_BUF_THRESH_CLR_L_REG" offset="131136" width="32" description="CPSW PFC Global Tx Buffer Threshold Clear Low">
		<bitfield id="PRI3" width="8" begin="31" end="24" resetval="0x0" description="Priority Based Flow Control Global Buffer Usage Threshold for Priority 3" range="31:24" rwaccess="R/W"/>
	<bitfield id="PRI2" width="8" begin="23" end="16" resetval="0x0" description="Priority Based Flow Control Global Buffer Usage Threshold for Priority 2" range="23:16" rwaccess="R/W"/>
	<bitfield id="PRI1" width="8" begin="15" end="8" resetval="0x0" description="Priority Based Flow Control Global Buffer Usage Threshold for Priority 1" range="15:8" rwaccess="R/W"/>
	<bitfield id="PRI0" width="8" begin="7" end="0" resetval="0x0" description="Priority Based Flow Control Global Buffer Usage Threshold for Priority 0" range="7:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_TX_G_BUF_THRESH_CLR_H_REG" acronym="CPSW_NC_TX_G_BUF_THRESH_CLR_H_REG" offset="131140" width="32" description="CPSW PFC Global Tx Buffer Threshold Clear High">
		<bitfield id="PRI7" width="8" begin="31" end="24" resetval="0x0" description="Priority Based Flow Control Global Buffer Usage Threshold for Priority 7" range="31:24" rwaccess="R/W"/>
