ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263X/CPSW_CPSW_52800000h.xml
	<bitfield id="PRI6" width="8" begin="23" end="16" resetval="0x0" description="Priority Based Flow Control Global Buffer Usage Threshold for Priority 6" range="23:16" rwaccess="R/W"/>
	<bitfield id="PRI5" width="8" begin="15" end="8" resetval="0x0" description="Priority Based Flow Control Global Buffer Usage Threshold for Priority 5" range="15:8" rwaccess="R/W"/>
	<bitfield id="PRI4" width="8" begin="7" end="0" resetval="0x0" description="Priority Based Flow Control Global Buffer Usage Threshold for Priority 4" range="7:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_VLAN_LTYPE_REG" acronym="CPSW_NC_VLAN_LTYPE_REG" offset="131152" width="32" description="VLAN Length/type">
		<bitfield id="VLAN_LTYPE_OUTER" width="16" begin="31" end="16" resetval="0x34984" description="Outer VLAN LType" range="31:16" rwaccess="R/W"/>
	<bitfield id="VLAN_LTYPE_INNER" width="16" begin="15" end="0" resetval="0x33024" description="Inner VLAN LType" range="15:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_EST_TS_DOMAIN_REG" acronym="CPSW_NC_EST_TS_DOMAIN_REG" offset="131156" width="32" description="Enhanced Scheduled Traffic Host Event Domain">
		<bitfield id="EST_TS_DOMAIN" width="8" begin="7" end="0" resetval="0x0" description="Enhanced Scheduled Traffic domain.  This value is used as the domain in the CPTS event to indicate that the event came from EST." range="7:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_TX_PRI0_MAXLEN_REG" acronym="CPSW_NC_TX_PRI0_MAXLEN_REG" offset="131328" width="32" description="Transmit Priority 0 Maximum Length">
		<bitfield id="TX_PRI0_MAXLEN" width="14" begin="13" end="0" resetval="0x2024" description="This value determines the maximum packet length that will be transmitted on priority 0 Ethernet egress for all Ethernet ports.  The packet length compared to the maximum length value is the ingress packet length (not the actual egress packet length which is the length before VLAN addition or removal or any other egress processing).  Packets on a priority that are larger than this value are dropped. " range="13:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_TX_PRI1_MAXLEN_REG" acronym="CPSW_NC_TX_PRI1_MAXLEN_REG" offset="131332" width="32" description="Transmit Priority 1 Maximum Length">
		<bitfield id="TX_PRI1_MAXLEN" width="14" begin="13" end="0" resetval="0x2024" description="This value determines the maximum packet length that will be transmitted on priority 1 Ethernet egress for all Ethernet ports.  The packet length compared to the maximum length value is the ingress packet length (not the actual egress packet length which is the length before VLAN addition or removal or any other egress processing).  Packets on a priority that are larger than this value are dropped. " range="13:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_TX_PRI2_MAXLEN_REG" acronym="CPSW_NC_TX_PRI2_MAXLEN_REG" offset="131336" width="32" description="Transmit Priority 2 Maximum Length">
		<bitfield id="TX_PRI2_MAXLEN" width="14" begin="13" end="0" resetval="0x2024" description="This value determines the maximum packet length that will be transmitted on priority 2 Ethernet egress for all Ethernet ports.  The packet length compared to the maximum length value is the ingress packet length (not the actual egress packet length which is the length before VLAN addition or removal or any other egress processing).  Packets on a priority that are larger than this value are dropped. " range="13:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_TX_PRI3_MAXLEN_REG" acronym="CPSW_NC_TX_PRI3_MAXLEN_REG" offset="131340" width="32" description="Transmit Priority 3 Maximum Length">
		<bitfield id="TX_PRI3_MAXLEN" width="14" begin="13" end="0" resetval="0x2024" description="This value determines the maximum packet length that will be transmitted on priority 3 Ethernet egress for all Ethernet ports.  The packet length compared to the maximum length value is the ingress packet length (not the actual egress packet length which is the length before VLAN addition or removal or any other egress processing).  Packets on a priority that are larger than this value are dropped. " range="13:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_TX_PRI4_MAXLEN_REG" acronym="CPSW_NC_TX_PRI4_MAXLEN_REG" offset="131344" width="32" description="Transmit Priority 4 Maximum Length">
		<bitfield id="TX_PRI4_MAXLEN" width="14" begin="13" end="0" resetval="0x2024" description="This value determines the maximum packet length that will be transmitted on priority 4 Ethernet egress for all Ethernet ports.  The packet length compared to the maximum length value is the ingress packet length (not the actual egress packet length which is the length before VLAN addition or removal or any other egress processing).  Packets on a priority that are larger than this value are dropped. " range="13:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_TX_PRI5_MAXLEN_REG" acronym="CPSW_NC_TX_PRI5_MAXLEN_REG" offset="131348" width="32" description="Transmit Priority 5 Maximum Length">
		<bitfield id="TX_PRI5_MAXLEN" width="14" begin="13" end="0" resetval="0x2024" description="This value determines the maximum packet length that will be transmitted on priority 5 Ethernet egress for all Ethernet ports.  The packet length compared to the maximum length value is the ingress packet length (not the actual egress packet length which is the length before VLAN addition or removal or any other egress processing).  Packets on a priority that are larger than this value are dropped. " range="13:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_TX_PRI6_MAXLEN_REG" acronym="CPSW_NC_TX_PRI6_MAXLEN_REG" offset="131352" width="32" description="Transmit Priority 6 Maximum Length">
		<bitfield id="TX_PRI6_MAXLEN" width="14" begin="13" end="0" resetval="0x2024" description="This value determines the maximum packet length that will be transmitted on priority 6 Ethernet egress for all Ethernet ports.  The packet length compared to the maximum length value is the ingress packet length (not the actual egress packet length which is the length before VLAN addition or removal or any other egress processing).  Packets on a priority that are larger than this value are dropped. " range="13:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_TX_PRI7_MAXLEN_REG" acronym="CPSW_NC_TX_PRI7_MAXLEN_REG" offset="131356" width="32" description="Transmit Priority 7 Maximum Length">
		<bitfield id="TX_PRI7_MAXLEN" width="14" begin="13" end="0" resetval="0x2024" description="This value determines the maximum packet length that will be transmitted on priority 7 Ethernet egress for all Ethernet ports.  The packet length compared to the maximum length value is the ingress packet length (not the actual egress packet length which is the length before VLAN addition or removal or any other egress processing).  Packets on a priority that are larger than this value are dropped. " range="13:0" rwaccess="R/W"/>
	</register><register id="CPSW_MDIO_USER_GROUP_USER_ACCESS_REG_j" acronym="CPSW_MDIO_USER_GROUP_USER_ACCESS_REG_j" offset="3968" width="32" description="MDIO User Access  Register">
		<bitfield id="GO" width="1" begin="31" end="31" resetval="0x0" description="Go.  Writing a 1 to this bit causes the MDIO state machine to perform an MDIO access when it is convenient for it to do so, this is not an instantaneous process.  Writing a 0 to this bit has no effect.  This bit is write able only if the MDIO state machine is enabled.  This bit will self clear when the requested access has been completed. Any writes to the MDIOUserAccess0 register are blocked when the go bit is 1. If byte access is being used, the go bit should be written last." range="31" rwaccess="R/W"/>
	<bitfield id="WRITE" width="1" begin="30" end="30" resetval="0x0" description="Write enable.  Setting this bit to a 1 causes the MDIO transaction to be a register write, otherwise it is a register read." range="30" rwaccess="R/W"/>
	<bitfield id="ACK" width="1" begin="29" end="29" resetval="0x0" description="Acknowledge.  This bit is set if the PHY acknowledged the read  transaction." range="29" rwaccess="R/W"/>
	<bitfield id="REGADR" width="5" begin="25" end="21" resetval="0x0" description="Register address.  This field specifies the PHY register to be accessed for this transaction in clause 22 mode or the MMD value in clause 45 mode." range="25:21" rwaccess="R/W"/>
	<bitfield id="PHYADR" width="5" begin="20" end="16" resetval="0x0" description="PHY address.  This field specifies the PHY to be accessed for this transaction." range="20:16" rwaccess="R/W"/>
	<bitfield id="DATA" width="16" begin="15" end="0" resetval="0x0" description="User data.  The data value read from or to be written to the specified PHY register." range="15:0" rwaccess="R/W"/>
	</register><register id="CPSW_MDIO_USER_GROUP_USER_PHY_SEL_REG_j" acronym="CPSW_MDIO_USER_GROUP_USER_PHY_SEL_REG_j" offset="3972" width="32" description="MDIO User PHY Select Register">
		<bitfield id="LINKSEL" width="1" begin="7" end="7" resetval="0x0" description="Link status determination select. Set to 1 to determine link status using the MLINK pin. Default value is 0 which implies that the link status is determined by the MDIO state machine." range="7" rwaccess="R/W"/>
	<bitfield id="LINKINT_ENABLE" width="1" begin="6" end="6" resetval="0x0" description="Link change interrupt enable. Set to 1 to enable link change status interrupts for PHY address specified in phyadr_mon. Link change interrupts are disabled if this bit is set to 0." range="6" rwaccess="R/W"/>
	<bitfield id="PHYADR_MON" width="5" begin="4" end="0" resetval="0x0" description="PHY address whose link status is to be monitored." range="4:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPPI_P0_CONTROL_REG" acronym="CPSW_NC_CPPI_P0_CONTROL_REG" offset="135172" width="32" description="CPPI Port 0 Control">
		<bitfield id="FH_REMAP_DSCP_V6" width="1" begin="18" end="18" resetval="0x0" description="Port 0 FHost (ingress) remap priority to DSCP IPV6 priority (see packet priority handling section for details).       0 - Hardware switch priority IPV6 DSCP priority remapping is disabled.       1 - Hardware switch priority IPV6 DSCP priority remapping is enabled." range="18" rwaccess="R/W"/>
	<bitfield id="FH_REMAP_DSCP_V4" width="1" begin="17" end="17" resetval="0x0" description="Port 0 FHost (ingress) remap priority to DSCP IPV4 priority (see packet priority handling section for details).       0 - Hardware switch priority IPV4 DSCP priority remapping is disabled.       1 - Hardware switch priority IPV4 DSCP priority remapping is enabled." range="17" rwaccess="R/W"/>
	<bitfield id="FH_REMAP_VLAN" width="1" begin="16" end="16" resetval="0x0" description="Port 0 receive (ingress) remap priority to VLAN.  See priority remapping section for details." range="16" rwaccess="R/W"/>
	<bitfield id="FH_ECC_ERR_EN" width="1" begin="15" end="15" resetval="0x0" description="Port 0 FHost ECC Error Enable.  This bit must be set to enable FHost ECC error operations" range="15" rwaccess="R/W"/>
	<bitfield id="TH_ECC_ERR_EN" width="1" begin="14" end="14" resetval="0x0" description="Port 0 THost ECC Error Enable.  This bit must be set to enable THost ECC error operations." range="14" rwaccess="R/W"/>
	<bitfield id="TH_CHECKSUM_EN" width="1" begin="3" end="3" resetval="0x0" description="Port 0 THost (egress) Checksum Enable       0 - THost checksum is disabled.       1 - THost checksum is enabled.  IPV4/V6 Packets have checksum information (4-bytes) included at the end of the packet data when the chksum_encap descriptor bit is set in the EOP THost buffer descriptor." range="3" rwaccess="R/W"/>
	<bitfield id="FH_DSCP_IPV6_EN" width="1" begin="2" end="2" resetval="0x0" description="Port 0 FHost IPv6 DSCP enable       0 - Ipv6 DSCP priority mapping is disabled.       1 - Ipv6 DSCP priority mapping is enabled." range="2" rwaccess="R/W"/>
	<bitfield id="FH_DSCP_IPV4_EN" width="1" begin="1" end="1" resetval="0x0" description="Port 0 FHost IPv4 DSCP enable       0 - Ipv4 DSCP priority mapping is disabled.       1 - Ipv4 DSCP priority mapping is enabled." range="1" rwaccess="R/W"/>
	<bitfield id="FH_CHECKSUM_EN" width="1" begin="0" end="0" resetval="0x0" description="Port 0 FHost (port 0 ingress) Checksum Enable     0 - FHost checksum is disabled.     1 - FHost checksum is enabled.  Four bytes of checksum information can be included at the start of the packet data to be used for checksum packet processing when chksum_encap is set in the SOP FHost buffer descriptor." range="0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPPI_P0_BLK_CNT_REG" acronym="CPSW_NC_CPPI_P0_BLK_CNT_REG" offset="135184" width="32" description="CPPI Port 0 FIFO Block Usage Count">
		<bitfield id="TH_BLK_CNT" width="5" begin="12" end="8" resetval="0x0" description="Port 0 Transmit Block Count Usage - This value is the number of blocks allocated to the FIFO logical transmit queues.   note: for N=2 this field is always zero (no transmit FIFO)." range="12:8" rwaccess="R"/>
	<bitfield id="FH_BLK_CNT" width="6" begin="5" end="0" resetval="0x1" description="Port 0 Receive Block Count Usage - This value is the number of blocks allocated in the receive FIFO." range="5:0" rwaccess="R"/>
	</register><register id="CPSW_NC_CPPI_P0_PORT_VLAN_REG" acronym="CPSW_NC_CPPI_P0_PORT_VLAN_REG" offset="135188" width="32" description="CPPI Port 0 VLAN">
		<bitfield id="PORT_PRI" width="3" begin="15" end="13" resetval="0x0" description="Port VLAN Priority" range="15:13" rwaccess="R/W"/>
	<bitfield id="PORT_CFI" width="1" begin="12" end="12" resetval="0x0" description="Port CFI bit" range="12" rwaccess="R/W"/>
	<bitfield id="PORT_VID" width="12" begin="11" end="0" resetval="0x0" description="Port VLAN ID" range="11:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPPI_P0_TH_PRI_MAP_REG" acronym="CPSW_NC_CPPI_P0_TH_PRI_MAP_REG" offset="135192" width="32" description="CPPI Port 0 Tx Header Pri to Switch Pri Mapping">
		<bitfield id="PRI7" width="3" begin="30" end="28" resetval="0x7" description="Priority 7 - A packet header priority of 0x7 is given this switch queue priority." range="30:28" rwaccess="R/W"/>
	<bitfield id="PRI6" width="3" begin="26" end="24" resetval="0x6" description="Priority 6 - A packet header priority of 0x7 is given this switch queue priority." range="26:24" rwaccess="R/W"/>
	<bitfield id="PRI5" width="3" begin="22" end="20" resetval="0x5" description="Priority 5 - A packet header priority of 0x7 is given this switch queue priority." range="22:20" rwaccess="R/W"/>
	<bitfield id="PRI4" width="3" begin="18" end="16" resetval="0x4" description="Priority 4 - A packet header priority of 0x7 is given this switch queue priority." range="18:16" rwaccess="R/W"/>
	<bitfield id="PRI3" width="3" begin="14" end="12" resetval="0x3" description="Priority 3 - A packet header priority of 0x7 is given this switch queue priority." range="14:12" rwaccess="R/W"/>
	<bitfield id="PRI2" width="3" begin="10" end="8" resetval="0x2" description="Priority 2 - A packet header priority of 0x7 is given this switch queue priority." range="10:8" rwaccess="R/W"/>
	<bitfield id="PRI1" width="3" begin="6" end="4" resetval="0x1" description="Priority 1 - A packet header priority of 0x7 is given this switch queue priority." range="6:4" rwaccess="R/W"/>
	<bitfield id="PRI0" width="3" begin="2" end="0" resetval="0x0" description="Priority 0 - A packet header priority of 0x7 is given this switch queue priority." range="2:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPPI_P0_PRI_CTL_REG" acronym="CPSW_NC_CPPI_P0_PRI_CTL_REG" offset="135196" width="32" description="CPPI Port 0 Priority Control">
		<bitfield id="FH_FLOW_PRI" width="8" begin="23" end="16" resetval="0x0" description="Receive Priority Based Flow Control Enable (per priority).  Note: for N=2 this field should remain zero." range="23:16" rwaccess="R/W"/>
	<bitfield id="FH_PTYPE" width="1" begin="8" end="8" resetval="0x0" description="Receive Priority Type" range="8" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPPI_P0_FH_PRI_MAP_REG" acronym="CPSW_NC_CPPI_P0_FH_PRI_MAP_REG" offset="135200" width="32" description="CPPI Port 0 RX Pkt Pri to Header Pri Map">
		<bitfield id="PRI7" width="3" begin="30" end="28" resetval="0x7" description="Priority 7 - A packet priority of 0x7 is mapped (changed) to this header packet priority." range="30:28" rwaccess="R/W"/>
	<bitfield id="PRI6" width="3" begin="26" end="24" resetval="0x6" description="Priority 6 - A packet priority of 0x6 is mapped (changed) to this header packet priority." range="26:24" rwaccess="R/W"/>
	<bitfield id="PRI5" width="3" begin="22" end="20" resetval="0x5" description="Priority 5 - A packet priority of 0x5 is mapped (changed) to this header packet priority." range="22:20" rwaccess="R/W"/>
	<bitfield id="PRI4" width="3" begin="18" end="16" resetval="0x4" description="Priority 4 - A packet priority of 0x4 is mapped (changed) to this header packet priority." range="18:16" rwaccess="R/W"/>
	<bitfield id="PRI3" width="3" begin="14" end="12" resetval="0x3" description="Priority 3 - A packet priority of 0x3 is mapped (changed) to this header packet priority." range="14:12" rwaccess="R/W"/>
	<bitfield id="PRI2" width="3" begin="10" end="8" resetval="0x2" description="Priority 2 - A packet priority of 0x2 is mapped (changed) to this header packet priority." range="10:8" rwaccess="R/W"/>
	<bitfield id="PRI1" width="3" begin="6" end="4" resetval="0x1" description="Priority 1 - A packet priority of 0x1 is mapped (changed) to this header packet priority." range="6:4" rwaccess="R/W"/>
	<bitfield id="PRI0" width="3" begin="2" end="0" resetval="0x0" description="Priority 0 - A packet priority of 0x0 is mapped (changed) to this header packet priority." range="2:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPPI_P0_FH_MAXLEN_REG" acronym="CPSW_NC_CPPI_P0_FH_MAXLEN_REG" offset="135204" width="32" description="CPPI Port 0 Receive Frame Max Length">
		<bitfield id="FH_MAXLEN" width="14" begin="13" end="0" resetval="0x1518" description="Port 0 Ingress Maximum Frame Length - This field determines the maximum length of a received frame.  The reset value is 1518 (dec).  Frames with byte counts greater than p0_fh_maxlen are long frames.  Long frames with no errors are oversized frames.  Long frames with CRC, code, or alignment error are jabber frames.  The maximum value is 9604 (including VLAN) when the CPSW is configured with 1 = 4.  When 1 = 1 the maximum value is 2024 (including VLAN)." range="13:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPPI_P0_TH_BLKS_PRI_REG" acronym="CPSW_NC_CPPI_P0_TH_BLKS_PRI_REG" offset="135208" width="32" description="CPPI Port 0 Transmit Block Sub Per Priority">
		<bitfield id="PRI7" width="4" begin="31" end="28" resetval="0x0" description="Priority 7 Port Transmit Blocks" range="31:28" rwaccess="R/W"/>
	<bitfield id="PRI6" width="4" begin="27" end="24" resetval="0x1" description="Priority 6 Port Transmit Blocks" range="27:24" rwaccess="R/W"/>
	<bitfield id="PRI5" width="4" begin="23" end="20" resetval="0x2" description="Priority 5 Port Transmit Blocks" range="23:20" rwaccess="R/W"/>
	<bitfield id="PRI4" width="4" begin="19" end="16" resetval="0x4" description="Priority 4 Port Transmit Blocks" range="19:16" rwaccess="R/W"/>
	<bitfield id="PRI3" width="4" begin="15" end="12" resetval="0x5" description="Priority 3 Port Transmit Blocks" range="15:12" rwaccess="R/W"/>
	<bitfield id="PRI2" width="4" begin="11" end="8" resetval="0x6" description="Priority 2 Port Transmit Blocks" range="11:8" rwaccess="R/W"/>
	<bitfield id="PRI1" width="4" begin="7" end="4" resetval="0x7" description="Priority 1 Port Transmit Blocks" range="7:4" rwaccess="R/W"/>
	<bitfield id="PRI0" width="4" begin="3" end="0" resetval="0x8" description="Priority 0 Port Transmit Blocks" range="3:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPPI_P0_IDLE2LPI_REG" acronym="CPSW_NC_CPPI_P0_IDLE2LPI_REG" offset="135216" width="32" description="Port 0 EEE Idle to LPI counter">
		<bitfield id="COUNT" width="24" begin="23" end="0" resetval="0x0" description="Port 0 EEE Idle to LPI counter load value - After CLKSTOP_REQ is asserted, this value is loaded into the port 0 idle to LPI counter on each clock that the port 0 transmit is not idle.  Port 0 enters the transmit LPI state when this counter decrements to zero.  This counter decrements each time the EEE prescale counter decrements to zero." range="23:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPPI_P0_LPI2WAKE_REG" acronym="CPSW_NC_CPPI_P0_LPI2WAKE_REG" offset="135220" width="32" description="Port 0 EEE LPI to wake counter">
		<bitfield id="COUNT" width="24" begin="23" end="0" resetval="0x0" description="Port 0 EEE LPI to wake counter load value - When the port is in the transmit LPI state and the CLKSTOP_REQ signal is deasserted, this value is loaded into the port 0 LPI to wake counter.  Transmit packet operations may begin (resume) when the LPI to wake count decrements to zero (on the pre-scale count).  This is the time that the CPDMA transmit must wait before transmit (switch ingress) packet operations begin (resume after wakeup)." range="23:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPPI_P0_EEE_STATUS_REG" acronym="CPSW_NC_CPPI_P0_EEE_STATUS_REG" offset="135224" width="32" description="Port 0 EEE status">
		<bitfield id="TH_FIFO_EMPTY" width="1" begin="6" end="6" resetval="0x1" description="CPPI port 0 transmit FIFO (switch egress) is empty - contains no packets" range="6" rwaccess="R"/>
	<bitfield id="FH_FIFO_EMPTY" width="1" begin="5" end="5" resetval="0x1" description="CPPI port 0 receive FIFO (switch ingress) is empty - contains no packets" range="5" rwaccess="R"/>
	<bitfield id="TH_FIFO_HOLD" width="1" begin="4" end="4" resetval="0x0" description="CPPI port 0 transmit FIFO hold - asserted in the LPI state and during the LPI2WAKE count time" range="4" rwaccess="R"/>
	<bitfield id="TH_WAKE" width="1" begin="3" end="3" resetval="0x0" description="CPPI port 0 transmit wakeup - asserted in the transmit LPI2WAKE count time" range="3" rwaccess="R"/>
	<bitfield id="TH_LPI" width="1" begin="2" end="2" resetval="0x0" description="CPPI port 0 transmit LPI state - asserted when the port 0 transmit is in the LPI state" range="2" rwaccess="R"/>
	<bitfield id="FH_LPI" width="1" begin="1" end="1" resetval="0x0" description="CPPI port 0 receive LPI state - asserted when the port 0 receive is in the LPI state" range="1" rwaccess="R"/>
	<bitfield id="WAIT_IDLE2LPI" width="1" begin="0" end="0" resetval="0x0" description="CPPI port 0 wait idle to LPI - asserted when port 0 is counting the IDLE2LPI time" range="0" rwaccess="R"/>
	</register><register id="CPSW_NC_CPPI_P0_FIFO_STATUS_REG" acronym="CPSW_NC_CPPI_P0_FIFO_STATUS_REG" offset="135248" width="32" description="Port 0 FIFO Status">
		<bitfield id="TH_PRI_ACTIVE" width="8" begin="7" end="0" resetval="0x0" description="Port 0 Transmit FIFO Priority Active.  Each bit indicates whether the corresponding FIFO priority has one or more queued packets on it or not.  note: for N=2 this field is always zero (there is no transmit FIFO)." range="7:0" rwaccess="R"/>
	</register><register id="CPSW_NC_CPPI_FH_DSCP_MAP_REG_j" acronym="CPSW_NC_CPPI_FH_DSCP_MAP_REG_j" offset="135456" width="32" description="CPPI Receive IPV4/IPV6 DSCP Map N">
		<bitfield id="PRI7" width="3" begin="30" end="28" resetval="0x0" description="A DSCP IPV4/V6 packet TOS 7  is mapped to this received priority" range="30:28" rwaccess="R/W"/>
	<bitfield id="PRI6" width="3" begin="26" end="24" resetval="0x0" description="A DSCP IPV4/V6 packet TOS 6  is mapped to this received priority" range="26:24" rwaccess="R/W"/>
	<bitfield id="PRI5" width="3" begin="22" end="20" resetval="0x0" description="A DSCP IPV4/V6 packet TOS 5  is mapped to this received priority" range="22:20" rwaccess="R/W"/>
