ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263X/CPSW_CPSW_52800000h.xml
	<bitfield id="PRI4" width="3" begin="18" end="16" resetval="0x0" description="A DSCP IPV4/V6 packet TOS 4  is mapped to this received priority" range="18:16" rwaccess="R/W"/>
	<bitfield id="PRI3" width="3" begin="14" end="12" resetval="0x0" description="A DSCP IPV4/V6 packet TOS 3  is mapped to this received priority" range="14:12" rwaccess="R/W"/>
	<bitfield id="PRI2" width="3" begin="10" end="8" resetval="0x0" description="A DSCP IPV4/V6 packet TOS 2  is mapped to this received priority" range="10:8" rwaccess="R/W"/>
	<bitfield id="PRI1" width="3" begin="6" end="4" resetval="0x0" description="A DSCP IPV4/V6 packet TOS 1  is mapped to this received priority" range="6:4" rwaccess="R/W"/>
	<bitfield id="PRI0" width="3" begin="2" end="0" resetval="0x0" description="A DSCP IPV4/V6 packet TOS 0  is mapped to this received priority" range="2:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPPI_P0_PRI_CIR_REG_j" acronym="CPSW_NC_CPPI_P0_PRI_CIR_REG_j" offset="135488" width="32" description="CPPI Port 0 Rx Priority P Committed Information Rate">
		<bitfield id="PRI_CIR" width="28" begin="27" end="0" resetval="0x0" description="Priority N Committed Information Rate" range="27:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPPI_P0_PRI_EIR_REG_j" acronym="CPSW_NC_CPPI_P0_PRI_EIR_REG_j" offset="135520" width="32" description="CPPI Port 0 Rx Priority P Excess Information Rate">
		<bitfield id="PRI_EIR" width="28" begin="27" end="0" resetval="0x0" description="Priority N Excess Information Rate" range="27:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPPI_P0_TH_D_THRESH_SET_L_REG" acronym="CPSW_NC_CPPI_P0_TH_D_THRESH_SET_L_REG" offset="135552" width="32" description="CPPI Port 0 Tx PFC Destination Threshold Set Low">
		<bitfield id="PRI3" width="5" begin="28" end="24" resetval="0x31" description="Port Priority Based Flow Control Threshold Set Value for Priority 3" range="28:24" rwaccess="R/W"/>
	<bitfield id="PRI2" width="5" begin="20" end="16" resetval="0x31" description="Port Priority Based Flow Control Threshold Set Value for Priority 2" range="20:16" rwaccess="R/W"/>
	<bitfield id="PRI1" width="5" begin="12" end="8" resetval="0x31" description="Port Priority Based Flow Control Threshold Set Value for Priority 1" range="12:8" rwaccess="R/W"/>
	<bitfield id="PRI0" width="5" begin="4" end="0" resetval="0x31" description="Port Priority Based Flow Control Threshold Set Value for Priority 0" range="4:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPPI_P0_TH_D_THRESH_SET_H_REG" acronym="CPSW_NC_CPPI_P0_TH_D_THRESH_SET_H_REG" offset="135556" width="32" description="CPPI Port 0 Tx PFC Destination Threshold Set High">
		<bitfield id="PRI7" width="5" begin="28" end="24" resetval="0x31" description="Port Priority Based Flow Control Threshold Set Value for Priority 7" range="28:24" rwaccess="R/W"/>
	<bitfield id="PRI6" width="5" begin="20" end="16" resetval="0x31" description="Port Priority Based Flow Control Threshold Set Value for Priority 6" range="20:16" rwaccess="R/W"/>
	<bitfield id="PRI5" width="5" begin="12" end="8" resetval="0x31" description="Port Priority Based Flow Control Threshold Set Value for Priority 5" range="12:8" rwaccess="R/W"/>
	<bitfield id="PRI4" width="5" begin="4" end="0" resetval="0x31" description="Port Priority Based Flow Control Threshold Set Value for Priority 4" range="4:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPPI_P0_TH_D_THRESH_CLR_L_REG" acronym="CPSW_NC_CPPI_P0_TH_D_THRESH_CLR_L_REG" offset="135560" width="32" description="CPPI Port 0 Tx PFC Destination Threshold Clr Low">
		<bitfield id="PRI3" width="5" begin="28" end="24" resetval="0x0" description="Port Priority Based Flow Control Threshold Clear Value for Priority 3" range="28:24" rwaccess="R/W"/>
	<bitfield id="PRI2" width="5" begin="20" end="16" resetval="0x0" description="Port Priority Based Flow Control Threshold Clear Value for Priority 2" range="20:16" rwaccess="R/W"/>
	<bitfield id="PRI1" width="5" begin="12" end="8" resetval="0x0" description="Port Priority Based Flow Control Threshold Clear Value for Priority 1" range="12:8" rwaccess="R/W"/>
	<bitfield id="PRI0" width="5" begin="4" end="0" resetval="0x0" description="Port Priority Based Flow Control Threshold Clear Value for Priority 0" range="4:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPPI_P0_TH_D_THRESH_CLR_H_REG" acronym="CPSW_NC_CPPI_P0_TH_D_THRESH_CLR_H_REG" offset="135564" width="32" description="CPPI Port 0 Tx PFC Destination Threshold Clr High">
		<bitfield id="PRI7" width="5" begin="28" end="24" resetval="0x0" description="Port Priority Based Flow Control Threshold Clear Value for Priority 7" range="28:24" rwaccess="R/W"/>
	<bitfield id="PRI6" width="5" begin="20" end="16" resetval="0x0" description="Port Priority Based Flow Control Threshold Clear Value for Priority 6" range="20:16" rwaccess="R/W"/>
	<bitfield id="PRI5" width="5" begin="12" end="8" resetval="0x0" description="Port Priority Based Flow Control Threshold Clear Value for Priority 5" range="12:8" rwaccess="R/W"/>
	<bitfield id="PRI4" width="5" begin="4" end="0" resetval="0x0" description="Port Priority Based Flow Control Threshold Clear Value for Priority 4" range="4:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPPI_P0_TH_G_BUF_THRESH_SET_L_REG" acronym="CPSW_NC_CPPI_P0_TH_G_BUF_THRESH_SET_L_REG" offset="135568" width="32" description="CPPI Port 0 Tx PFC Global Buffer Threshold Set Low">
		<bitfield id="PRI3" width="5" begin="28" end="24" resetval="0x31" description="Port Priority Based Flow Control Threshold Set Value for Priority 3" range="28:24" rwaccess="R/W"/>
	<bitfield id="PRI2" width="5" begin="20" end="16" resetval="0x31" description="Port Priority Based Flow Control Threshold Set Value for Priority 2" range="20:16" rwaccess="R/W"/>
	<bitfield id="PRI1" width="5" begin="12" end="8" resetval="0x31" description="Port Priority Based Flow Control Threshold Set Value for Priority 1" range="12:8" rwaccess="R/W"/>
	<bitfield id="PRI0" width="5" begin="4" end="0" resetval="0x31" description="Port Priority Based Flow Control Threshold Set Value for Priority 0" range="4:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPPI_P0_TH_G_BUF_THRESH_SET_H_REG" acronym="CPSW_NC_CPPI_P0_TH_G_BUF_THRESH_SET_H_REG" offset="135572" width="32" description="CPPI Port 0 Tx PFC Global Buffer Threshold Set High">
		<bitfield id="PRI7" width="5" begin="28" end="24" resetval="0x31" description="Port Priority Based Flow Control Threshold Set Value for Priority 7" range="28:24" rwaccess="R/W"/>
	<bitfield id="PRI6" width="5" begin="20" end="16" resetval="0x31" description="Port Priority Based Flow Control Threshold Set Value for Priority 6" range="20:16" rwaccess="R/W"/>
	<bitfield id="PRI5" width="5" begin="12" end="8" resetval="0x31" description="Port Priority Based Flow Control Threshold Set Value for Priority 5" range="12:8" rwaccess="R/W"/>
	<bitfield id="PRI4" width="5" begin="4" end="0" resetval="0x31" description="Port Priority Based Flow Control Threshold Set Value for Priority 4" range="4:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPPI_P0_TH_G_BUF_THRESH_CLR_L_REG" acronym="CPSW_NC_CPPI_P0_TH_G_BUF_THRESH_CLR_L_REG" offset="135576" width="32" description="CPPI Port 0 Tx PFC Global Buffer Threshold Clr Low">
		<bitfield id="PRI3" width="5" begin="28" end="24" resetval="0x0" description="Port Priority Based Flow Control Threshold Clear Value for Priority 3" range="28:24" rwaccess="R/W"/>
	<bitfield id="PRI2" width="5" begin="20" end="16" resetval="0x0" description="Port Priority Based Flow Control Threshold Clear Value for Priority 2" range="20:16" rwaccess="R/W"/>
	<bitfield id="PRI1" width="5" begin="12" end="8" resetval="0x0" description="Port Priority Based Flow Control Threshold Clear Value for Priority 1" range="12:8" rwaccess="R/W"/>
	<bitfield id="PRI0" width="5" begin="4" end="0" resetval="0x0" description="Port Priority Based Flow Control Threshold Clear Value for Priority 0" range="4:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPPI_P0_TH_G_BUF_THRESH_CLR_H_REG" acronym="CPSW_NC_CPPI_P0_TH_G_BUF_THRESH_CLR_H_REG" offset="135580" width="32" description="CPPI Port 0 Tx PFC Global Buffer Threshold Clr High">
		<bitfield id="PRI7" width="5" begin="28" end="24" resetval="0x0" description="Port Priority Based Flow Control Threshold Clear Value for Priority 7" range="28:24" rwaccess="R/W"/>
	<bitfield id="PRI6" width="5" begin="20" end="16" resetval="0x0" description="Port Priority Based Flow Control Threshold Clear Value for Priority 6" range="20:16" rwaccess="R/W"/>
	<bitfield id="PRI5" width="5" begin="12" end="8" resetval="0x0" description="Port Priority Based Flow Control Threshold Clear Value for Priority 5" range="12:8" rwaccess="R/W"/>
	<bitfield id="PRI4" width="5" begin="4" end="0" resetval="0x0" description="Port Priority Based Flow Control Threshold Clear Value for Priority 4" range="4:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPPI_P0_SRC_ID_A_REG" acronym="CPSW_NC_CPPI_P0_SRC_ID_A_REG" offset="135936" width="32" description="CPPI Port 0 CPPI Source ID A">
		<bitfield id="PORT4" width="8" begin="31" end="24" resetval="0x4" description="Port 4 CPPI Info Word0 Source ID Value" range="31:24" rwaccess="R/W"/>
	<bitfield id="PORT3" width="8" begin="23" end="16" resetval="0x3" description="Port 3 CPPI Info Word0 Source ID Value" range="23:16" rwaccess="R/W"/>
	<bitfield id="PORT2" width="8" begin="15" end="8" resetval="0x2" description="Port 2 CPPI Info Word0 Source ID Value" range="15:8" rwaccess="R/W"/>
	<bitfield id="PORT1" width="8" begin="7" end="0" resetval="0x1" description="Port 1 CPPI Info Word0 Source ID Value" range="7:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPPI_P0_SRC_ID_B_REG" acronym="CPSW_NC_CPPI_P0_SRC_ID_B_REG" offset="135940" width="32" description="CPPI Port 0 CPPI Source ID B">
		<bitfield id="PORT8" width="8" begin="31" end="24" resetval="0x8" description="Port 8 CPPI Info Word0 Source ID Value" range="31:24" rwaccess="R/W"/>
	<bitfield id="PORT7" width="8" begin="23" end="16" resetval="0x7" description="Port 7 CPPI Info Word0 Source ID Value" range="23:16" rwaccess="R/W"/>
	<bitfield id="PORT6" width="8" begin="15" end="8" resetval="0x6" description="Port 6 CPPI Info Word0 Source ID Value" range="15:8" rwaccess="R/W"/>
	<bitfield id="PORT5" width="8" begin="7" end="0" resetval="0x5" description="Port 5 CPPI Info Word0 Source ID Value" range="7:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPPI_P0_HOST_BLKS_PRI_REG" acronym="CPSW_NC_CPPI_P0_HOST_BLKS_PRI_REG" offset="135968" width="32" description="CPPI Port 0 Host Blocks Priority">
		<bitfield id="PRI7" width="4" begin="31" end="28" resetval="0x0" description="Priority 7 Host Blocks" range="31:28" rwaccess="R/W"/>
	<bitfield id="PRI6" width="4" begin="27" end="24" resetval="0x0" description="Priority 6 Host Blocks" range="27:24" rwaccess="R/W"/>
	<bitfield id="PRI5" width="4" begin="23" end="20" resetval="0x0" description="Priority 5 Host Blocks" range="23:20" rwaccess="R/W"/>
	<bitfield id="PRI4" width="4" begin="19" end="16" resetval="0x0" description="Priority 4 Host Blocks" range="19:16" rwaccess="R/W"/>
	<bitfield id="PRI3" width="4" begin="15" end="12" resetval="0x0" description="Priority 3 Host Blocks" range="15:12" rwaccess="R/W"/>
	<bitfield id="PRI2" width="4" begin="11" end="8" resetval="0x0" description="Priority 2 Host Blocks" range="11:8" rwaccess="R/W"/>
	<bitfield id="PRI1" width="4" begin="7" end="4" resetval="0x0" description="Priority 1 Host Blocks" range="7:4" rwaccess="R/W"/>
	<bitfield id="PRI0" width="4" begin="3" end="0" resetval="0x0" description="Priority 0 Host Blocks" range="3:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_ETH_MAC_PN_CONTROL_REG_j" acronym="CPSW_NC_ETH_MAC_PN_CONTROL_REG_j" offset="139268" width="32" description="Enet Port N Control">
		<bitfield id="EST_PORT_EN" width="1" begin="17" end="17" resetval="0x0" description="EST Port Enable       0 - EST is disabled on the port.         1 - EST is enabled on the port (Does not take effect until the CPSW level est_en is set)." range="17" rwaccess="R/W"/>
	<bitfield id="RX_ECC_ERR_EN" width="1" begin="15" end="15" resetval="0x0" description="This bit must be set to enable receive ECC error operations on the port." range="15" rwaccess="R/W"/>
	<bitfield id="TX_ECC_ERR_EN" width="1" begin="14" end="14" resetval="0x0" description="This bit must be set to enable transmit ECC error operations on the port." range="14" rwaccess="R/W"/>
	<bitfield id="TX_LPI_CLKSTOP_EN" width="1" begin="12" end="12" resetval="0x0" description="Transmit LPI Clock Stop Enable - When set this bit causes the transmit output clock (GMII_GMTCLK_O) to be stopped when the transmit LPI state is entered if EEE is enabled." range="12" rwaccess="R/W"/>
	<bitfield id="DSCP_IPV6_EN" width="1" begin="2" end="2" resetval="0x0" description="IPv6 DSCP enable       0 - Ipv6 DSCP priority mapping is disabled.       1 - Ipv6 DSCP priority mapping is enabled." range="2" rwaccess="R/W"/>
	<bitfield id="DSCP_IPV4_EN" width="1" begin="1" end="1" resetval="0x0" description="IPv4 DSCP enable       0 - Ipv4 DSCP priority mapping is disabled.       1 - Ipv4 DSCP priority mapping is enabled." range="1" rwaccess="R/W"/>
	</register><register id="CPSW_NC_ETH_MAC_PN_MAX_BLKS_REG_j" acronym="CPSW_NC_ETH_MAC_PN_MAX_BLKS_REG_j" offset="139272" width="32" description="Enet Port N FIFO Max Blocks">
		<bitfield id="TX_MAX_BLKS" width="8" begin="15" end="8" resetval="0x16" description="Transmit Max Blocks - The maximum number of blocks allowed on all transmit FIFO priorities combined.  If (fifo_oneram = 1) then blocks should be moved from transmit to receive when flow control is enabled to allow for flow control runout.  " range="15:8" rwaccess="R/W"/>
	<bitfield id="RX_MAX_BLKS" width="8" begin="7" end="0" resetval="0x4" description="Receive  Max Blocks - The maximum number of blocks allowed on the express and prempt receive FIFOs (transmit and receive FIFOs combined when fifo_oneram = 1)" range="7:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_ETH_MAC_PN_BLK_CNT_REG_j" acronym="CPSW_NC_ETH_MAC_PN_BLK_CNT_REG_j" offset="139280" width="32" description="Enet Port N FIFO Block Usage Count">
		<bitfield id="RX_BLK_CNT_P" width="6" begin="21" end="16" resetval="0x0" description="Receive Express Block Count Usage - This value is the number of blocks allocated to the port FIFO prempt receive queue.  No blocks are allocated until the iet_en in the CPSW_Control register is set." range="21:16" rwaccess="R"/>
	<bitfield id="TX_BLK_CNT" width="5" begin="12" end="8" resetval="0x0" description="Transmit Block Count Usage - This value is the number of blocks allocated to the port FIFO logical transmit queues." range="12:8" rwaccess="R"/>
	<bitfield id="RX_BLK_CNT_E" width="6" begin="5" end="0" resetval="0x1" description="Receive Express Block Count Usage - This value is the number of blocks allocated to the ports FIFO express receive queue." range="5:0" rwaccess="R"/>
	</register><register id="CPSW_NC_ETH_MAC_PN_PORT_VLAN_REG_j" acronym="CPSW_NC_ETH_MAC_PN_PORT_VLAN_REG_j" offset="139284" width="32" description="Enet Port N VLAN">
		<bitfield id="PORT_PRI" width="3" begin="15" end="13" resetval="0x0" description="Port VLAN Priority" range="15:13" rwaccess="R/W"/>
	<bitfield id="PORT_CFI" width="1" begin="12" end="12" resetval="0x0" description="Port CFI bit" range="12" rwaccess="R/W"/>
	<bitfield id="PORT_VID" width="12" begin="11" end="0" resetval="0x0" description="Port VLAN ID" range="11:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_ETH_MAC_PN_TX_PRI_MAP_REG_j" acronym="CPSW_NC_ETH_MAC_PN_TX_PRI_MAP_REG_j" offset="139288" width="32" description="Enet Port N Tx Header Pri to Switch Pri Mapping">
		<bitfield id="PRI7" width="3" begin="30" end="28" resetval="0x7" description="Priority 7 - A packet header priority of 0x7 is given this switch queue priority." range="30:28" rwaccess="R/W"/>
	<bitfield id="PRI6" width="3" begin="26" end="24" resetval="0x6" description="Priority 6 - A packet header priority of 0x6 is given this switch queue priority." range="26:24" rwaccess="R/W"/>
	<bitfield id="PRI5" width="3" begin="22" end="20" resetval="0x5" description="Priority 5 - A packet header priority of 0x5 is given this switch queue priority." range="22:20" rwaccess="R/W"/>
	<bitfield id="PRI4" width="3" begin="18" end="16" resetval="0x4" description="Priority 4 - A packet header priority of 0x4 is given this switch queue priority." range="18:16" rwaccess="R/W"/>
	<bitfield id="PRI3" width="3" begin="14" end="12" resetval="0x3" description="Priority 3 - A packet header priority of 0x3 is given this switch queue priority." range="14:12" rwaccess="R/W"/>
	<bitfield id="PRI2" width="3" begin="10" end="8" resetval="0x2" description="Priority 2 - A packet header priority of 0x2 is given this switch queue priority." range="10:8" rwaccess="R/W"/>
	<bitfield id="PRI1" width="3" begin="6" end="4" resetval="0x1" description="Priority 1 - A packet header priority of 0x1 is given this switch queue priority." range="6:4" rwaccess="R/W"/>
	<bitfield id="PRI0" width="3" begin="2" end="0" resetval="0x0" description="Priority 0 - A packet header priority of 0x0 is given this switch queue priority." range="2:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_ETH_MAC_PN_PRI_CTL_REG_j" acronym="CPSW_NC_ETH_MAC_PN_PRI_CTL_REG_j" offset="139292" width="32" description="Enet Port N Priority Control">
		<bitfield id="TX_FLOW_PRI" width="8" begin="31" end="24" resetval="0x0" description="Transmit Priority Based Flow Control Enable (per priority)" range="31:24" rwaccess="R/W"/>
	<bitfield id="RX_FLOW_PRI" width="8" begin="23" end="16" resetval="0x0" description="Receive Priority Based Flow Control Enable (per priority)" range="23:16" rwaccess="R/W"/>
	<bitfield id="TX_HOST_BLKS_REM" width="4" begin="15" end="12" resetval="0x9" description="Transmit FIFO Blocks that must be free before a non rate-limited CPPI Port 0 receive thread can begin sending a packet" range="15:12" rwaccess="R/W"/>
	</register><register id="CPSW_NC_ETH_MAC_PN_RX_PRI_MAP_REG_j" acronym="CPSW_NC_ETH_MAC_PN_RX_PRI_MAP_REG_j" offset="139296" width="32" description="Enet Port N RX Pkt Pri to Header Pri Map">
		<bitfield id="PRI7" width="3" begin="30" end="28" resetval="0x7" description="Priority 7 - A packet priority of 7 is mapped (changed) to this header packet priority." range="30:28" rwaccess="R/W"/>
	<bitfield id="PRI6" width="3" begin="26" end="24" resetval="0x6" description="Priority 6 - A packet priority of 6 is mapped (changed) to this header packet priority." range="26:24" rwaccess="R/W"/>
	<bitfield id="PRI5" width="3" begin="22" end="20" resetval="0x5" description="Priority 5 - A packet priority of 5 is mapped (changed) to this header packet priority." range="22:20" rwaccess="R/W"/>
	<bitfield id="PRI4" width="3" begin="18" end="16" resetval="0x4" description="Priority 4 - A packet priority of 4 is mapped (changed) to this header packet priority." range="18:16" rwaccess="R/W"/>
	<bitfield id="PRI3" width="3" begin="14" end="12" resetval="0x3" description="Priority 3 - A packet priority of 3 is mapped (changed) to this header packet priority." range="14:12" rwaccess="R/W"/>
	<bitfield id="PRI2" width="3" begin="10" end="8" resetval="0x2" description="Priority 2 - A packet priority of 2 is mapped (changed) to this header packet priority." range="10:8" rwaccess="R/W"/>
	<bitfield id="PRI1" width="3" begin="6" end="4" resetval="0x1" description="Priority 1 - A packet priority of 1 is mapped (changed) to this header packet priority." range="6:4" rwaccess="R/W"/>
	<bitfield id="PRI0" width="3" begin="2" end="0" resetval="0x0" description="Priority 0 - A packet priority of 0 is mapped (changed) to this header packet priority." range="2:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_ETH_MAC_PN_RX_MAXLEN_REG_j" acronym="CPSW_NC_ETH_MAC_PN_RX_MAXLEN_REG_j" offset="139300" width="32" description="Enet Port N Receive Frame Max Length">
		<bitfield id="RX_MAXLEN" width="14" begin="13" end="0" resetval="0x1518" description="RX Maximum Frame Length - This field determines the maximum length of a received frame.  The reset value is 1518 (dec).  Frames with byte counts greater than pn_rx_maxlen are long frames.  Long frames with no errors are oversized frames.  Long frames with CRC, code, or alignment error are jabber frames.  The maximum value is 2024 (including VLAN)." range="13:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_ETH_MAC_PN_TX_BLKS_PRI_REG_j" acronym="CPSW_NC_ETH_MAC_PN_TX_BLKS_PRI_REG_j" offset="139304" width="32" description="Enet Port N Transmit Block Sub Per Priority">
		<bitfield id="PRI7" width="4" begin="31" end="28" resetval="0x0" description="Transmit Blocks Per Priority 7 (subtract value)" range="31:28" rwaccess="R/W"/>
	<bitfield id="PRI6" width="4" begin="27" end="24" resetval="0x1" description="Transmit Blocks Per Priority 6 (subtract value)" range="27:24" rwaccess="R/W"/>
	<bitfield id="PRI5" width="4" begin="23" end="20" resetval="0x2" description="Transmit Blocks Per Priority 5 (subtract value)" range="23:20" rwaccess="R/W"/>
	<bitfield id="PRI4" width="4" begin="19" end="16" resetval="0x4" description="Transmit Blocks Per Priority 4 (subtract value)" range="19:16" rwaccess="R/W"/>
	<bitfield id="PRI3" width="4" begin="15" end="12" resetval="0x5" description="Transmit Blocks Per Priority 3 (subtract value)" range="15:12" rwaccess="R/W"/>
	<bitfield id="PRI2" width="4" begin="11" end="8" resetval="0x6" description="Transmit Blocks Per Priority 2 (subtract value)" range="11:8" rwaccess="R/W"/>
	<bitfield id="PRI1" width="4" begin="7" end="4" resetval="0x7" description="Transmit Blocks Per Priority 1 (subtract value)" range="7:4" rwaccess="R/W"/>
	<bitfield id="PRI0" width="4" begin="3" end="0" resetval="0x8" description="Transmit Blocks Per Priority 0 (subtract value)" range="3:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_ETH_MAC_PN_IDLE2LPI_REG_j" acronym="CPSW_NC_ETH_MAC_PN_IDLE2LPI_REG_j" offset="139312" width="32" description="Enet Port N EEE Idle to LPI counter">
		<bitfield id="COUNT" width="24" begin="23" end="0" resetval="0x0" description="EEE Idle to LPI counter load value - After CLKSTOP_REQ is asserted, this value is loaded into the port idle to LPI counter on each clock that the port transmit is not idle.  The port enters the transmit LPI state when this counter decrements to zero.  This counter decrements each time the EEE prescale counter decrements to zero." range="23:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_ETH_MAC_PN_LPI2WAKE_REG_j" acronym="CPSW_NC_ETH_MAC_PN_LPI2WAKE_REG_j" offset="139316" width="32" description="Enet Port N EEE LPI to wake counter">
		<bitfield id="COUNT" width="24" begin="23" end="0" resetval="0x0" description="EEE LPI to wake counter load value - When the port is in the transmit LPI state and the CLKSTOP_REQ signal is deasserted, this value is loaded into the LPI to wake counter.  Transmit packet operations may begin (resume) when the LPI to wake count decrements to zero (on the pre-scale count).  This is the time that the transmit must wait before transmit packet operations resume after wakeup." range="23:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_ETH_MAC_PN_EEE_STATUS_REG_j" acronym="CPSW_NC_ETH_MAC_PN_EEE_STATUS_REG_j" offset="139320" width="32" description="Enet Port N EEE status">
		<bitfield id="TX_FIFO_EMPTY" width="1" begin="6" end="6" resetval="0x1" description="Transmit FIFO (switch egress)  is empty - contains no packets" range="6" rwaccess="R"/>
	<bitfield id="RX_FIFO_EMPTY" width="1" begin="5" end="5" resetval="0x1" description="Receive  FIFO (switch ingress) is empty - contains no packets" range="5" rwaccess="R"/>
