ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263X/CPSW_CPSW_52800000h.xml
	<bitfield id="TX_FIFO_HOLD" width="1" begin="4" end="4" resetval="0x0" description="Transmit FIFO hold  - asserted in the LPI state and during the LPI2WAKE count time" range="4" rwaccess="R"/>
	<bitfield id="TX_WAKE" width="1" begin="3" end="3" resetval="0x0" description="Transmit wakeup     - asserted in the transmit LPI2WAKE count time" range="3" rwaccess="R"/>
	<bitfield id="TX_LPI" width="1" begin="2" end="2" resetval="0x0" description="Transmit LPI state  - asserted when the port 0 transmit is in the LPI state" range="2" rwaccess="R"/>
	<bitfield id="RX_LPI" width="1" begin="1" end="1" resetval="0x1" description="Receive LPI state   - asserted when the port 0 receive is in the LPI state" range="1" rwaccess="R"/>
	<bitfield id="WAIT_IDLE2LPI" width="1" begin="0" end="0" resetval="0x0" description="CPPI port 0 wait idle to LPI - asserted when port 0 is counting the IDLE2LPI time" range="0" rwaccess="R"/>
	</register><register id="CPSW_NC_ETH_MAC_PN_FIFO_STATUS_REG_j" acronym="CPSW_NC_ETH_MAC_PN_FIFO_STATUS_REG_j" offset="139344" width="32" description="Enet Port N FIFO STATUS">
		<bitfield id="EST_BUFACT" width="1" begin="18" end="18" resetval="0x0" description="EST RAM active buffer - Indicates the active 64-word fetch buffer when pn_est_onebuf is cleared to zero.  Indicates the fetch ram address MSB when pn_est_onebuf set to one." range="18" rwaccess="R"/>
	<bitfield id="EST_ADD_ERR" width="1" begin="17" end="17" resetval="0x0" description="EST Address Error - Indicates that the fetch ram was read again after the previous maximum buffer address read (the previous fetch from the maximum address is reused)." range="17" rwaccess="R"/>
	<bitfield id="EST_CNT_ERR" width="1" begin="16" end="16" resetval="0x0" description="EST Fetch Count Error - Indicates that insufficient clocks were programmed into the fetch count and that another fetch was commanded before the previous fetch finished." range="16" rwaccess="R"/>
	<bitfield id="TX_E_MAC_ALLOW" width="8" begin="15" end="8" resetval="0x255" description="Transmit mac allow - Bus that indicates the actual priorities assigned to the express queue (and inversely the priorities assigned to the prempt queue).  The pn_mac_prempt[7:0] field in the Enet_Pn_IET_Control register indicates which priorities should be assigned to the express/prempt queues.  The switch between queues happens only when the priority is empty and the actual assignment is shown in this field." range="15:8" rwaccess="R"/>
	<bitfield id="TX_PRI_ACTIVE" width="8" begin="7" end="0" resetval="0x0" description="Transmit Priority Active - Bus that indicates which priorities have packets (non-empty) at the time of the register read." range="7:0" rwaccess="R"/>
	</register><register id="CPSW_NC_ETH_MAC_PN_EST_CONTROL_REG_j" acronym="CPSW_NC_ETH_MAC_PN_EST_CONTROL_REG_j" offset="139360" width="32" description="Enet Port N EST CONTROL">
		<bitfield id="EST_FILL_MARGIN" width="10" begin="25" end="16" resetval="0x0" description="EST Fill Margin - Sets the fill margin (in bytes) required to ensure that the Ethernet wire is clear so that the timed EST express packet can egress at the correct required time.  Setting this value too high will put an unnecessary gap on the wire.  Setting this value too low will cause the express packet to egress at a time later than intended (pushed out by non express traffic that did not have sufficient time to finish).  " range="25:16" rwaccess="R/W"/>
	<bitfield id="EST_PREMPT_COMP" width="7" begin="15" end="9" resetval="0x0" description="EST Prempt Comparison Value - When the count in a zero allow is less than or equal to this value in bytes (times 8), prempt packets are cleared from the wire. This is the prempt clear margin value." range="15:9" rwaccess="R/W"/>
	<bitfield id="EST_FILL_EN" width="1" begin="8" end="8" resetval="0x0" description="EST Fill Enable - Enable EST fill mode when set." range="8" rwaccess="R/W"/>
	<bitfield id="EST_TS_PRI" width="3" begin="7" end="5" resetval="0x0" description="EST Timestamp Express Priority - Selects the express priority that timestamp(s) will be generated on when pn_est_ts_onepri is set." range="7:5" rwaccess="R/W"/>
	<bitfield id="EST_TS_ONEPRI" width="1" begin="4" end="4" resetval="0x0" description="EST Timestamp One Express Priority - When set, timestamps are only enabled on packets on the express priority selected by pn_est_ts_pri.  When cleared to zero, express packet selection for timestamps is independent of priority." range="4" rwaccess="R/W"/>
	<bitfield id="EST_TS_FIRST" width="1" begin="3" end="3" resetval="0x0" description="EST Timestamp First Express Packet only - Generate a timestamp only on the first selected express packet in each EST time interval when express timestamps are enabled.  (If pn_est_ts_onepri is also set then the timestamp is generated only on the first packet on pn_est_ts_pri). " range="3" rwaccess="R/W"/>
	<bitfield id="EST_TS_EN" width="1" begin="2" end="2" resetval="0x0" description="EST Timestamp Enable - Enable express timestamps (when est_en and pn_est_port_en are set)." range="2" rwaccess="R/W"/>
	<bitfield id="EST_BUFSEL" width="1" begin="1" end="1" resetval="0x0" description="EST Buffer Select - If pn_est_onebuf is cleared, this bit selects the upper (when set) or the lower (when cleared) 64-word fetch buffer.  The actual fetch buffer used changes only at the start of the EST time interval and can be read in the Enet_Pn_FIFO_Status register pn_est_bufact bit." range="1" rwaccess="R/W"/>
	<bitfield id="EST_ONEBUF" width="1" begin="0" end="0" resetval="0x0" description="EST One Fetch Buffer - When set indicates that all 128 fetch words are used in one buffer.  When cleared, indicates that the 128 fetch words are split into two 64-word fetch buffers.  The pn_est_bufsel selects the buffer to be used when pn_est_onebuf is cleared to zero.  Two buffers allows software to change a buffer while the hardware is using the other buffer." range="0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_ETH_MAC_PN_FH_DSCP_MAP_REG_j_k" acronym="CPSW_NC_ETH_MAC_PN_FH_DSCP_MAP_REG_j_k" offset="139552" width="32" description="Enet Port N Receive IPV4/IPV6 DSCP Map N">
		<bitfield id="PRI7" width="3" begin="30" end="28" resetval="0x0" description="A DSCP IPV4/V6 packet TOS 7  is mapped to this received priority" range="30:28" rwaccess="R/W"/>
	<bitfield id="PRI6" width="3" begin="26" end="24" resetval="0x0" description="A DSCP IPV4/V6 packet TOS 6  is mapped to this received priority" range="26:24" rwaccess="R/W"/>
	<bitfield id="PRI5" width="3" begin="22" end="20" resetval="0x0" description="A DSCP IPV4/V6 packet TOS 5  is mapped to this received priority" range="22:20" rwaccess="R/W"/>
	<bitfield id="PRI4" width="3" begin="18" end="16" resetval="0x0" description="A DSCP IPV4/V6 packet TOS 4  is mapped to this received priority" range="18:16" rwaccess="R/W"/>
	<bitfield id="PRI3" width="3" begin="14" end="12" resetval="0x0" description="A DSCP IPV4/V6 packet TOS 3  is mapped to this received priority" range="14:12" rwaccess="R/W"/>
	<bitfield id="PRI2" width="3" begin="10" end="8" resetval="0x0" description="A DSCP IPV4/V6 packet TOS 2  is mapped to this received priority" range="10:8" rwaccess="R/W"/>
	<bitfield id="PRI1" width="3" begin="6" end="4" resetval="0x0" description="A DSCP IPV4/V6 packet TOS 1  is mapped to this received priority" range="6:4" rwaccess="R/W"/>
	<bitfield id="PRI0" width="3" begin="2" end="0" resetval="0x0" description="A DSCP IPV4/V6 packet TOS 0  is mapped to this received priority" range="2:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_ETH_MAC_PN_PRI_CIR_REG_j_k" acronym="CPSW_NC_ETH_MAC_PN_PRI_CIR_REG_j_k" offset="139584" width="32" description="Enet Port N Rx Priority P Committed Information Rate Value">
		<bitfield id="PRI_CIR" width="28" begin="27" end="0" resetval="0x0" description="Priority N committed information rate" range="27:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_ETH_MAC_PN_PRI_EIR_REG_j_k" acronym="CPSW_NC_ETH_MAC_PN_PRI_EIR_REG_j_k" offset="139616" width="32" description="Enet Port N Rx Priority P Excess Informatoin Rate Value">
		<bitfield id="PRI_EIR" width="28" begin="27" end="0" resetval="0x0" description="Priority N Excess Information Rate count" range="27:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_ETH_MAC_PN_TX_D_THRESH_SET_L_REG_j" acronym="CPSW_NC_ETH_MAC_PN_TX_D_THRESH_SET_L_REG_j" offset="139648" width="32" description="Enet Port N Tx PFC Destination Threshold Set Low">
		<bitfield id="PRI3" width="5" begin="28" end="24" resetval="0x31" description="Port Priority Based Flow Control Threshold Set Value for Priority 3" range="28:24" rwaccess="R/W"/>
	<bitfield id="PRI2" width="5" begin="20" end="16" resetval="0x31" description="Port Priority Based Flow Control Threshold Set Value for Priority 2" range="20:16" rwaccess="R/W"/>
	<bitfield id="PRI1" width="5" begin="12" end="8" resetval="0x31" description="Port Priority Based Flow Control Threshold Set Value for Priority 1" range="12:8" rwaccess="R/W"/>
	<bitfield id="PRI0" width="5" begin="4" end="0" resetval="0x31" description="Port Priority Based Flow Control Threshold Set Value for Priority 0" range="4:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_ETH_MAC_PN_TX_D_THRESH_SET_H_REG_j" acronym="CPSW_NC_ETH_MAC_PN_TX_D_THRESH_SET_H_REG_j" offset="139652" width="32" description="Enet Port N Tx PFC Destination Threshold Set High">
		<bitfield id="PRI7" width="5" begin="28" end="24" resetval="0x31" description="Port Priority Based Flow Control Threshold Set Value for Priority 7" range="28:24" rwaccess="R/W"/>
	<bitfield id="PRI6" width="5" begin="20" end="16" resetval="0x31" description="Port Priority Based Flow Control Threshold Set Value for Priority 6" range="20:16" rwaccess="R/W"/>
	<bitfield id="PRI5" width="5" begin="12" end="8" resetval="0x31" description="Port Priority Based Flow Control Threshold Set Value for Priority 5" range="12:8" rwaccess="R/W"/>
	<bitfield id="PRI4" width="5" begin="4" end="0" resetval="0x31" description="Port Priority Based Flow Control Threshold Set Value for Priority 4" range="4:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_ETH_MAC_PN_TX_D_THRESH_CLR_L_REG_j" acronym="CPSW_NC_ETH_MAC_PN_TX_D_THRESH_CLR_L_REG_j" offset="139656" width="32" description="Enet Port N Tx PFC Destination Threshold Clr Low">
		<bitfield id="PRI3" width="5" begin="28" end="24" resetval="0x0" description="Port Priority Based Flow Control Threshold Clear Value for Priority 3" range="28:24" rwaccess="R/W"/>
	<bitfield id="PRI2" width="5" begin="20" end="16" resetval="0x0" description="Port Priority Based Flow Control Threshold Clear Value for Priority 2" range="20:16" rwaccess="R/W"/>
	<bitfield id="PRI1" width="5" begin="12" end="8" resetval="0x0" description="Port Priority Based Flow Control Threshold Clear Value for Priority 1" range="12:8" rwaccess="R/W"/>
	<bitfield id="PRI0" width="5" begin="4" end="0" resetval="0x0" description="Port Priority Based Flow Control Threshold Clear Value for Priority 0" range="4:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_ETH_MAC_PN_TX_D_THRESH_CLR_H_REG_j" acronym="CPSW_NC_ETH_MAC_PN_TX_D_THRESH_CLR_H_REG_j" offset="139660" width="32" description="Enet Port N Tx PFC Destination Threshold Clr High">
		<bitfield id="PRI7" width="5" begin="28" end="24" resetval="0x0" description="Port Priority Based Flow Control Threshold Clear Value for Priority 7" range="28:24" rwaccess="R/W"/>
	<bitfield id="PRI6" width="5" begin="20" end="16" resetval="0x0" description="Port Priority Based Flow Control Threshold Clear Value for Priority 6" range="20:16" rwaccess="R/W"/>
	<bitfield id="PRI5" width="5" begin="12" end="8" resetval="0x0" description="Port Priority Based Flow Control Threshold Clear Value for Priority 5" range="12:8" rwaccess="R/W"/>
	<bitfield id="PRI4" width="5" begin="4" end="0" resetval="0x0" description="Port Priority Based Flow Control Threshold Clear Value for Priority 4" range="4:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_ETH_MAC_PN_TX_G_BUF_THRESH_SET_L_REG_j" acronym="CPSW_NC_ETH_MAC_PN_TX_G_BUF_THRESH_SET_L_REG_j" offset="139664" width="32" description="Enet Port N Tx PFC Global Buffer Threshold Set Low">
		<bitfield id="PRI3" width="5" begin="28" end="24" resetval="0x31" description="Port Priority Based Flow Control Threshold Set Value for Priority 3" range="28:24" rwaccess="R/W"/>
	<bitfield id="PRI2" width="5" begin="20" end="16" resetval="0x31" description="Port Priority Based Flow Control Threshold Set Value for Priority 2" range="20:16" rwaccess="R/W"/>
	<bitfield id="PRI1" width="5" begin="12" end="8" resetval="0x31" description="Port Priority Based Flow Control Threshold Set Value for Priority 1" range="12:8" rwaccess="R/W"/>
	<bitfield id="PRI0" width="5" begin="4" end="0" resetval="0x31" description="Port Priority Based Flow Control Threshold Set Value for Priority 0" range="4:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_ETH_MAC_PN_TX_G_BUF_THRESH_SET_H_REG_j" acronym="CPSW_NC_ETH_MAC_PN_TX_G_BUF_THRESH_SET_H_REG_j" offset="139668" width="32" description="Enet Port N Tx PFC Global Buffer Threshold Set High">
		<bitfield id="PRI7" width="5" begin="28" end="24" resetval="0x31" description="Port Priority Based Flow Control Threshold Set Value for Priority 7" range="28:24" rwaccess="R/W"/>
	<bitfield id="PRI6" width="5" begin="20" end="16" resetval="0x31" description="Port Priority Based Flow Control Threshold Set Value for Priority 6" range="20:16" rwaccess="R/W"/>
	<bitfield id="PRI5" width="5" begin="12" end="8" resetval="0x31" description="Port Priority Based Flow Control Threshold Set Value for Priority 5" range="12:8" rwaccess="R/W"/>
	<bitfield id="PRI4" width="5" begin="4" end="0" resetval="0x31" description="Port Priority Based Flow Control Threshold Set Value for Priority 4" range="4:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_ETH_MAC_PN_TX_G_BUF_THRESH_CLR_L_REG_j" acronym="CPSW_NC_ETH_MAC_PN_TX_G_BUF_THRESH_CLR_L_REG_j" offset="139672" width="32" description="Enet Port N Tx PFC Global Buffer Threshold Clr Low">
		<bitfield id="PRI3" width="5" begin="28" end="24" resetval="0x0" description="Port Priority Based Flow Control Threshold Clear Value for Priority 3" range="28:24" rwaccess="R/W"/>
	<bitfield id="PRI2" width="5" begin="20" end="16" resetval="0x0" description="Port Priority Based Flow Control Threshold Clear Value for Priority 2" range="20:16" rwaccess="R/W"/>
	<bitfield id="PRI1" width="5" begin="12" end="8" resetval="0x0" description="Port Priority Based Flow Control Threshold Clear Value for Priority 1" range="12:8" rwaccess="R/W"/>
	<bitfield id="PRI0" width="5" begin="4" end="0" resetval="0x0" description="Port Priority Based Flow Control Threshold Clear Value for Priority 0" range="4:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_ETH_MAC_PN_TX_G_BUF_THRESH_CLR_H_REG_j" acronym="CPSW_NC_ETH_MAC_PN_TX_G_BUF_THRESH_CLR_H_REG_j" offset="139676" width="32" description="Enet Port N Tx PFC Global Buffer Threshold Clr High">
		<bitfield id="PRI7" width="5" begin="28" end="24" resetval="0x0" description="Port Priority Based Flow Control Threshold Clear Value for Priority 7" range="28:24" rwaccess="R/W"/>
	<bitfield id="PRI6" width="5" begin="20" end="16" resetval="0x0" description="Port Priority Based Flow Control Threshold Clear Value for Priority 6" range="20:16" rwaccess="R/W"/>
	<bitfield id="PRI5" width="5" begin="12" end="8" resetval="0x0" description="Port Priority Based Flow Control Threshold Clear Value for Priority 5" range="12:8" rwaccess="R/W"/>
	<bitfield id="PRI4" width="5" begin="4" end="0" resetval="0x0" description="Port Priority Based Flow Control Threshold Clear Value for Priority 4" range="4:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_ETH_MAC_PN_TX_D_OFLOW_ADDVAL_L_REG_j" acronym="CPSW_NC_ETH_MAC_PN_TX_D_OFLOW_ADDVAL_L_REG_j" offset="140032" width="32" description="Enet Port N Tx Destination Out Flow Add Values Low">
		<bitfield id="PRI3" width="5" begin="28" end="24" resetval="0x0" description="Port PFC Destination Based Out Flow Add Value for Priority 3" range="28:24" rwaccess="R/W"/>
	<bitfield id="PRI2" width="5" begin="20" end="16" resetval="0x0" description="Port PFC Destination Based Out Flow Add Value for Priority 2" range="20:16" rwaccess="R/W"/>
	<bitfield id="PRI1" width="5" begin="12" end="8" resetval="0x0" description="Port PFC Destination Based Out Flow Add Value for Priority 1" range="12:8" rwaccess="R/W"/>
	<bitfield id="PRI0" width="5" begin="4" end="0" resetval="0x0" description="Port PFC Destination Based Out Flow Add Value for Priority 0" range="4:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_ETH_MAC_PN_TX_D_OFLOW_ADDVAL_H_REG_j" acronym="CPSW_NC_ETH_MAC_PN_TX_D_OFLOW_ADDVAL_H_REG_j" offset="140036" width="32" description="Enet Port N Tx Destination Out Flow Add Values High">
		<bitfield id="PRI7" width="5" begin="28" end="24" resetval="0x0" description="Port PFC Destination Based Out Flow Add Value for Priority 7" range="28:24" rwaccess="R/W"/>
	<bitfield id="PRI6" width="5" begin="20" end="16" resetval="0x0" description="Port PFC Destination Based Out Flow Add Value for Priority 6" range="20:16" rwaccess="R/W"/>
	<bitfield id="PRI5" width="5" begin="12" end="8" resetval="0x0" description="Port PFC Destination Based Out Flow Add Value for Priority 5" range="12:8" rwaccess="R/W"/>
	<bitfield id="PRI4" width="5" begin="4" end="0" resetval="0x0" description="Port PFC Destination Based Out Flow Add Value for Priority 4" range="4:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_ETH_MAC_PN_SA_L_REG_j" acronym="CPSW_NC_ETH_MAC_PN_SA_L_REG_j" offset="140040" width="32" description="Enet Port N Tx Pause Frame Source Address Low">
		<bitfield id="MACSRCADDR_7_0" width="8" begin="15" end="8" resetval="0x0" description="Source Address bits 7:0 " range="15:8" rwaccess="R/W"/>
	<bitfield id="MACSRCADDR_15_8" width="8" begin="7" end="0" resetval="0x0" description="Source Address bits 15:8" range="7:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_ETH_MAC_PN_SA_H_REG_j" acronym="CPSW_NC_ETH_MAC_PN_SA_H_REG_j" offset="140044" width="32" description="Enet Port N Tx Pause Frame Source Address High">
		<bitfield id="MACSRCADDR_23_16" width="8" begin="31" end="24" resetval="0x0" description="Source Address bits 23:16" range="31:24" rwaccess="R/W"/>
	<bitfield id="MACSRCADDR_31_24" width="8" begin="23" end="16" resetval="0x0" description="Source Address bits 31:24" range="23:16" rwaccess="R/W"/>
	<bitfield id="MACSRCADDR_39_32" width="8" begin="15" end="8" resetval="0x0" description="Source Address bits 39:32" range="15:8" rwaccess="R/W"/>
	<bitfield id="MACSRCADDR_47_40" width="8" begin="7" end="0" resetval="0x0" description="Source Address bits 47:40" range="7:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_ETH_MAC_PN_TS_CTL_REG_j" acronym="CPSW_NC_ETH_MAC_PN_TS_CTL_REG_j" offset="140048" width="32" description="Enet Port N Time Sync Control">
		<bitfield id="TS_MSG_TYPE_EN" width="16" begin="31" end="16" resetval="0x0" description="Time Sync Message Type Enable - Each bit in this field enables the corresponding message type in receive and transmit time sync messages (Bit 0 enables message type 0 etc.)" range="31:16" rwaccess="R/W"/>
	<bitfield id="TS_TX_HOST_TS_EN" width="1" begin="11" end="11" resetval="0x0" description="Time Sync Transmit Host Time Stamp Enable" range="11" rwaccess="R/W"/>
	<bitfield id="TS_TX_ANNEX_E_EN" width="1" begin="10" end="10" resetval="0x0" description="Time Synce Transmit Annex E Enable" range="10" rwaccess="R/W"/>
	<bitfield id="TS_RX_ANNEX_E_EN" width="1" begin="9" end="9" resetval="0x0" description="Time Synce Receive Annex E Enable" range="9" rwaccess="R/W"/>
	<bitfield id="TS_LTYPE2_EN" width="1" begin="8" end="8" resetval="0x0" description="Time Sync LTYPE 2 Enable (transmit and receive)" range="8" rwaccess="R/W"/>
	<bitfield id="TS_TX_ANNEX_D_EN" width="1" begin="7" end="7" resetval="0x0" description="Time Synce Transmit Annex D Enable" range="7" rwaccess="R/W"/>
	<bitfield id="TS_TX_VLAN_LTYPE2_EN" width="1" begin="6" end="6" resetval="0x0" description="Time Sync Transmit VLAN LTYPE 2 enable" range="6" rwaccess="R/W"/>
	<bitfield id="TS_TX_VLAN_LTYPE1_EN" width="1" begin="5" end="5" resetval="0x0" description="Time Sync Transmit VLAN LTYPE 1 enable" range="5" rwaccess="R/W"/>
	<bitfield id="TS_TX_ANNEX_F_EN" width="1" begin="4" end="4" resetval="0x0" description="Time Synce Transmit Annex F Enable" range="4" rwaccess="R/W"/>
	<bitfield id="TS_RX_ANNEX_D_EN" width="1" begin="3" end="3" resetval="0x0" description="Time Synce Receive Annex D Enable" range="3" rwaccess="R/W"/>
	<bitfield id="TS_RX_VLAN_LTYPE2_EN" width="1" begin="2" end="2" resetval="0x0" description="Time Sync Receive VLAN LTYPE 2 enable" range="2" rwaccess="R/W"/>
	<bitfield id="TS_RX_VLAN_LTYPE1_EN" width="1" begin="1" end="1" resetval="0x0" description="Time Sync Receive VLAN LTYPE 1 enable" range="1" rwaccess="R/W"/>
	<bitfield id="TS_RX_ANNEX_F_EN" width="1" begin="0" end="0" resetval="0x0" description="Time Synce Receive Annex F Enable" range="0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_ETH_MAC_PN_TS_SEQ_LTYPE_REG_j" acronym="CPSW_NC_ETH_MAC_PN_TS_SEQ_LTYPE_REG_j" offset="140052" width="32" description="Enet Port N Time Sync LTYPE (and SEQ_ID_OFFSET)">
		<bitfield id="TS_SEQ_ID_OFFSET" width="6" begin="21" end="16" resetval="0x30" description="Time Sync Sequence ID Offset - This is the number of octets that the sequence ID is offset in the tx and rx time sync message header.  The minimum value is 6." range="21:16" rwaccess="R/W"/>
	<bitfield id="TS_LTYPE1" width="16" begin="15" end="0" resetval="0x0" description="Time Sync LTYPE1 - This is the port time sync LTYPE1 value" range="15:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_ETH_MAC_PN_TS_VLAN_LTYPE_REG_j" acronym="CPSW_NC_ETH_MAC_PN_TS_VLAN_LTYPE_REG_j" offset="140056" width="32" description="Enet Port N Time Sync VLAN2 and VLAN2">
		<bitfield id="TS_VLAN_LTYPE2" width="16" begin="31" end="16" resetval="0x0" description="Time Sync VLAN LTYPE2" range="31:16" rwaccess="R/W"/>
	<bitfield id="TS_VLAN_LTYPE1" width="16" begin="15" end="0" resetval="0x0" description="Time Sync VLAN LTYPE1" range="15:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_ETH_MAC_PN_TS_CTL_LTYPE2_REG_j" acronym="CPSW_NC_ETH_MAC_PN_TS_CTL_LTYPE2_REG_j" offset="140060" width="32" description="Enet Port N Time Sync Control and LTYPE 2">
		<bitfield id="TS_UNI_EN" width="1" begin="24" end="24" resetval="0x0" description="Time Sync Unicast Enable" range="24" rwaccess="R/W"/>
	<bitfield id="TS_TTL_NONZERO" width="1" begin="23" end="23" resetval="0x0" description="Time Sync Time to Live Non-zero Enable" range="23" rwaccess="R/W"/>
	<bitfield id="TS_320" width="1" begin="22" end="22" resetval="0x0" description="Time Sync Destination Port Number 320 Enable" range="22" rwaccess="R/W"/>
	<bitfield id="TS_319" width="1" begin="21" end="21" resetval="0x0" description="Time Sync Destination Port Number 319 Enable" range="21" rwaccess="R/W"/>
	<bitfield id="TS_132" width="1" begin="20" end="20" resetval="0x0" description="Time Sync Destination IP Address 132 Enable" range="20" rwaccess="R/W"/>
	<bitfield id="TS_131" width="1" begin="19" end="19" resetval="0x0" description="Time Sync Destination IP Address 131 Enable" range="19" rwaccess="R/W"/>
	<bitfield id="TS_130" width="1" begin="18" end="18" resetval="0x0" description="Time Sync Destination IP Address 130 Enable" range="18" rwaccess="R/W"/>
	<bitfield id="TS_129" width="1" begin="17" end="17" resetval="0x0" description="Time Sync Destination IP Address 129 Enable" range="17" rwaccess="R/W"/>
	<bitfield id="TS_107" width="1" begin="16" end="16" resetval="0x0" description="Time Sync Destination IP Address 107 Enable" range="16" rwaccess="R/W"/>
