ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263X/CPSW_CPSW_52800000h.xml
	<bitfield id="TS_LTYPE2" width="16" begin="15" end="0" resetval="0x0" description="Time Sync LTYPE2 value" range="15:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_ETH_MAC_PN_TS_CTL2_REG_j" acronym="CPSW_NC_ETH_MAC_PN_TS_CTL2_REG_j" offset="140064" width="32" description="Enet Port N Time Sync Control 2">
		<bitfield id="TS_DOMAIN_OFFSET" width="6" begin="21" end="16" resetval="0x4" description="Time Sync Domain Offset" range="21:16" rwaccess="R/W"/>
	<bitfield id="TS_MCAST_TYPE_EN" width="16" begin="15" end="0" resetval="0x0" description="Time Sync Multicast Destination Address Type Enable" range="15:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_ETH_MAC_PN_MAC_CONTROL_REG_j" acronym="CPSW_NC_ETH_MAC_PN_MAC_CONTROL_REG_j" offset="140080" width="32" description="Enet Port N Mac Control">
		<bitfield id="RX_CMF_EN" width="1" begin="24" end="24" resetval="0x0" description="RX Copy MAC Control Frames Enable - Enables MAC control frames to be transferred to memory.  MAC control frames are normally acted upon (if enabled), but not copied/transferred to memory.  MAC control frames that are pause frames will be acted upon if enabled in the MacControl register, regardless of the value of pn_rx_cmf_en.  Frames transferred to memory due to pn_rx_cmf_en will have the mac_control bit set in their EOP buffer descriptor.       0 - MAC control frames are filtered (but are acted upon if enabled).     1 - MAC control frames are transferred to the host." range="24" rwaccess="R/W"/>
	<bitfield id="RX_CSF_EN" width="1" begin="23" end="23" resetval="0x0" description="RX Copy Short Frames Enable - Enables frames or fragments shorter than 64 bytes to be sent to the host.  Frames transferred to the host due to pn_rx_csf_en will have the fragment or undersized bit set in their buffer descriptor.  Short and fragment frame transfer is not guaranteed for all packet conditions and is best case only.  Frames shorter than 33 bytes will be dropped in all cases.  Fragments are short frames that contain CRC/align/code errors and undersized are short frames without errors.  The pn_rx_cef_en bit must also be set to transfer fragment frames.     0 - Short frames are filtered.     1 - Short frames are transferred to the host." range="23" rwaccess="R/W"/>
	<bitfield id="RX_CEF_EN" width="1" begin="22" end="22" resetval="0x0" description="RX Copy Error Frames Enable - Enables frames containing errors to be transferred to memory.  The appropriate error bit will be set in the frame receive buffer descriptor.   Frames containing errors will be filtered when this bit is not set.     0 - Frames containing errors are filtered.     1 - Frames containing errors are transferred to the host." range="22" rwaccess="R/W"/>
	<bitfield id="TX_SHORT_GAP_LIM_EN" width="1" begin="21" end="21" resetval="0x0" description="Transmit Short Gap Limit Enable - When set this bit limits the number of short gap packets transmitted to 100ppm.  The pn_tx_short_gap_en bit must also be set.  Each time a short gap packet is sent, a counter is loaded with 10,000 and decremented on each wireside clock.  Another short gap packet will not be sent out until the counter decrements to zero.  This mode is included to preclude the host from filling up the FIFO and sending every packet out with short gap which would violate the maximum number of packets per second allowed.  This bit is used only with GMII (not XGMII)." range="21" rwaccess="R/W"/>
	<bitfield id="EXT_TX_FLOW_EN" width="1" begin="20" end="20" resetval="0x0" description="External Transmit Flow Control Enable - Enables the pn_tx_flow_en to be selected from the EXT_TX_FLOW_EN input signal and not from the pn_tx_flow_en bit in this register." range="20" rwaccess="R/W"/>
	<bitfield id="EXT_RX_FLOW_EN" width="1" begin="19" end="19" resetval="0x0" description="External Receive Flow Control Enable - Enables the pn_rx_flow_en to be selected from the EXT_RX_FLOW_EN input signal and not from the pn_rx_flow_en bit in this register." range="19" rwaccess="R/W"/>
	<bitfield id="EXT_EN" width="1" begin="18" end="18" resetval="0x0" description="External Control Enable - Enables the fullduplex and gigabit mode to be selected from the FULLDUPLEX_IN and GIG_IN input signals and not from the pn_fullduplex and pn_gig bits in this register.  The FULLDUPLEX_MODE bit reflects the actual fullduplex mode selected." range="18" rwaccess="R/W"/>
	<bitfield id="GIG_FORCE" width="1" begin="17" end="17" resetval="0x0" description="Gigabit Mode Force - This bit is used to force the Enet Mac into gigabit mode if the input GMII_MTCLK has been stopped by the PHY.     0 - GIG mode not forced     1 - GIG mode forced regardless of transmit clock" range="17" rwaccess="R/W"/>
	<bitfield id="IFCTL_B" width="1" begin="16" end="16" resetval="0x0" description="Interface Control B - Intended as a general purpose output bit to be used to control external gaskets associated with the GMII (GMII to RGMII etc)." range="16" rwaccess="R/W"/>
	<bitfield id="IFCTL_A" width="1" begin="15" end="15" resetval="0x0" description="Interface Control A - Intended as a general purpose output bit to be used to control external gaskets associated with the GMII (GMII to RGMII etc)." range="15" rwaccess="R/W"/>
	<bitfield id="CRC_TYPE" width="1" begin="12" end="12" resetval="0x0" description="Port CRC Type -     0 - Ethernet CRC.     1 - Castagnoli CRC." range="12" rwaccess="R/W"/>
	<bitfield id="CMD_IDLE" width="1" begin="11" end="11" resetval="0x0" description="Command Idle -     0 - Idle not commanded.     1 - Idle Commanded (read pn_idle in Enet_Pn_Mac_Status)." range="11" rwaccess="R/W"/>
	<bitfield id="TX_SHORT_GAP_ENABLE" width="1" begin="10" end="10" resetval="0x0" description="Transmit Short Gap Enable     0 - Transmit with a short IPG is disabled.     1 - Transmit with a short IPG is enabled." range="10" rwaccess="R/W"/>
	<bitfield id="GIG" width="1" begin="7" end="7" resetval="0x0" description="Gigabit Mode -      0 - 10/100 mode.     1 - Gigabit mode (full duplex only)         The GIG_OUT output is the value of this bit.  This bit is a don't care when pn_xgig is set." range="7" rwaccess="R/W"/>
	<bitfield id="TX_PACE" width="1" begin="6" end="6" resetval="0x0" description="Transmit Pacing Enable -      0 - Transmit Pacing Disabled.     1 - Transmit Pacing Enabled" range="6" rwaccess="R/W"/>
	<bitfield id="GMII_EN" width="1" begin="5" end="5" resetval="0x0" description="GMII Enable -      0 - GMII RX and TX held in reset.     1 - GMII RX and TX released from reset.         This bit should be written with a logic high before the other bits in this register are written." range="5" rwaccess="R/W"/>
	<bitfield id="TX_FLOW_EN" width="1" begin="4" end="4" resetval="0x0" description="Transmit Flow Control Enable - Determines if incoming pause frames are acted upon in full-duplex mode.  Incoming pause frames are not acted upon in half-duplex mode regardless of this bit setting.  The RX_MBP_Enable bits determine whether or not received pause frames are transferred to memory.     0 - Transmit Flow Control Disabled.  Full-duplex mode - Incoming pause frames are not acted upon.      1 - Transmit Flow Control Enabled .  Full-duplex mode - Incoming pause frames are acted upon." range="4" rwaccess="R/W"/>
	<bitfield id="RX_FLOW_EN" width="1" begin="3" end="3" resetval="0x0" description="Receive Flow Control Enable -    0 - Receive Flow Control Disabled:         Half-duplex mode - No flow control generated collisions are sent.         Full-duplex mode - No outgoing pause frames are sent.   1 - Receive Flow Control Enabled:         Half-duplex mode -  Collisions are initiated when receive flow control is triggered.            Full-duplex mode -  Outgoing pause frames are sent when receive flow control is triggered." range="3" rwaccess="R/W"/>
	<bitfield id="MTEST" width="1" begin="2" end="2" resetval="0x0" description="Manufacturing Test mode - This bit must be set to allow writes to the Backoff_Test and PauseTimer registers." range="2" rwaccess="R/W"/>
	<bitfield id="LOOPBACK" width="1" begin="1" end="1" resetval="0x0" description="Loop Back Mode - Loopback mode forces internal fullduplex mode regardless of whether the pn_fullduplex bit is set or not.  The pn_loopback bit should be changed only when pn_gmii_en is de-asserted.  Loopback is used only with GMII (not XGMII).  Loopback is not compatible with timestamp operations (CPTS).     0 - Loop Back Mode disabled.     1 - Loop Back Mode enabled." range="1" rwaccess="R/W"/>
	<bitfield id="FULLDUPLEX" width="1" begin="0" end="0" resetval="0x0" description="Full Duplex mode - Gigabit mode forces fullduplex mode regardless of whether the pn_fullduplex bit is set or not.  The FULLDUPLEX_OUT output is the value of this register bit.     0 - half duplex mode.     1 - full duplex mode." range="0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_ETH_MAC_PN_MAC_STATUS_REG_j" acronym="CPSW_NC_ETH_MAC_PN_MAC_STATUS_REG_j" offset="140084" width="32" description="Enet Port N Mac Status">
		<bitfield id="IDLE" width="1" begin="31" end="31" resetval="0x1" description="Enet IDLE - The Ethernet port (express and prempt) is in the idle state when high." range="31" rwaccess="R"/>
	<bitfield id="E_IDLE" width="1" begin="30" end="30" resetval="0x1" description="Express MAC is idle when high" range="30" rwaccess="R"/>
	<bitfield id="MAC_TX_IDLE" width="1" begin="28" end="28" resetval="0x1" description="Mac Transmit Idle - Both Prempt (if iet_incl) and Express MAC Transmit are in idle state.The transmit clock must be running for this to go idle.  " range="28" rwaccess="R"/>
	<bitfield id="TORF" width="1" begin="27" end="27" resetval="0x0" description="Top of receive FIFO flow control trigger occurred.  This bit is write one to clear." range="27" rwaccess="R"/>
	<bitfield id="TORF_PRI" width="3" begin="26" end="24" resetval="0x0" description="The lowest priority that caused top of receive FIFO flow control trigger since the last write to clear.  This field is write 0x7 to clear." range="26:24" rwaccess="R"/>
	<bitfield id="TX_PFC_FLOW_ACT" width="8" begin="23" end="16" resetval="0x0" description="Receive Priority Based Flow Control Active (priority 7 down to 0)." range="23:16" rwaccess="R"/>
	<bitfield id="RX_PFC_FLOW_ACT" width="8" begin="15" end="8" resetval="0x0" description="Transmit Priority Based Flow Control Active (priority 7 down to 0)." range="15:8" rwaccess="R"/>
	<bitfield id="EXT_TX_FLOW_EN" width="1" begin="6" end="6" resetval="0x0" description="External Transmit Flow Control Enable - This is the value of the EXT_TX_FLOW_EN input bit." range="6" rwaccess="R"/>
	<bitfield id="EXT_RX_FLOW_EN" width="1" begin="5" end="5" resetval="0x0" description="External Receive Flow Control Enable - This is the value of the EXT_RX_FLOW_EN input bit." range="5" rwaccess="R"/>
	<bitfield id="EXT_GIG" width="1" begin="4" end="4" resetval="0x0" description="External GIG - This is the value of the EXT_GIG input bit." range="4" rwaccess="R"/>
	<bitfield id="EXT_FULLDUPLEX" width="1" begin="3" end="3" resetval="0x0" description="External Fullduplex - This is the value of the EXT_FULLDUPLEX input bit." range="3" rwaccess="R"/>
	<bitfield id="RX_FLOW_ACT" width="1" begin="1" end="1" resetval="0x0" description="Receive Flow Control Active - When asserted, indicates that receive flow control is enabled and triggered." range="1" rwaccess="R"/>
	<bitfield id="TX_FLOW_ACT" width="1" begin="0" end="0" resetval="0x0" description="Transmit Flow Control Active - When asserted, this bit indicates that the pause time period is being observed for a received pause frame.  No new transmissions will begin while this bit is asserted except for the transmission of pause frames.  Any transmission in progress when this bit is asserted will complete." range="0" rwaccess="R"/>
	</register><register id="CPSW_NC_ETH_MAC_PN_MAC_SOFT_RESET_REG_j" acronym="CPSW_NC_ETH_MAC_PN_MAC_SOFT_RESET_REG_j" offset="140088" width="32" description="Enet Port N Mac Soft Reset">
		<bitfield id="SOFT_RESET" width="1" begin="0" end="0" resetval="0x0" description="Software reset" range="0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_ETH_MAC_PN_MAC_BOFFTEST_REG_j" acronym="CPSW_NC_ETH_MAC_PN_MAC_BOFFTEST_REG_j" offset="140092" width="32" description="Enet Port N Mac Backoff Test">
		<bitfield id="PACEVAL" width="5" begin="30" end="26" resetval="0x0" description="Pacing Current Value -  A non-zero value in this field indicates that transmit pacing is active. A transmit frame collision or deferral causes paceval to loaded with decimal 31, good frame transmissions (with no collisions or deferrals) cause paceval to be decremented down to zero.  When paceval is nonzero, the transmitter delays 4 IPGs between new frame transmissions after each successfully transmitted frame that had no deferrals or collisions.  Transmit pacing helps reduce capture effects improving overall network bandwidth." range="30:26" rwaccess="R/W"/>
	<bitfield id="RNDNUM" width="10" begin="25" end="16" resetval="0x0" description="Backoff Random Number Generator - This field allows the Backoff Random Number Generator to be read (or written in test mode only). This field can be written only when pn_mtest has previously been set. Reading this field returns the generator's current value.  The value is reset to zero and begins counting on the clock after the de-assertion of reset." range="25:16" rwaccess="R/W"/>
	<bitfield id="COLL_COUNT" width="4" begin="15" end="12" resetval="0x0" description="Collision Count - The number of collisions the current frame has experienced." range="15:12" rwaccess="R"/>
	<bitfield id="TX_BACKOFF" width="10" begin="9" end="0" resetval="0x0" description="Backoff Count - This field allows the current value of the backoff counter to be observed for test purposes.  This field is loaded automatically according to the backoff algorithm, and is decremented by one for each slot time after the collision." range="9:0" rwaccess="R"/>
	</register><register id="CPSW_NC_ETH_MAC_PN_MAC_RX_PAUSETIMER_REG_j" acronym="CPSW_NC_ETH_MAC_PN_MAC_RX_PAUSETIMER_REG_j" offset="140096" width="32" description="Enet Port N 802.3 Receive Pause Timer">
		<bitfield id="RX_PAUSETIMER" width="16" begin="15" end="0" resetval="0x0" description="RX Pause Timer Value - This field allows the contents of the receive pause timer to be observed (and written in test mode).  The receive pause timer is loaded with 0xFF00 when the Enet port sends an outgoing pause frame (with pause time of 0xFFFF).  The receive pause timer is decremented at slot time intervals.  If the receive pause timer decrements to zero, then another outgoing pause frame will be sent and the load/decrement process will be repeated.  This register is for 802.3 Based flow control and is not used for 802.1Qbb Priority Based Flow Control (PFC)." range="15:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_ETH_MAC_PN_MAC_RXN_PAUSETIMER_REG_j_k" acronym="CPSW_NC_ETH_MAC_PN_MAC_RXN_PAUSETIMER_REG_j_k" offset="140112" width="32" description="Enet Port N PFC Priority 0 Rx Pause Timer">
		<bitfield id="RX0_PAUSETIMER" width="16" begin="15" end="0" resetval="0x0" description="Rx N Pause Timer Value - This field allows the contents of the receive pause timer to be observed (and written in test mode).  The receive pause timer is loaded with 0xFF00 when the Enet port sends an outgoing pause frame (with pause time of 0xFFFF).  The receive pause timer is decremented at slot time intervals.  If the receive pause timer decrements to zero, then another outgoing pause frame will be sent and the load/decrement process will be repeated.  This register is for 802.1qbb Priority Based flow control (PFC)" range="15:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_ETH_MAC_PN_MAC_TX_PAUSETIMER_REG_j" acronym="CPSW_NC_ETH_MAC_PN_MAC_TX_PAUSETIMER_REG_j" offset="140144" width="32" description="Enet Port N 802.3 Tx Pause Timer">
		<bitfield id="TX_PAUSETIMER" width="16" begin="15" end="0" resetval="0x0" description="802.3 Tx Pause Timer Value - This field allows the contents of the transmit pause timer to be observed (and written in test mode).   The transmit pause timer is loaded by a received (incoming) pause frame, and then decremented, at slottime intervals, down to zero at which time Ethernet Port transmit frames are again enabled.  This register is for 802.3 Based flow control and is not used for 802.1qbb Priority Based Flow Control (PFC)." range="15:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_ETH_MAC_PN_MAC_TX0_PAUSETIMER_REG_j_k" acronym="CPSW_NC_ETH_MAC_PN_MAC_TX0_PAUSETIMER_REG_j_k" offset="140160" width="32" description="Enet Port N PFC Priority 0 Tx Pause Timer">
		<bitfield id="TX0_PAUSETIMER" width="16" begin="15" end="0" resetval="0x0" description="PFC Tx N Pause Timer Value - This field allows the contents of the transmit pause timer to be observed (and written in test mode).   The transmit pause timer is loaded by a received (incoming) pause frame, and then decremented, at slottime intervals, down to zero at which time Ethernet Port transmit frames are again enabled.  This register is for 802.1qbb Priority Based flow control (PFC)" range="15:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_ETH_MAC_PN_MAC_EMCONTROL_REG_j" acronym="CPSW_NC_ETH_MAC_PN_MAC_EMCONTROL_REG_j" offset="140192" width="32" description="Enet Port N Emulation Control">
		<bitfield id="SOFT" width="1" begin="1" end="1" resetval="0x0" description="Emulation Soft Bit" range="1" rwaccess="R/W"/>
	<bitfield id="FREE" width="1" begin="0" end="0" resetval="0x0" description="Emulation Free Bit" range="0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_ETH_MAC_PN_MAC_TX_GAP_REG_j" acronym="CPSW_NC_ETH_MAC_PN_MAC_TX_GAP_REG_j" offset="140196" width="32" description="Enet Port N Tx Inter Packet Gap">
		<bitfield id="TX_GAP" width="16" begin="15" end="0" resetval="0x12" description="Transmit Inter-Packet Gap -    GMII modes - This is the default gap value and only bits 8:0 are used.  This can be increased from 12 to increase the gap between packets.   XGMII mode - In 10 gigabit mode this is the short gap rate and should be changed to 5000 (0x1388) to get approximately 200ppm faster when short gap is triggered and enabled." range="15:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_ETH_MAC_PN_MAC_PORT_CONFIG_j" acronym="CPSW_NC_ETH_MAC_PN_MAC_PORT_CONFIG_j" offset="140200" width="32" description="Enet Port N Port Configuration">
		<bitfield id="IET" width="1" begin="9" end="9" resetval="0x0" description="IET support" range="9" rwaccess="R"/>
	<bitfield id="XGMII" width="1" begin="8" end="8" resetval="0x0" description="No XGMII support on this port" range="8" rwaccess="R"/>
	<bitfield id="INTERVLAN_ROUTES" width="8" begin="7" end="0" resetval="0x2" description="The number of InterVLAN routes supported on this port (egress)" range="7:0" rwaccess="R"/>
	</register><register id="CPSW_NC_ETH_MAC_PN_INTERVLAN_OPX_POINTER_REG_j" acronym="CPSW_NC_ETH_MAC_PN_INTERVLAN_OPX_POINTER_REG_j" offset="140204" width="32" description="Enet Port N Tx Egress InterVLAN Operation Pointer">
		<bitfield id="POINTER" width="2" begin="1" end="0" resetval="0x0" description="InterVLAN location pointer - This field points to the InterVLAN location that will be read/written by accesses to Enet_Pn_InterVLANx_A/B/C (the InterVLAN locations are accessed by a maibox).  Valid pointer locations are 1 to x (where x is the number of locations - pointer location zero is unused).  For example, if configured with 2 intervlan routes then only the values of 1 and 2 are valid." range="1:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_ETH_MAC_PN_INTERVLAN_OPX_A_REG_j" acronym="CPSW_NC_ETH_MAC_PN_INTERVLAN_OPX_A_REG_j" offset="140208" width="32" description="Enet Port N Tx Egress InterVLAN A">
		<bitfield id="DA_23_16" width="8" begin="31" end="24" resetval="0x0" description="Destination Address bits 23:16" range="31:24" rwaccess="R/W"/>
	<bitfield id="DA_31_24" width="8" begin="23" end="16" resetval="0x0" description="Destination Address bits 31:24" range="23:16" rwaccess="R/W"/>
	<bitfield id="DA_39_32" width="8" begin="15" end="8" resetval="0x0" description="Destination Address bits 39:32" range="15:8" rwaccess="R/W"/>
	<bitfield id="DA_47_40" width="8" begin="7" end="0" resetval="0x0" description="Destination Address bits 47:40" range="7:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_ETH_MAC_PN_INTERVLAN_OPX_B_REG_j" acronym="CPSW_NC_ETH_MAC_PN_INTERVLAN_OPX_B_REG_j" offset="140212" width="32" description="Enet Port N Tx Egress InterVLAN B">
		<bitfield id="SA_39_32" width="8" begin="31" end="24" resetval="0x0" description="Source Address bits 39:32" range="31:24" rwaccess="R/W"/>
	<bitfield id="SA_47_40" width="8" begin="23" end="16" resetval="0x0" description="Source Address bits 47:40" range="23:16" rwaccess="R/W"/>
	<bitfield id="DA_7_0" width="8" begin="15" end="8" resetval="0x0" description="Destination Address bits 7:0" range="15:8" rwaccess="R/W"/>
	<bitfield id="DA_15_8" width="8" begin="7" end="0" resetval="0x0" description="Destination Address bits 15:8" range="7:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_ETH_MAC_PN_INTERVLAN_OPX_C_REG_j" acronym="CPSW_NC_ETH_MAC_PN_INTERVLAN_OPX_C_REG_j" offset="140216" width="32" description="Enet Port N Tx Egress InterVLAN C">
		<bitfield id="SA_7_0" width="8" begin="31" end="24" resetval="0x0" description="Source Address bits 7:0" range="31:24" rwaccess="R/W"/>
	<bitfield id="SA_15_8" width="8" begin="23" end="16" resetval="0x0" description="Source Address bits 15:8" range="23:16" rwaccess="R/W"/>
	<bitfield id="SA_23_16" width="8" begin="15" end="8" resetval="0x0" description="Source Address bits 23:16" range="15:8" rwaccess="R/W"/>
	<bitfield id="SA_31_24" width="8" begin="7" end="0" resetval="0x0" description="Source Address bits 31:24" range="7:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_ETH_MAC_PN_INTERVLAN_OPX_D_REG_j" acronym="CPSW_NC_ETH_MAC_PN_INTERVLAN_OPX_D_REG_j" offset="140220" width="32" description="Enet Port N Tx Egress InterVLAN D">
		<bitfield id="DECREMENT_TTL" width="1" begin="15" end="15" resetval="0x0" description="Decrement Time To Live - When set, the Time To Live (TTL) field in the header is decremented.     IPV4 - Decrement the TTL byte and update the Header Checksum.     IPV6 - Decrement the Hop Limit.            note: When this bit is set, the ALE should be configured to send any IPv4/6 packet with a zero or one TTL field to the host with the ALE egress operation ttl_check bit.When this bit is cleared the TTL/Hop Limit fields are not checked or modified." range="15" rwaccess="R/W"/>
	<bitfield id="DEST_FORCE_UNTAGGED_EGRESS" width="1" begin="14" end="14" resetval="0x0" description="Destination VLAN Force Untagged Egress - When set, this bit indicates that the VLAN should be removed on egress for the routed packet.  The replace_vid bit should be set for this bit to be used, otherwise force untagged egress comes from the address lookup engine." range="14" rwaccess="R/W"/>
	<bitfield id="REPLACE_DA_SA" width="1" begin="13" end="13" resetval="0x0" description="Replace Destination Address and Source Address - When set this bit indicates that the routed packet destination address should be replaced by da[47:0] and the source address should be replaced by sa[47:0]." range="13" rwaccess="R/W"/>
	<bitfield id="REPLACE_VID" width="1" begin="12" end="12" resetval="0x0" description="Replace VLAN ID - When set this bit indicates that the VLAN ID should be replaced for the routed packet." range="12" rwaccess="R/W"/>
	<bitfield id="VID" width="12" begin="11" end="0" resetval="0x0" description="VLAN ID" range="11:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_EST_FETCH_LOC" acronym="CPSW_NC_EST_FETCH_LOC" offset="204800" width="32" description="The Revision Register contains the ID and revision information.">
