ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263X/CPSW_CPSW_52800000h.xml
		<bitfield id="LOC" width="22" begin="21" end="0" resetval="0x0" description="RAM Location" range="21:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPDMA_REGS_FH_IDVER_REG" acronym="CPSW_NC_CPDMA_REGS_FH_IDVER_REG" offset="212992" width="32" description="CPDMA FHost IDVER">
		<bitfield id="FH_IDVER" width="32" begin="31" end="0" resetval="0x1573130" description="CPDMA FHost IDVER" range="31:0" rwaccess="R"/>
	</register><register id="CPSW_NC_CPDMA_REGS_FH_CONTROL_REG" acronym="CPSW_NC_CPDMA_REGS_FH_CONTROL_REG" offset="212996" width="32" description="CPDMA FHost Control Register">
		<bitfield id="FH_EN" width="1" begin="0" end="0" resetval="0x0" description="FHost Enable    0 - Disabled    1 - Enabled" range="0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPDMA_REGS_FH_TEARDOWN_REG" acronym="CPSW_NC_CPDMA_REGS_FH_TEARDOWN_REG" offset="213000" width="32" description="CPDMA FHost Teardown Register">
		<bitfield id="FH_TDN_CH" width="3" begin="2" end="0" resetval="0x0" description="CPDMA FHost Teardown Channel - FHost channel teardown is commanded by writing the encoded value of the channel to be torn down.  The teardown register is read as zero.   000 - teardown channel 0   ...   111 - teardown channel 7" range="2:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPDMA_REGS_FH_CONTROL2_REG" acronym="CPSW_NC_CPDMA_REGS_FH_CONTROL2_REG" offset="213004" width="32" description="CPDMA FHost Control Two Register">
		<bitfield id="FH_EOQ_INT" width="8" begin="7" end="0" resetval="0x0" description="FHost Interrupt on EOQ only - When set, a corresponding channel issues an FH_PEND[7:0] interrupt only on end of queue (EOQ).  When clear, a corresponding channel issues an interrupt at every end of packet (EOP)." range="7:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPDMA_REGS_TH_IDVER_REG" acronym="CPSW_NC_CPDMA_REGS_TH_IDVER_REG" offset="213008" width="32" description="CPDMA THost IDVER">
		<bitfield id="TH_IDVER" width="32" begin="31" end="0" resetval="0x1573130" description="CPDMA THost IDVER" range="31:0" rwaccess="R"/>
	</register><register id="CPSW_NC_CPDMA_REGS_TH_CONTROL_REG" acronym="CPSW_NC_CPDMA_REGS_TH_CONTROL_REG" offset="213012" width="32" description="CPDMA THost Control Register">
		<bitfield id="TH_EN" width="1" begin="0" end="0" resetval="0x0" description="THost DMA Enable      0 - Disabled      1 - Enabled" range="0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPDMA_REGS_TH_TEARDOWN_REG" acronym="CPSW_NC_CPDMA_REGS_TH_TEARDOWN_REG" offset="213016" width="32" description="CPDMA THost Teardown Register">
		<bitfield id="TH_TDN_CH" width="3" begin="2" end="0" resetval="0x0" description="THost Teardown Channel - THost channel teardown is commanded by writing the encoded value of the channel to be torn down.  The teardown register is read as zero.   000 - teardown channel 0   ...   111 - teardown channel 7" range="2:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPDMA_REGS_SOFT_RESET_REG" acronym="CPSW_NC_CPDMA_REGS_SOFT_RESET_REG" offset="213020" width="32" description="CPDMA Soft Reset Register">
		<bitfield id="SOFT_RESET" width="1" begin="0" end="0" resetval="0x0" description="Software reset - Writing a one to this bit causes the entire CPSW logic to be reset.   Software reset occurs when the DMA Controllers are in an idle state to avoid locking up the VBUSP bus.  After writing a one to this bit, it may be polled to determine if the reset has occurred.  If a one is read, the reset has not yet occurred.  If a zero is read then reset has occurred." range="0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPDMA_REGS_CONTROL_REG" acronym="CPSW_NC_CPDMA_REGS_CONTROL_REG" offset="213024" width="32" description="CPDMA Control Register">
		<bitfield id="FH_OWNERSHIP" width="1" begin="8" end="8" resetval="0x0" description="CPDMA FHost Ownership Write Bit Value.   0 - The CPDMA writes the FHost buffer descriptor ownership bit to zero at the end of packet processing as specified in CPPI 3.0.   1 - The CPDMA writes the FHost buffer descriptor ownership bit to one at the end of packet processing.  Users who do not use the ownership mechanism can use this mode to preclude the necessity of software having to set this bit each time the buffer descriptor is used.  Software must set this bit when building the packet chain." range="8" rwaccess="R/W"/>
	<bitfield id="TH_CH_OVERRIDE" width="1" begin="7" end="7" resetval="0x0" description="CPDMA THost Channel Classification Match Override Enable   0 - The THost channel is not overridden with the ALE classification match.   1 - The THOST channel is overridden with the lower 3-bits of the ALE classification match value (if a classification match occurred)." range="7" rwaccess="R/W"/>
	<bitfield id="TH_TS_ENCAP" width="1" begin="6" end="6" resetval="0x0" description="CPDMA THost Packet Timestamp Encapsulation   0 - THost packets do not contain a 64-bit timestamp   1 - THost packets contain a 64-bit timestamp prepended to the packet data (32-bit lsword first)." range="6" rwaccess="R/W"/>
	<bitfield id="TH_VLAN_ENCAP" width="1" begin="5" end="5" resetval="0x0" description="CPDMA THost Packet VLAN Encapsulation   0 - THost packets are not VLAN encapsulated   1 - THost packets are VLAN encapsulated" range="5" rwaccess="R/W"/>
	<bitfield id="TH_CEF" width="1" begin="4" end="4" resetval="0x0" description="CPDMA THost Copy Error Frames Enable - Enables THost DMA overrun frames to be transferred to memory (up to the point of buffer overrun).  The overrun error bit will be set in the frame EOP buffer descriptor.   Overrun frame data will be filtered when thost_cef is not set.  THost frames with other error bits set are not affected by this bit.  This is related only to frames that overrun on the THost DMA due to buffer limitations.   0 - Frames containing overrun errors are filtered.   1 - Frames containing overrun errors are transferred to memory." range="4" rwaccess="R/W"/>
	<bitfield id="CMD_IDLE" width="1" begin="3" end="3" resetval="0x0" description="CPDMA Command Idle   0 - Idle not commanded   1 - Idle Commanded (read idle in CPDMA_Status register)" range="3" rwaccess="R/W"/>
	<bitfield id="TH_OFFLEN_BLOCK" width="1" begin="2" end="2" resetval="0x0" description="CPDMA THost Offset/Length word write block   0 - Do not block the DMA writes to the THost buffer descriptor offset/buffer length word.  The offset/buffer length word is written as specified in CPPI 3.0.   1 - Block all CPDMA DMA controller writes to the THost buffer descriptor offset/buffer length words during CPPI packet processing.  When this bit is set, the CPDMA will never write the third word to any THost buffer descriptor." range="2" rwaccess="R/W"/>
	<bitfield id="TH_OWNERSHIP" width="1" begin="1" end="1" resetval="0x0" description="CPDMA THost Ownership Write Bit Value  0 - The CPDMA writes the THost buffer descriptor ownership bit to zero at the end of packet processing as specified in CPPI 3.0.  1 - The CPDMA writes the THost buffer descriptor ownership bit to one at the end of packet processing.  Users who do not use the ownership mechanism can use this mode to preclude the necessity of software having to set this bit each time the buffer descriptor is used. Software must set this bit when building the packet chain." range="1" rwaccess="R/W"/>
	<bitfield id="FH_PTYPE" width="1" begin="0" end="0" resetval="0x0" description="CPDMA FHost Queue Priority Type   0 - The queue uses a round robin scheme to select the next channel.   1 - The queue uses a fixed (channel 7 highest priority) priority scheme to select the next channel." range="0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPDMA_REGS_STATUS_REG" acronym="CPSW_NC_CPDMA_REGS_STATUS_REG" offset="213028" width="32" description="CPDMA Status Register">
		<bitfield id="IDLE" width="1" begin="31" end="31" resetval="0x1" description="CPDMA Idle Status Bit - Indicates when set that the CPDMA is not transferring a packet FHost or THost." range="31" rwaccess="R"/>
	<bitfield id="FH_HOST_ERROR_CODE" width="4" begin="23" end="20" resetval="0x0" description="CPDMA FHost Error Code - This field is set to indicate CPDMA detected FHost DMA related host errors.  The host should read this field after a HOST_ERR_INT to determine the error.  Host error Interrupts require hardware reset in order to recover.  A zero packet length is an error, but it is not detected.   0000 - No error   0001 - SOP error   0010 - Ownership bit not set in SOP buffer   0011 - Zero Next Buffer Descriptor Pointer Without EOP   0100 - Zero Buffer Pointer   0101 - Zero Buffer Length   0110 - Packet Length Error (sum of buffers &#60; packet length)   0111 - reserved ... 1111 - reserved" range="23:20" rwaccess="R"/>
	<bitfield id="FH_ERR_CH" width="3" begin="18" end="16" resetval="0x0" description="CPDMA FHost Error Channel - This field indicates the FHost channel that had a host error.      000 - The host error occurred on TX channel 0   ...   111 - The host error occurred on TX channel 7" range="18:16" rwaccess="R"/>
	<bitfield id="TH_HOST_ERROR_CODE" width="4" begin="15" end="12" resetval="0x0" description="CPDMA THost Error Code - This field is set to indicate CPDMA detected RX DMA related host errors.  The host should read this field after a HOST_ERR_INT to determine the error.  Host error Interrupts require hardware reset in order to recover.   0000 - No error   0001 - reserved   0010 - Ownership bit not set in input buffer.   0011 - reserved   0100 - Zero Buffer Pointer.   0101 - Zero buffer length on non-SOP descriptor   0110 - SOP buffer length not greater than offset   ...   1111 - reserved" range="15:12" rwaccess="R"/>
	<bitfield id="TH_ERR_CH" width="3" begin="10" end="8" resetval="0x0" description="CPDMA THost Host Error Channel - This field indicates which THost channel had a host error.      000 - The host error occurred on THost channel 0   ...   111 - The host error occurred on RX channel 7" range="10:8" rwaccess="R"/>
	</register><register id="CPSW_NC_CPDMA_REGS_TH_BUFFER_OFFSET_REG" acronym="CPSW_NC_CPDMA_REGS_TH_BUFFER_OFFSET_REG" offset="213032" width="32" description="CPDMA THost Buffer Offset Register">
		<bitfield id="TH_BUFFER_OFFSET" width="12" begin="11" end="0" resetval="0x0" description="CPDMA THost Buffer Offset Value - The thost_buffer_offset will be written by the port into each frame SOP buffer descriptor buffer_offset field.  The frame data will begin after the thost_buffer_offset value of bytes.  A value of 0x0 indicates that there are no unused bytes at the beginning of the data and that valid data begins on the first byte of the buffer.  A value of 0xF (decimal 15) indicates that the first 15 bytes of the buffer are to be ignored by the port and that valid buffer data starts on byte 16 of the buffer.  This value is used for all channels." range="11:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPDMA_REGS_EMULATION_CONTROL_REG" acronym="CPSW_NC_CPDMA_REGS_EMULATION_CONTROL_REG" offset="213036" width="32" description="CPDMA Emulation Control Register">
		<bitfield id="FREE" width="1" begin="1" end="1" resetval="0x0" description="CPDMA Free bit" range="1" rwaccess="R/W"/>
	<bitfield id="SOFT" width="1" begin="0" end="0" resetval="0x0" description="CPDMA Soft bit" range="0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPDMA_INT_FH_INTSTAT_RAW_REG" acronym="CPSW_NC_CPDMA_INT_FH_INTSTAT_RAW_REG" offset="213120" width="32" description="CPDMA FHost Interrupt Status RAW">
		<bitfield id="FH7_PEND_RAW" width="1" begin="7" end="7" resetval="0x0" description="CPDMA FHost Channel 7 Interrupt Pending RAW read (before mask)" range="7" rwaccess="R"/>
	<bitfield id="FH6_PEND_RAW" width="1" begin="6" end="6" resetval="0x0" description="CPDMA FHost Channel 6 Interrupt Pending RAW read (before mask)" range="6" rwaccess="R"/>
	<bitfield id="FH5_PEND_RAW" width="1" begin="5" end="5" resetval="0x0" description="CPDMA FHost Channel 5 Interrupt Pending RAW read (before mask)" range="5" rwaccess="R"/>
	<bitfield id="FH4_PEND_RAW" width="1" begin="4" end="4" resetval="0x0" description="CPDMA FHost Channel 4 Interrupt Pending RAW read (before mask)" range="4" rwaccess="R"/>
	<bitfield id="FH3_PEND_RAW" width="1" begin="3" end="3" resetval="0x0" description="CPDMA FHost Channel 3 Interrupt Pending RAW read (before mask)" range="3" rwaccess="R"/>
	<bitfield id="FH2_PEND_RAW" width="1" begin="2" end="2" resetval="0x0" description="CPDMA FHost Channel 2 Interrupt Pending RAW read (before mask)" range="2" rwaccess="R"/>
	<bitfield id="FH1_PEND_RAW" width="1" begin="1" end="1" resetval="0x0" description="CPDMA FHost Channel 1 Interrupt Pending RAW read (before mask)" range="1" rwaccess="R"/>
	<bitfield id="FH0_PEND_RAW" width="1" begin="0" end="0" resetval="0x0" description="CPDMA FHost Channel 0 Interrupt Pending RAW read (before mask)" range="0" rwaccess="R"/>
	</register><register id="CPSW_NC_CPDMA_INT_FH_INTSTAT_MASKED_REG" acronym="CPSW_NC_CPDMA_INT_FH_INTSTAT_MASKED_REG" offset="213124" width="32" description="CPDMA FHost Interrupt Status MASKED">
		<bitfield id="FH7_PEND_MASKED" width="1" begin="7" end="7" resetval="0x0" description="CPDMA FHost Channel 7 Interrupt Pending MASKED interrupt read" range="7" rwaccess="R"/>
	<bitfield id="FH6_PEND_MASKED" width="1" begin="6" end="6" resetval="0x0" description="CPDMA FHost Channel 6 Interrupt Pending MASKED interrupt read" range="6" rwaccess="R"/>
	<bitfield id="FH5_PEND_MASKED" width="1" begin="5" end="5" resetval="0x0" description="CPDMA FHost Channel 5 Interrupt Pending MASKED interrupt read" range="5" rwaccess="R"/>
	<bitfield id="FH4_PEND_MASKED" width="1" begin="4" end="4" resetval="0x0" description="CPDMA FHost Channel 4 Interrupt Pending MASKED interrupt read" range="4" rwaccess="R"/>
	<bitfield id="FH3_PEND_MASKED" width="1" begin="3" end="3" resetval="0x0" description="CPDMA FHost Channel 3 Interrupt Pending MASKED interrupt read" range="3" rwaccess="R"/>
	<bitfield id="FH2_PEND_MASKED" width="1" begin="2" end="2" resetval="0x0" description="CPDMA FHost Channel 2 Interrupt Pending MASKED interrupt read" range="2" rwaccess="R"/>
	<bitfield id="FH1_PEND_MASKED" width="1" begin="1" end="1" resetval="0x0" description="CPDMA FHost Channel 1 Interrupt Pending MASKED interrupt read" range="1" rwaccess="R"/>
	<bitfield id="FH0_PEND_MASKED" width="1" begin="0" end="0" resetval="0x0" description="CPDMA FHost Channel 0 Interrupt Pending MASKED interrupt read" range="0" rwaccess="R"/>
	</register><register id="CPSW_NC_CPDMA_INT_FH_INTMASK_SET_REG" acronym="CPSW_NC_CPDMA_INT_FH_INTMASK_SET_REG" offset="213128" width="32" description="CPDMA FHost Interrupt Masked SET">
		<bitfield id="FH7_PEND_MASKED_SET" width="1" begin="7" end="7" resetval="0x0" description="CPDMA FHost Channel 7 Interrupt Pending MASKED Set - write one to enable interrupt" range="7" rwaccess="R/W1TS"/>
	<bitfield id="FH6_PEND_MASKED_SET" width="1" begin="6" end="6" resetval="0x0" description="CPDMA FHost Channel 6 Interrupt Pending MASKED Set - write one to enable interrupt" range="6" rwaccess="R/W1TS"/>
	<bitfield id="FH5_PEND_MASKED_SET" width="1" begin="5" end="5" resetval="0x0" description="CPDMA FHost Channel 5 Interrupt Pending MASKED Set - write one to enable interrupt" range="5" rwaccess="R/W1TS"/>
	<bitfield id="FH4_PEND_MASKED_SET" width="1" begin="4" end="4" resetval="0x0" description="CPDMA FHost Channel 4 Interrupt Pending MASKED Set - write one to enable interrupt" range="4" rwaccess="R/W1TS"/>
	<bitfield id="FH3_PEND_MASKED_SET" width="1" begin="3" end="3" resetval="0x0" description="CPDMA FHost Channel 3 Interrupt Pending MASKED Set - write one to enable interrupt" range="3" rwaccess="R/W1TS"/>
	<bitfield id="FH2_PEND_MASKED_SET" width="1" begin="2" end="2" resetval="0x0" description="CPDMA FHost Channel 2 Interrupt Pending MASKED Set - write one to enable interrupt" range="2" rwaccess="R/W1TS"/>
	<bitfield id="FH1_PEND_MASKED_SET" width="1" begin="1" end="1" resetval="0x0" description="CPDMA FHost Channel 1 Interrupt Pending MASKED Set - write one to enable interrupt" range="1" rwaccess="R/W1TS"/>
	<bitfield id="FH0_PEND_MASKED_SET" width="1" begin="0" end="0" resetval="0x0" description="CPDMA FHost Channel 0 Interrupt Pending MASKED Set - write one to enable interrupt" range="0" rwaccess="R/W1TS"/>
	</register><register id="CPSW_NC_CPDMA_INT_FH_INTMASK_CLEAR_REG" acronym="CPSW_NC_CPDMA_INT_FH_INTMASK_CLEAR_REG" offset="213132" width="32" description="CPDMA FHost Interrupt Masked CLR">
		<bitfield id="FH7_PEND_MASKED_CLR" width="1" begin="7" end="7" resetval="0x0" description="CPDMA FHost Channel 7 Interrupt Pending MASKED Clr - write one to disable interrupt" range="7" rwaccess="R/W1TC"/>
	<bitfield id="FH6_PEND_MASKED_CLR" width="1" begin="6" end="6" resetval="0x0" description="CPDMA FHost Channel 6 Interrupt Pending MASKED Clr - write one to disable interrupt" range="6" rwaccess="R/W1TC"/>
	<bitfield id="FH5_PEND_MASKED_CLR" width="1" begin="5" end="5" resetval="0x0" description="CPDMA FHost Channel 5 Interrupt Pending MASKED Clr - write one to disable interrupt" range="5" rwaccess="R/W1TC"/>
	<bitfield id="FH4_PEND_MASKED_CLR" width="1" begin="4" end="4" resetval="0x0" description="CPDMA FHost Channel 4 Interrupt Pending MASKED Clr - write one to disable interrupt" range="4" rwaccess="R/W1TC"/>
	<bitfield id="FH3_PEND_MASKED_CLR" width="1" begin="3" end="3" resetval="0x0" description="CPDMA FHost Channel 3 Interrupt Pending MASKED Clr - write one to disable interrupt" range="3" rwaccess="R/W1TC"/>
	<bitfield id="FH2_PEND_MASKED_CLR" width="1" begin="2" end="2" resetval="0x0" description="CPDMA FHost Channel 2 Interrupt Pending MASKED Clr - write one to disable interrupt" range="2" rwaccess="R/W1TC"/>
	<bitfield id="FH1_PEND_MASKED_CLR" width="1" begin="1" end="1" resetval="0x0" description="CPDMA FHost Channel 1 Interrupt Pending MASKED Clr - write one to disable interrupt" range="1" rwaccess="R/W1TC"/>
	<bitfield id="FH0_PEND_MASKED_CLR" width="1" begin="0" end="0" resetval="0x0" description="CPDMA FHost Channel 0 Interrupt Pending MASKED Clr - write one to disable interrupt" range="0" rwaccess="R/W1TC"/>
	</register><register id="CPSW_NC_CPDMA_INT_IN_VECTOR_REG" acronym="CPSW_NC_CPDMA_INT_IN_VECTOR_REG" offset="213136" width="32" description="CPDMA DMA IN Vector">
		<bitfield id="DMA_IN_VECTOR" width="32" begin="31" end="0" resetval="0x0" description="The value of CPDMA_In_Vector is reset to zero, but will change to the IN_VECTOR input bus value one clock after reset is deasserted.  Thereafter, this value will change to a new IN_VECTOR input value one clock after the IN_VECTOR value changes. " range="31:0" rwaccess="R"/>
	</register><register id="CPSW_NC_CPDMA_INT_EOI_VECTOR_REG" acronym="CPSW_NC_CPDMA_INT_EOI_VECTOR_REG" offset="213140" width="32" description="The CPDMA_EOI_VECTOR(4:0) output bus reflects the value written to this location one VBUSP_GCLK cycle after a write to this location.  The EOI_WR signal is asserted for a single clock cycle after a latency of two VBUSP_GCLK cycles when a write is performed to this location.">
		<bitfield id="DMA_EOI_VECTOR" width="5" begin="4" end="0" resetval="0x0" description="CPDMA DMA EOI Vector" range="4:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPDMA_INT_TH_INTSTAT_RAW_REG" acronym="CPSW_NC_CPDMA_INT_TH_INTSTAT_RAW_REG" offset="213152" width="32" description="CPDMA Receive Interrupt Status RAW">
		<bitfield id="TH7_THRESH_PEND_RAW" width="1" begin="15" end="15" resetval="0x0" description="CPDMA Receive Channel 7 Threshold Interrupt Pending RAW read (before mask)" range="15" rwaccess="R"/>
	<bitfield id="TH6_THRESH_PEND_RAW" width="1" begin="14" end="14" resetval="0x0" description="CPDMA Receive Channel 6 Threshold Interrupt Pending RAW read (before mask)" range="14" rwaccess="R"/>
	<bitfield id="TH5_THRESH_PEND_RAW" width="1" begin="13" end="13" resetval="0x0" description="CPDMA Receive Channel 5 Threshold Interrupt Pending RAW read (before mask)" range="13" rwaccess="R"/>
	<bitfield id="TH4_THRESH_PEND_RAW" width="1" begin="12" end="12" resetval="0x0" description="CPDMA Receive Channel 4 Threshold Interrupt Pending RAW read (before mask)" range="12" rwaccess="R"/>
	<bitfield id="TH3_THRESH_PEND_RAW" width="1" begin="11" end="11" resetval="0x0" description="CPDMA Receive Channel 3 Threshold Interrupt Pending RAW read (before mask)" range="11" rwaccess="R"/>
	<bitfield id="TH2_THRESH_PEND_RAW" width="1" begin="10" end="10" resetval="0x0" description="CPDMA Receive Channel 2 Threshold Interrupt Pending RAW read (before mask)" range="10" rwaccess="R"/>
	<bitfield id="TH1_THRESH_PEND_RAW" width="1" begin="9" end="9" resetval="0x0" description="CPDMA Receive Channel 1 Threshold Interrupt Pending RAW read (before mask)" range="9" rwaccess="R"/>
	<bitfield id="TH0_THRESH_PEND_RAW" width="1" begin="8" end="8" resetval="0x0" description="CPDMA Receive Channel 0 Threshold Interrupt Pending RAW read (before mask)" range="8" rwaccess="R"/>
	<bitfield id="TH7_PEND_RAW" width="1" begin="7" end="7" resetval="0x0" description="CPDMA Receive Channel 7 Interrupt Pending RAW read (before mask)" range="7" rwaccess="R"/>
	<bitfield id="TH6_PEND_RAW" width="1" begin="6" end="6" resetval="0x0" description="CPDMA Receive Channel 6 Interrupt Pending RAW read (before mask)" range="6" rwaccess="R"/>
	<bitfield id="TH5_PEND_RAW" width="1" begin="5" end="5" resetval="0x0" description="CPDMA Receive Channel 5 Interrupt Pending RAW read (before mask)" range="5" rwaccess="R"/>
	<bitfield id="TH4_PEND_RAW" width="1" begin="4" end="4" resetval="0x0" description="CPDMA Receive Channel 4 Interrupt Pending RAW read (before mask)" range="4" rwaccess="R"/>
	<bitfield id="TH3_PEND_RAW" width="1" begin="3" end="3" resetval="0x0" description="CPDMA Receive Channel 3 Interrupt Pending RAW read (before mask)" range="3" rwaccess="R"/>
	<bitfield id="TH2_PEND_RAW" width="1" begin="2" end="2" resetval="0x0" description="CPDMA Receive Channel 2 Interrupt Pending RAW read (before mask)" range="2" rwaccess="R"/>
	<bitfield id="TH1_PEND_RAW" width="1" begin="1" end="1" resetval="0x0" description="CPDMA Receive Channel 1 Interrupt Pending RAW read (before mask)" range="1" rwaccess="R"/>
	<bitfield id="TH0_PEND_RAW" width="1" begin="0" end="0" resetval="0x0" description="CPDMA Receive Channel 0 Interrupt Pending RAW read (before mask)" range="0" rwaccess="R"/>
	</register><register id="CPSW_NC_CPDMA_INT_TH_INTSTAT_MASKED_REG" acronym="CPSW_NC_CPDMA_INT_TH_INTSTAT_MASKED_REG" offset="213156" width="32" description="CPDMA Receive Interrupt Status MASKED">
		<bitfield id="TH7_THRESH_PEND_MASKED" width="1" begin="15" end="15" resetval="0x0" description="CPDMA Receive Channel 7 Threshold Interrupt Pending MASKED read" range="15" rwaccess="R"/>
	<bitfield id="TH6_THRESH_PEND_MASKED" width="1" begin="14" end="14" resetval="0x0" description="CPDMA Receive Channel 6 Threshold Interrupt Pending MASKED read" range="14" rwaccess="R"/>
	<bitfield id="TH5_THRESH_PEND_MASKED" width="1" begin="13" end="13" resetval="0x0" description="CPDMA Receive Channel 5 Threshold Interrupt Pending MASKED read" range="13" rwaccess="R"/>
	<bitfield id="TH4_THRESH_PEND_MASKED" width="1" begin="12" end="12" resetval="0x0" description="CPDMA Receive Channel 4 Threshold Interrupt Pending MASKED read" range="12" rwaccess="R"/>
	<bitfield id="TH3_THRESH_PEND_MASKED" width="1" begin="11" end="11" resetval="0x0" description="CPDMA Receive Channel 3 Threshold Interrupt Pending MASKED read" range="11" rwaccess="R"/>
	<bitfield id="TH2_THRESH_PEND_MASKED" width="1" begin="10" end="10" resetval="0x0" description="CPDMA Receive Channel 2 Threshold Interrupt Pending MASKED read" range="10" rwaccess="R"/>
	<bitfield id="TH1_THRESH_PEND_MASKED" width="1" begin="9" end="9" resetval="0x0" description="CPDMA Receive Channel 1 Threshold Interrupt Pending MASKED read" range="9" rwaccess="R"/>
