ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263X/CPSW_CPSW_52800000h.xml
	<bitfield id="TH0_THRESH_PEND_MASKED" width="1" begin="8" end="8" resetval="0x0" description="CPDMA Receive Channel 0 Threshold Interrupt Pending MASKED read" range="8" rwaccess="R"/>
	<bitfield id="TH7_PEND_MASKED" width="1" begin="7" end="7" resetval="0x0" description="CPDMA Receive Channel 7 Interrupt Pending MASKED read" range="7" rwaccess="R"/>
	<bitfield id="TH6_PEND_MASKED" width="1" begin="6" end="6" resetval="0x0" description="CPDMA Receive Channel 6 Interrupt Pending MASKED read" range="6" rwaccess="R"/>
	<bitfield id="TH5_PEND_MASKED" width="1" begin="5" end="5" resetval="0x0" description="CPDMA Receive Channel 5 Interrupt Pending MASKED read" range="5" rwaccess="R"/>
	<bitfield id="TH4_PEND_MASKED" width="1" begin="4" end="4" resetval="0x0" description="CPDMA Receive Channel 4 Interrupt Pending MASKED read" range="4" rwaccess="R"/>
	<bitfield id="TH3_PEND_MASKED" width="1" begin="3" end="3" resetval="0x0" description="CPDMA Receive Channel 3 Interrupt Pending MASKED read" range="3" rwaccess="R"/>
	<bitfield id="TH2_PEND_MASKED" width="1" begin="2" end="2" resetval="0x0" description="CPDMA Receive Channel 2 Interrupt Pending MASKED read" range="2" rwaccess="R"/>
	<bitfield id="TH1_PEND_MASKED" width="1" begin="1" end="1" resetval="0x0" description="CPDMA Receive Channel 1 Interrupt Pending MASKED read" range="1" rwaccess="R"/>
	<bitfield id="TH0_PEND_MASKED" width="1" begin="0" end="0" resetval="0x0" description="CPDMA Receive Channel 0 Interrupt Pending MASKED read" range="0" rwaccess="R"/>
	</register><register id="CPSW_NC_CPDMA_INT_TH_INTMASK_SET_REG" acronym="CPSW_NC_CPDMA_INT_TH_INTMASK_SET_REG" offset="213160" width="32" description="CPDMA THost Interrupt Masked SET">
		<bitfield id="TH7_THRESH_PEND_MASKED_SET" width="1" begin="15" end="15" resetval="0x0" description="CPDMA THost Channel 7 Threshold Interrupt Pending SET - write one to enable interrupt" range="15" rwaccess="R/W1TS"/>
	<bitfield id="TH6_THRESH_PEND_MASKED_SET" width="1" begin="14" end="14" resetval="0x0" description="CPDMA THost Channel 6 Threshold Interrupt Pending SET - write one to enable interrupt" range="14" rwaccess="R/W1TS"/>
	<bitfield id="TH5_THRESH_PEND_MASKED_SET" width="1" begin="13" end="13" resetval="0x0" description="CPDMA THost Channel 5 Threshold Interrupt Pending SET - write one to enable interrupt" range="13" rwaccess="R/W1TS"/>
	<bitfield id="TH4_THRESH_PEND_MASKED_SET" width="1" begin="12" end="12" resetval="0x0" description="CPDMA THost Channel 4 Threshold Interrupt Pending SET - write one to enable interrupt" range="12" rwaccess="R/W1TS"/>
	<bitfield id="TH3_THRESH_PEND_MASKED_SET" width="1" begin="11" end="11" resetval="0x0" description="CPDMA THost Channel 3 Threshold Interrupt Pending SET - write one to enable interrupt" range="11" rwaccess="R/W1TS"/>
	<bitfield id="TH2_THRESH_PEND_MASKED_SET" width="1" begin="10" end="10" resetval="0x0" description="CPDMA THost Channel 2 Threshold Interrupt Pending SET - write one to enable interrupt" range="10" rwaccess="R/W1TS"/>
	<bitfield id="TH1_THRESH_PEND_MASKED_SET" width="1" begin="9" end="9" resetval="0x0" description="CPDMA THost Channel 1 Threshold Interrupt Pending SET - write one to enable interrupt" range="9" rwaccess="R/W1TS"/>
	<bitfield id="TH0_THRESH_PEND_MASKED_SET" width="1" begin="8" end="8" resetval="0x0" description="CPDMA THost Channel 0 Threshold Interrupt Pending SET - write one to enable interrupt" range="8" rwaccess="R/W1TS"/>
	<bitfield id="TH7_PEND_MASKED_SET" width="1" begin="7" end="7" resetval="0x0" description="CPDMA THost Channel 7 Interrupt Pending SET - write one to enable interrupt" range="7" rwaccess="R/W1TS"/>
	<bitfield id="TH6_PEND_MASKED_SET" width="1" begin="6" end="6" resetval="0x0" description="CPDMA THost Channel 6 Interrupt Pending SET - write one to enable interrupt" range="6" rwaccess="R/W1TS"/>
	<bitfield id="TH5_PEND_MASKED_SET" width="1" begin="5" end="5" resetval="0x0" description="CPDMA THost Channel 5 Interrupt Pending SET - write one to enable interrupt" range="5" rwaccess="R/W1TS"/>
	<bitfield id="TH4_PEND_MASKED_SET" width="1" begin="4" end="4" resetval="0x0" description="CPDMA THost Channel 4 Interrupt Pending SET - write one to enable interrupt" range="4" rwaccess="R/W1TS"/>
	<bitfield id="TH3_PEND_MASKED_SET" width="1" begin="3" end="3" resetval="0x0" description="CPDMA THost Channel 3 Interrupt Pending SET - write one to enable interrupt" range="3" rwaccess="R/W1TS"/>
	<bitfield id="TH2_PEND_MASKED_SET" width="1" begin="2" end="2" resetval="0x0" description="CPDMA THost Channel 2 Interrupt Pending SET - write one to enable interrupt" range="2" rwaccess="R/W1TS"/>
	<bitfield id="TH1_PEND_MASKED_SET" width="1" begin="1" end="1" resetval="0x0" description="CPDMA THost Channel 1 Interrupt Pending SET - write one to enable interrupt" range="1" rwaccess="R/W1TS"/>
	<bitfield id="TH0_PEND_MASKED_SET" width="1" begin="0" end="0" resetval="0x0" description="CPDMA THost Channel 0 Interrupt Pending SET - write one to enable interrupt" range="0" rwaccess="R/W1TS"/>
	</register><register id="CPSW_NC_CPDMA_INT_TH_INTMASK_CLEAR_REG" acronym="CPSW_NC_CPDMA_INT_TH_INTMASK_CLEAR_REG" offset="213164" width="32" description="CPDMA THost Interrupt Masked CLR">
		<bitfield id="TH7_THRESH_PEND_MASKED_CLR" width="1" begin="15" end="15" resetval="0x0" description="CPDMA THost Channel 7 Threshold Interrupt Pending CLR - write one to disable interrupt" range="15" rwaccess="R/W1TC"/>
	<bitfield id="TH6_THRESH_PEND_MASKED_CLR" width="1" begin="14" end="14" resetval="0x0" description="CPDMA THost Channel 6 Threshold Interrupt Pending CLR - write one to disable interrupt" range="14" rwaccess="R/W1TC"/>
	<bitfield id="TH5_THRESH_PEND_MASKED_CLR" width="1" begin="13" end="13" resetval="0x0" description="CPDMA THost Channel 5 Threshold Interrupt Pending CLR - write one to disable interrupt" range="13" rwaccess="R/W1TC"/>
	<bitfield id="TH4_THRESH_PEND_MASKED_CLR" width="1" begin="12" end="12" resetval="0x0" description="CPDMA THost Channel 4 Threshold Interrupt Pending CLR - write one to disable interrupt" range="12" rwaccess="R/W1TC"/>
	<bitfield id="TH3_THRESH_PEND_MASKED_CLR" width="1" begin="11" end="11" resetval="0x0" description="CPDMA THost Channel 3 Threshold Interrupt Pending CLR - write one to disable interrupt" range="11" rwaccess="R/W1TC"/>
	<bitfield id="TH2_THRESH_PEND_MASKED_CLR" width="1" begin="10" end="10" resetval="0x0" description="CPDMA THost Channel 2 Threshold Interrupt Pending CLR - write one to disable interrupt" range="10" rwaccess="R/W1TC"/>
	<bitfield id="TH1_THRESH_PEND_MASKED_CLR" width="1" begin="9" end="9" resetval="0x0" description="CPDMA THost Channel 1 Threshold Interrupt Pending CLR - write one to disable interrupt" range="9" rwaccess="R/W1TC"/>
	<bitfield id="TH0_THRESH_PEND_MASKED_CLR" width="1" begin="8" end="8" resetval="0x0" description="CPDMA THost Channel 0 Threshold Interrupt Pending CLR - write one to disable interrupt" range="8" rwaccess="R/W1TC"/>
	<bitfield id="TH7_PEND_MASKED_CLR" width="1" begin="7" end="7" resetval="0x0" description="CPDMA THost Channel 7 Interrupt Pending CLR - write one to disable interrupt" range="7" rwaccess="R/W1TC"/>
	<bitfield id="TH6_PEND_MASKED_CLR" width="1" begin="6" end="6" resetval="0x0" description="CPDMA THost Channel 6 Interrupt Pending CLR - write one to disable interrupt" range="6" rwaccess="R/W1TC"/>
	<bitfield id="TH5_PEND_MASKED_CLR" width="1" begin="5" end="5" resetval="0x0" description="CPDMA THost Channel 5 Interrupt Pending CLR - write one to disable interrupt" range="5" rwaccess="R/W1TC"/>
	<bitfield id="TH4_PEND_MASKED_CLR" width="1" begin="4" end="4" resetval="0x0" description="CPDMA THost Channel 4 Interrupt Pending CLR - write one to disable interrupt" range="4" rwaccess="R/W1TC"/>
	<bitfield id="TH3_PEND_MASKED_CLR" width="1" begin="3" end="3" resetval="0x0" description="CPDMA THost Channel 3 Interrupt Pending CLR - write one to disable interrupt" range="3" rwaccess="R/W1TC"/>
	<bitfield id="TH2_PEND_MASKED_CLR" width="1" begin="2" end="2" resetval="0x0" description="CPDMA THost Channel 2 Interrupt Pending CLR - write one to disable interrupt" range="2" rwaccess="R/W1TC"/>
	<bitfield id="TH1_PEND_MASKED_CLR" width="1" begin="1" end="1" resetval="0x0" description="CPDMA THost Channel 1 Interrupt Pending CLR - write one to disable interrupt" range="1" rwaccess="R/W1TC"/>
	<bitfield id="TH0_PEND_MASKED_CLR" width="1" begin="0" end="0" resetval="0x0" description="CPDMA THost Channel 0 Interrupt Pending CLR - write one to disable interrupt" range="0" rwaccess="R/W1TC"/>
	</register><register id="CPSW_NC_CPDMA_INT_INTSTAT_RAW_REG" acronym="CPSW_NC_CPDMA_INT_INTSTAT_RAW_REG" offset="213168" width="32" description="CPDMA DMA Interrupt Status RAW">
		<bitfield id="HOST_PEND_RAW" width="1" begin="1" end="1" resetval="0x0" description="CPDMA HOST Interrupt Pending RAW - read (before mask)" range="1" rwaccess="R"/>
	<bitfield id="STAT_PEND_RAW" width="1" begin="0" end="0" resetval="0x0" description="CPDMA Statistics Interrupt Pending RAW - read (before mask)" range="0" rwaccess="R"/>
	</register><register id="CPSW_NC_CPDMA_INT_INTSTAT_MASKED_REG" acronym="CPSW_NC_CPDMA_INT_INTSTAT_MASKED_REG" offset="213172" width="32" description="CPDMA DMA Interrupt Status MASKED">
		<bitfield id="HOST_PEND" width="1" begin="1" end="1" resetval="0x0" description="CPDMA HOST Interrupt Pending MASKED read" range="1" rwaccess="R"/>
	<bitfield id="STAT_PEND" width="1" begin="0" end="0" resetval="0x0" description="CPDMA Statistics Interrupt Pending MASKED read" range="0" rwaccess="R"/>
	</register><register id="CPSW_NC_CPDMA_INT_INTMASK_SET_REG" acronym="CPSW_NC_CPDMA_INT_INTMASK_SET_REG" offset="213176" width="32" description="CPDMA DMA Interrupt Status SET">
		<bitfield id="HOST_PEND_MASKED_SET" width="1" begin="1" end="1" resetval="0x0" description="CPDMA HOST Interrupt Masked SET - write one to enable interrupt" range="1" rwaccess="R/W1TS"/>
	<bitfield id="STAT_PEND_MASKED_SET" width="1" begin="0" end="0" resetval="0x0" description="CPDMA Statistics Interrupt Masked SET - write one to enable interrupt" range="0" rwaccess="R/W1TS"/>
	</register><register id="CPSW_NC_CPDMA_INT_INTMASK_CLEAR_REG" acronym="CPSW_NC_CPDMA_INT_INTMASK_CLEAR_REG" offset="213180" width="32" description="CPDMA DMA Interrupt Status CLR">
		<bitfield id="HOST_PEND_MASKED_CLR" width="1" begin="1" end="1" resetval="0x0" description="CPDMA HOST Interrupt Masked CLR - write one to disable interrupt" range="1" rwaccess="R/W1TS"/>
	<bitfield id="STAT_PEND_MASKED_CLR" width="1" begin="0" end="0" resetval="0x0" description="CPDMA Statistics Interrupt Masked CLR - write one to disable interrupt" range="0" rwaccess="R/W1TS"/>
	</register><register id="CPSW_NC_CPDMA_INT_TH0_PENDTHRESH_REG" acronym="CPSW_NC_CPDMA_INT_TH0_PENDTHRESH_REG" offset="213184" width="32" description="CPDMA THost Threshold Pending Register">
		<bitfield id="TH0_PENDTHRESH" width="8" begin="7" end="0" resetval="0x0" description="This field contains the threshold value for issuing threshold pending interrupts (when enabled)" range="7:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPDMA_INT_TH1_PENDTHRESH_REG" acronym="CPSW_NC_CPDMA_INT_TH1_PENDTHRESH_REG" offset="213188" width="32" description="CPDMA THost Threshold Pending Register">
		<bitfield id="TH1_PENDTHRESH" width="8" begin="7" end="0" resetval="0x0" description="This field contains the threshold value for issuing threshold pending interrupts (when enabled)" range="7:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPDMA_INT_TH2_PENDTHRESH_REG" acronym="CPSW_NC_CPDMA_INT_TH2_PENDTHRESH_REG" offset="213192" width="32" description="CPDMA THost Threshold Pending Register">
		<bitfield id="TH2_PENDTHRESH" width="8" begin="7" end="0" resetval="0x0" description="This field contains the threshold value for issuing threshold pending interrupts (when enabled)" range="7:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPDMA_INT_TH3_PENDTHRESH_REG" acronym="CPSW_NC_CPDMA_INT_TH3_PENDTHRESH_REG" offset="213196" width="32" description="CPDMA THost Threshold Pending Register">
		<bitfield id="TH3_PENDTHRESH" width="8" begin="7" end="0" resetval="0x0" description="This field contains the threshold value for issuing threshold pending interrupts (when enabled)" range="7:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPDMA_INT_TH4_PENDTHRESH_REG" acronym="CPSW_NC_CPDMA_INT_TH4_PENDTHRESH_REG" offset="213200" width="32" description="CPDMA THost Threshold Pending Register">
		<bitfield id="TH4_PENDTHRESH" width="8" begin="7" end="0" resetval="0x0" description="This field contains the threshold value for issuing threshold pending interrupts (when enabled)" range="7:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPDMA_INT_TH5_PENDTHRESH_REG" acronym="CPSW_NC_CPDMA_INT_TH5_PENDTHRESH_REG" offset="213204" width="32" description="CPDMA THost Threshold Pending Register">
		<bitfield id="TH5_PENDTHRESH" width="8" begin="7" end="0" resetval="0x0" description="This field contains the threshold value for issuing threshold pending interrupts (when enabled)" range="7:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPDMA_INT_TH6_PENDTHRESH_REG" acronym="CPSW_NC_CPDMA_INT_TH6_PENDTHRESH_REG" offset="213208" width="32" description="CPDMA THost Threshold Pending Register">
		<bitfield id="TH6_PENDTHRESH" width="8" begin="7" end="0" resetval="0x0" description="This field contains the threshold value for issuing threshold pending interrupts (when enabled)" range="7:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPDMA_INT_TH7_PENDTHRESH_REG" acronym="CPSW_NC_CPDMA_INT_TH7_PENDTHRESH_REG" offset="213212" width="32" description="CPDMA THost Threshold Pending Register">
		<bitfield id="TH7_PENDTHRESH" width="8" begin="7" end="0" resetval="0x0" description="This field contains the threshold value for issuing threshold pending interrupts (when enabled)" range="7:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPDMA_INT_TH0_FREEBUFFER_REG" acronym="CPSW_NC_CPDMA_INT_TH0_FREEBUFFER_REG" offset="213216" width="32" description="CPDMA THost Free Buffer Count Register">
		<bitfield id="TH0_FREEBUFFER" width="16" begin="15" end="0" resetval="0x0" description="This field contains the count of host free buffers available.  The th(0..7)_pendthresh value is compared with this field to determine if the THost threshold pending interrupt should be asseted (if enabled).  This is a write to increment field.  This field rolls over to zero on overflow.  If THost threshold pending interrupts are used, the host must initialize this field to the number of available buffers (one register per channel).  The port decrements (by the number of buffers in the frame) the associated channel register for each frame.  This is a write to increment field.  The host must write this field with the number of buffers that have been freed due to host processing." range="15:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPDMA_INT_TH1_FREEBUFFER_REG" acronym="CPSW_NC_CPDMA_INT_TH1_FREEBUFFER_REG" offset="213220" width="32" description="CPDMA THost Free Buffer Count Register">
		<bitfield id="TH1_FREEBUFFER" width="16" begin="15" end="0" resetval="0x0" description="This field contains the count of host free buffers available.  The th(0..7)_pendthresh value is compared with this field to determine if the THost threshold pending interrupt should be asseted (if enabled).  This is a write to increment field.  This field rolls over to zero on overflow.  If THost threshold pending interrupts are used, the host must initialize this field to the number of available buffers (one register per channel).  The port decrements (by the number of buffers in the frame) the associated channel register for each frame.  This is a write to increment field.  The host must write this field with the number of buffers that have been freed due to host processing." range="15:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPDMA_INT_TH2_FREEBUFFER_REG" acronym="CPSW_NC_CPDMA_INT_TH2_FREEBUFFER_REG" offset="213224" width="32" description="CPDMA THost Free Buffer Count Register">
		<bitfield id="TH2_FREEBUFFER" width="16" begin="15" end="0" resetval="0x0" description="This field contains the count of host free buffers available.  The th(0..7)_pendthresh value is compared with this field to determine if the THost threshold pending interrupt should be asseted (if enabled).  This is a write to increment field.  This field rolls over to zero on overflow.  If THost threshold pending interrupts are used, the host must initialize this field to the number of available buffers (one register per channel).  The port decrements (by the number of buffers in the frame) the associated channel register for each frame.  This is a write to increment field.  The host must write this field with the number of buffers that have been freed due to host processing." range="15:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPDMA_INT_TH3_FREEBUFFER_REG" acronym="CPSW_NC_CPDMA_INT_TH3_FREEBUFFER_REG" offset="213228" width="32" description="CPDMA THost Free Buffer Count Register">
		<bitfield id="TH3_FREEBUFFER" width="16" begin="15" end="0" resetval="0x0" description="This field contains the count of host free buffers available.  The th(0..7)_pendthresh value is compared with this field to determine if the THost threshold pending interrupt should be asseted (if enabled).  This is a write to increment field.  This field rolls over to zero on overflow.  If THost threshold pending interrupts are used, the host must initialize this field to the number of available buffers (one register per channel).  The port decrements (by the number of buffers in the frame) the associated channel register for each frame.  This is a write to increment field.  The host must write this field with the number of buffers that have been freed due to host processing." range="15:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPDMA_INT_TH4_FREEBUFFER_REG" acronym="CPSW_NC_CPDMA_INT_TH4_FREEBUFFER_REG" offset="213232" width="32" description="CPDMA THost Free Buffer Count Register">
		<bitfield id="TH4_FREEBUFFER" width="16" begin="15" end="0" resetval="0x0" description="This field contains the count of host free buffers available.  The th(0..7)_pendthresh value is compared with this field to determine if the THost threshold pending interrupt should be asseted (if enabled).  This is a write to increment field.  This field rolls over to zero on overflow.  If THost threshold pending interrupts are used, the host must initialize this field to the number of available buffers (one register per channel).  The port decrements (by the number of buffers in the frame) the associated channel register for each frame.  This is a write to increment field.  The host must write this field with the number of buffers that have been freed due to host processing." range="15:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPDMA_INT_TH5_FREEBUFFER_REG" acronym="CPSW_NC_CPDMA_INT_TH5_FREEBUFFER_REG" offset="213236" width="32" description="CPDMA THost Free Buffer Count Register">
		<bitfield id="TH5_FREEBUFFER" width="16" begin="15" end="0" resetval="0x0" description="This field contains the count of host free buffers available.  The th(0..7)_pendthresh value is compared with this field to determine if the THost threshold pending interrupt should be asseted (if enabled).  This is a write to increment field.  This field rolls over to zero on overflow.  If THost threshold pending interrupts are used, the host must initialize this field to the number of available buffers (one register per channel).  The port decrements (by the number of buffers in the frame) the associated channel register for each frame.  This is a write to increment field.  The host must write this field with the number of buffers that have been freed due to host processing." range="15:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPDMA_INT_TH6_FREEBUFFER_REG" acronym="CPSW_NC_CPDMA_INT_TH6_FREEBUFFER_REG" offset="213240" width="32" description="CPDMA THost Free Buffer Count Register">
		<bitfield id="TH6_FREEBUFFER" width="16" begin="15" end="0" resetval="0x0" description="This field contains the count of host free buffers available.  The th(0..7)_pendthresh value is compared with this field to determine if the THost threshold pending interrupt should be asseted (if enabled).  This is a write to increment field.  This field rolls over to zero on overflow.  If THost threshold pending interrupts are used, the host must initialize this field to the number of available buffers (one register per channel).  The port decrements (by the number of buffers in the frame) the associated channel register for each frame.  This is a write to increment field.  The host must write this field with the number of buffers that have been freed due to host processing." range="15:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPDMA_INT_TH7_FREEBUFFER_REG" acronym="CPSW_NC_CPDMA_INT_TH7_FREEBUFFER_REG" offset="213244" width="32" description="CPDMA THost Free Buffer Count Register">
		<bitfield id="TH7_FREEBUFFER" width="16" begin="15" end="0" resetval="0x0" description="This field contains the count of host free buffers available.  The th(0..7)_pendthresh value is compared with this field to determine if the THost threshold pending interrupt should be asseted (if enabled).  This is a write to increment field.  This field rolls over to zero on overflow.  If THost threshold pending interrupts are used, the host must initialize this field to the number of available buffers (one register per channel).  The port decrements (by the number of buffers in the frame) the associated channel register for each frame.  This is a write to increment field.  The host must write this field with the number of buffers that have been freed due to host processing." range="15:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPDMA_SRAM_FH0_HDP_REG" acronym="CPSW_NC_CPDMA_SRAM_FH0_HDP_REG" offset="213504" width="32" description="CPDMA FHost Channel 0 Head Descriptor Pointer">
		<bitfield id="FH0_HDP" width="32" begin="31" end="0" resetval="0x0" description="CPDMA FHost Channel 0 Head Descriptor Pointer" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPDMA_SRAM_FH1_HDP_REG" acronym="CPSW_NC_CPDMA_SRAM_FH1_HDP_REG" offset="213508" width="32" description="CPDMA FHost Channel 1 Head Descriptor Pointer">
		<bitfield id="FH1_HDP" width="32" begin="31" end="0" resetval="0x0" description="CPDMA FHost Channel 1 Head Descriptor Pointer" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPDMA_SRAM_FH2_HDP_REG" acronym="CPSW_NC_CPDMA_SRAM_FH2_HDP_REG" offset="213512" width="32" description="CPDMA FHost Channel 2 Head Descriptor Pointer">
		<bitfield id="FH2_HDP" width="32" begin="31" end="0" resetval="0x0" description="CPDMA FHost Channel 2 Head Descriptor Pointer" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPDMA_SRAM_FH3_HDP_REG" acronym="CPSW_NC_CPDMA_SRAM_FH3_HDP_REG" offset="213516" width="32" description="CPDMA FHost Channel 3 Head Descriptor Pointer">
		<bitfield id="FH3_HDP" width="32" begin="31" end="0" resetval="0x0" description="CPDMA FHost Channel 3 Head Descriptor Pointer" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPDMA_SRAM_FH4_HDP_REG" acronym="CPSW_NC_CPDMA_SRAM_FH4_HDP_REG" offset="213520" width="32" description="CPDMA FHost Channel 4 Head Descriptor Pointer">
		<bitfield id="FH4_HDP" width="32" begin="31" end="0" resetval="0x0" description="CPDMA FHost Channel 4 Head Descriptor Pointer" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPDMA_SRAM_FH5_HDP_REG" acronym="CPSW_NC_CPDMA_SRAM_FH5_HDP_REG" offset="213524" width="32" description="CPDMA FHost Channel 5 Head Descriptor Pointer">
