ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263X/CPSW_CPSW_52800000h.xml
		<bitfield id="FH5_HDP" width="32" begin="31" end="0" resetval="0x0" description="CPDMA FHost Channel 5 Head Descriptor Pointer" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPDMA_SRAM_FH6_HDP_REG" acronym="CPSW_NC_CPDMA_SRAM_FH6_HDP_REG" offset="213528" width="32" description="CPDMA FHost Channel 6 Head Descriptor Pointer">
		<bitfield id="FH6_HDP" width="32" begin="31" end="0" resetval="0x0" description="CPDMA FHost Channel 6 Head Descriptor Pointer" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPDMA_SRAM_FH7_HDP_REG" acronym="CPSW_NC_CPDMA_SRAM_FH7_HDP_REG" offset="213532" width="32" description="CPDMA FHost Channel 7 Head Descriptor Pointer">
		<bitfield id="FH7_HDP" width="32" begin="31" end="0" resetval="0x0" description="CPDMA FHost Channel 7 Head Descriptor Pointer" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPDMA_SRAM_TH0_HDP_REG" acronym="CPSW_NC_CPDMA_SRAM_TH0_HDP_REG" offset="213536" width="32" description="CPDMA THost Channel 0 Head Descriptor Pointer">
		<bitfield id="TH0_HDP" width="32" begin="31" end="0" resetval="0x0" description="CPDMA THost Channel 0 Head Descriptor Pointer" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPDMA_SRAM_TH1_HDP_REG" acronym="CPSW_NC_CPDMA_SRAM_TH1_HDP_REG" offset="213540" width="32" description="CPDMA THost Channel 1 Head Descriptor Pointer">
		<bitfield id="TH1_HDP" width="32" begin="31" end="0" resetval="0x0" description="CPDMA THost Channel 1 Head Descriptor Pointer" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPDMA_SRAM_TH2_HDP_REG" acronym="CPSW_NC_CPDMA_SRAM_TH2_HDP_REG" offset="213544" width="32" description="CPDMA THost Channel 2 Head Descriptor Pointer">
		<bitfield id="TH2_HDP" width="32" begin="31" end="0" resetval="0x0" description="CPDMA THost Channel 2 Head Descriptor Pointer" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPDMA_SRAM_TH3_HDP_REG" acronym="CPSW_NC_CPDMA_SRAM_TH3_HDP_REG" offset="213548" width="32" description="CPDMA THost Channel 3 Head Descriptor Pointer">
		<bitfield id="TH3_HDP" width="32" begin="31" end="0" resetval="0x0" description="CPDMA THost Channel 3 Head Descriptor Pointer" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPDMA_SRAM_TH4_HDP_REG" acronym="CPSW_NC_CPDMA_SRAM_TH4_HDP_REG" offset="213552" width="32" description="CPDMA THost Channel 4 Head Descriptor Pointer">
		<bitfield id="TH4_HDP" width="32" begin="31" end="0" resetval="0x0" description="CPDMA THost Channel 4 Head Descriptor Pointer" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPDMA_SRAM_TH5_HDP_REG" acronym="CPSW_NC_CPDMA_SRAM_TH5_HDP_REG" offset="213556" width="32" description="CPDMA THost Channel 5 Head Descriptor Pointer">
		<bitfield id="TH5_HDP" width="32" begin="31" end="0" resetval="0x0" description="CPDMA THost Channel 5 Head Descriptor Pointer" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPDMA_SRAM_TH6_HDP_REG" acronym="CPSW_NC_CPDMA_SRAM_TH6_HDP_REG" offset="213560" width="32" description="CPDMA THost Channel 6 Head Descriptor Pointer">
		<bitfield id="TH6_HDP" width="32" begin="31" end="0" resetval="0x0" description="CPDMA THost Channel 6 Head Descriptor Pointer" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPDMA_SRAM_TH7_HDP_REG" acronym="CPSW_NC_CPDMA_SRAM_TH7_HDP_REG" offset="213564" width="32" description="CPDMA THost Channel 7 Head Descriptor Pointer">
		<bitfield id="TH7_HDP" width="32" begin="31" end="0" resetval="0x0" description="CPDMA THost Channel 7 Head Descriptor Pointer" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPDMA_SRAM_FH0_CP_REG" acronym="CPSW_NC_CPDMA_SRAM_FH0_CP_REG" offset="213568" width="32" description="CPDMA FHost Channel 0 Completion Pointer">
		<bitfield id="FH0_CP" width="32" begin="31" end="0" resetval="0x0" description="CPDMA FHost Channel 0 Completion Pointer" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPDMA_SRAM_FH1_CP_REG" acronym="CPSW_NC_CPDMA_SRAM_FH1_CP_REG" offset="213572" width="32" description="CPDMA FHost Channel 1 Completion Pointer">
		<bitfield id="FH1_CP" width="32" begin="31" end="0" resetval="0x0" description="CPDMA FHost Channel 1 Completion Pointer" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPDMA_SRAM_FH2_CP_REG" acronym="CPSW_NC_CPDMA_SRAM_FH2_CP_REG" offset="213576" width="32" description="CPDMA FHost Channel 2 Completion Pointer">
		<bitfield id="FH2_CP" width="32" begin="31" end="0" resetval="0x0" description="CPDMA FHost Channel 2 Completion Pointer" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPDMA_SRAM_FH3_CP_REG" acronym="CPSW_NC_CPDMA_SRAM_FH3_CP_REG" offset="213580" width="32" description="CPDMA FHost Channel 3 Completion Pointer">
		<bitfield id="FH3_CP" width="32" begin="31" end="0" resetval="0x0" description="CPDMA FHost Channel 3 Completion Pointer" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPDMA_SRAM_FH4_CP_REG" acronym="CPSW_NC_CPDMA_SRAM_FH4_CP_REG" offset="213584" width="32" description="CPDMA FHost Channel 4 Completion Pointer">
		<bitfield id="FH4_CP" width="32" begin="31" end="0" resetval="0x0" description="CPDMA FHost Channel 4 Completion Pointer" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPDMA_SRAM_FH5_CP_REG" acronym="CPSW_NC_CPDMA_SRAM_FH5_CP_REG" offset="213588" width="32" description="CPDMA FHost Channel 5 Completion Pointer">
		<bitfield id="FH5_CP" width="32" begin="31" end="0" resetval="0x0" description="CPDMA FHost Channel 5 Completion Pointer" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPDMA_SRAM_FH6_CP_REG" acronym="CPSW_NC_CPDMA_SRAM_FH6_CP_REG" offset="213592" width="32" description="CPDMA FHost Channel 6 Completion Pointer">
		<bitfield id="FH6_CP" width="32" begin="31" end="0" resetval="0x0" description="CPDMA FHost Channel 6 Completion Pointer" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPDMA_SRAM_FH7_CP_REG" acronym="CPSW_NC_CPDMA_SRAM_FH7_CP_REG" offset="213596" width="32" description="CPDMA FHost Channel 7 Completion Pointer">
		<bitfield id="FH7_CP" width="32" begin="31" end="0" resetval="0x0" description="CPDMA FHost Channel 7 Completion Pointer" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPDMA_SRAM_TH0_CP_REG" acronym="CPSW_NC_CPDMA_SRAM_TH0_CP_REG" offset="213600" width="32" description="CPDMA THost Channel 0 Completion Pointer">
		<bitfield id="TH0_CP" width="32" begin="31" end="0" resetval="0x0" description="CPDMA THost Channel 0 Completion Pointer" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPDMA_SRAM_TH1_CP_REG" acronym="CPSW_NC_CPDMA_SRAM_TH1_CP_REG" offset="213604" width="32" description="CPDMA THost Channel 1 Completion Pointer">
		<bitfield id="TH1_CP" width="32" begin="31" end="0" resetval="0x0" description="CPDMA THost Channel 1 Completion Pointer" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPDMA_SRAM_TH2_CP_REG" acronym="CPSW_NC_CPDMA_SRAM_TH2_CP_REG" offset="213608" width="32" description="CPDMA THost Channel 2 Completion Pointer">
		<bitfield id="TH2_CP" width="32" begin="31" end="0" resetval="0x0" description="CPDMA THost Channel 2 Completion Pointer" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPDMA_SRAM_TH3_CP_REG" acronym="CPSW_NC_CPDMA_SRAM_TH3_CP_REG" offset="213612" width="32" description="CPDMA THost Channel 3 Completion Pointer">
		<bitfield id="TH3_CP" width="32" begin="31" end="0" resetval="0x0" description="CPDMA THost Channel 3 Completion Pointer" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPDMA_SRAM_TH4_CP_REG" acronym="CPSW_NC_CPDMA_SRAM_TH4_CP_REG" offset="213616" width="32" description="CPDMA THost Channel 4 Completion Pointer">
		<bitfield id="TH4_CP" width="32" begin="31" end="0" resetval="0x0" description="CPDMA THost Channel 4 Completion Pointer" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPDMA_SRAM_TH5_CP_REG" acronym="CPSW_NC_CPDMA_SRAM_TH5_CP_REG" offset="213620" width="32" description="CPDMA THost Channel 5 Completion Pointer">
		<bitfield id="TH5_CP" width="32" begin="31" end="0" resetval="0x0" description="CPDMA THost Channel 5 Completion Pointer" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPDMA_SRAM_TH6_CP_REG" acronym="CPSW_NC_CPDMA_SRAM_TH6_CP_REG" offset="213624" width="32" description="CPDMA THost Channel 6 Completion Pointer">
		<bitfield id="TH6_CP" width="32" begin="31" end="0" resetval="0x0" description="CPDMA THost Channel 6 Completion Pointer" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPDMA_SRAM_TH7_CP_REG" acronym="CPSW_NC_CPDMA_SRAM_TH7_CP_REG" offset="213628" width="32" description="CPDMA THost Channel 7 Completion Pointer">
		<bitfield id="TH7_CP" width="32" begin="31" end="0" resetval="0x0" description="CPDMA THost Channel 7 Completion Pointer" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPDMA_SRAM_TEST_FH0_HDP_REG" acronym="CPSW_NC_CPDMA_SRAM_TEST_FH0_HDP_REG" offset="213760" width="32" description="Test CPDMA FHost Channel 0 Head Descriptor Pointer">
		<bitfield id="TEST_FH0_HDP" width="32" begin="31" end="0" resetval="0x0" description="Test CPDMA FHost Channel 0 Head Descriptor Pointer" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPDMA_SRAM_TEST_FH1_HDP_REG" acronym="CPSW_NC_CPDMA_SRAM_TEST_FH1_HDP_REG" offset="213764" width="32" description="Test CPDMA FHost Channel 1 Head Descriptor Pointer">
		<bitfield id="TEST_FH1_HDP" width="32" begin="31" end="0" resetval="0x0" description="Test CPDMA FHost Channel 1 Head Descriptor Pointer" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPDMA_SRAM_TEST_FH2_HDP_REG" acronym="CPSW_NC_CPDMA_SRAM_TEST_FH2_HDP_REG" offset="213768" width="32" description="Test CPDMA FHost Channel 2 Head Descriptor Pointer">
		<bitfield id="TEST_FH2_HDP" width="32" begin="31" end="0" resetval="0x0" description="Test CPDMA FHost Channel 2 Head Descriptor Pointer" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPDMA_SRAM_TEST_FH3_HDP_REG" acronym="CPSW_NC_CPDMA_SRAM_TEST_FH3_HDP_REG" offset="213772" width="32" description="Test CPDMA FHost Channel 3 Head Descriptor Pointer">
		<bitfield id="TEST_FH3_HDP" width="32" begin="31" end="0" resetval="0x0" description="Test CPDMA FHost Channel 3 Head Descriptor Pointer" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPDMA_SRAM_TEST_FH4_HDP_REG" acronym="CPSW_NC_CPDMA_SRAM_TEST_FH4_HDP_REG" offset="213776" width="32" description="Test CPDMA FHost Channel 4 Head Descriptor Pointer">
		<bitfield id="TEST_FH4_HDP" width="32" begin="31" end="0" resetval="0x0" description="Test CPDMA FHost Channel 4 Head Descriptor Pointer" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPDMA_SRAM_TEST_FH5_HDP_REG" acronym="CPSW_NC_CPDMA_SRAM_TEST_FH5_HDP_REG" offset="213780" width="32" description="Test CPDMA FHost Channel 5 Head Descriptor Pointer">
		<bitfield id="TEST_FH5_HDP" width="32" begin="31" end="0" resetval="0x0" description="Test CPDMA FHost Channel 5 Head Descriptor Pointer" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPDMA_SRAM_TEST_FH6_HDP_REG" acronym="CPSW_NC_CPDMA_SRAM_TEST_FH6_HDP_REG" offset="213784" width="32" description="Test CPDMA FHost Channel 6 Head Descriptor Pointer">
		<bitfield id="TEST_FH6_HDP" width="32" begin="31" end="0" resetval="0x0" description="Test CPDMA FHost Channel 6 Head Descriptor Pointer" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPDMA_SRAM_TEST_FH7_HDP_REG" acronym="CPSW_NC_CPDMA_SRAM_TEST_FH7_HDP_REG" offset="213788" width="32" description="Test CPDMA FHost Channel 7 Head Descriptor Pointer">
		<bitfield id="TEST_FH7_HDP" width="32" begin="31" end="0" resetval="0x0" description="Test CPDMA FHost Channel 7 Head Descriptor Pointer" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPDMA_SRAM_TEST_TH0_HDP_REG" acronym="CPSW_NC_CPDMA_SRAM_TEST_TH0_HDP_REG" offset="213792" width="32" description="Test CPDMA THost Channel 0 Head Descriptor Pointer">
		<bitfield id="TEST_TH0_HDP" width="32" begin="31" end="0" resetval="0x0" description="Test CPDMA THost Channel 0 Head Descriptor Pointer" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPDMA_SRAM_TEST_TH1_HDP_REG" acronym="CPSW_NC_CPDMA_SRAM_TEST_TH1_HDP_REG" offset="213796" width="32" description="Test CPDMA THost Channel 1 Head Descriptor Pointer">
		<bitfield id="TEST_TH1_HDP" width="32" begin="31" end="0" resetval="0x0" description="Test CPDMA THost Channel 1 Head Descriptor Pointer" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPDMA_SRAM_TEST_TH2_HDP_REG" acronym="CPSW_NC_CPDMA_SRAM_TEST_TH2_HDP_REG" offset="213800" width="32" description="Test CPDMA THost Channel 2 Head Descriptor Pointer">
		<bitfield id="TEST_TH2_HDP" width="32" begin="31" end="0" resetval="0x0" description="Test CPDMA THost Channel 2 Head Descriptor Pointer" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPDMA_SRAM_TEST_TH3_HDP_REG" acronym="CPSW_NC_CPDMA_SRAM_TEST_TH3_HDP_REG" offset="213804" width="32" description="Test CPDMA THost Channel 3 Head Descriptor Pointer">
		<bitfield id="TEST_TH3_HDP" width="32" begin="31" end="0" resetval="0x0" description="Test CPDMA THost Channel 3 Head Descriptor Pointer" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPDMA_SRAM_TEST_TH4_HDP_REG" acronym="CPSW_NC_CPDMA_SRAM_TEST_TH4_HDP_REG" offset="213808" width="32" description="Test CPDMA THost Channel 4 Head Descriptor Pointer">
		<bitfield id="TEST_TH4_HDP" width="32" begin="31" end="0" resetval="0x0" description="Test CPDMA THost Channel 4 Head Descriptor Pointer" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPDMA_SRAM_TEST_TH5_HDP_REG" acronym="CPSW_NC_CPDMA_SRAM_TEST_TH5_HDP_REG" offset="213812" width="32" description="Test CPDMA THost Channel 5 Head Descriptor Pointer">
		<bitfield id="TEST_TH5_HDP" width="32" begin="31" end="0" resetval="0x0" description="Test CPDMA THost Channel 5 Head Descriptor Pointer" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPDMA_SRAM_TEST_TH6_HDP_REG" acronym="CPSW_NC_CPDMA_SRAM_TEST_TH6_HDP_REG" offset="213816" width="32" description="Test CPDMA THost Channel 6 Head Descriptor Pointer">
		<bitfield id="TEST_TH6_HDP" width="32" begin="31" end="0" resetval="0x0" description="Test CPDMA THost Channel 6 Head Descriptor Pointer" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPDMA_SRAM_TEST_TH7_HDP_REG" acronym="CPSW_NC_CPDMA_SRAM_TEST_TH7_HDP_REG" offset="213820" width="32" description="Test CPDMA THost Channel 7 Head Descriptor Pointer">
		<bitfield id="TEST_TH7_HDP" width="32" begin="31" end="0" resetval="0x0" description="Test CPDMA THost Channel 7 Head Descriptor Pointer" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPDMA_SRAM_TEST_FH0_CP_REG" acronym="CPSW_NC_CPDMA_SRAM_TEST_FH0_CP_REG" offset="213824" width="32" description="Test CPDMA FHost Channel 0 Completion Pointer">
		<bitfield id="TEST_FH0_CP" width="32" begin="31" end="0" resetval="0x0" description="Test CPDMA FHost Channel 0 Completion Pointer" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPDMA_SRAM_TEST_FH1_CP_REG" acronym="CPSW_NC_CPDMA_SRAM_TEST_FH1_CP_REG" offset="213828" width="32" description="Test CPDMA FHost Channel 1 Completion Pointer">
		<bitfield id="TEST_FH1_CP" width="32" begin="31" end="0" resetval="0x0" description="Test CPDMA FHost Channel 1 Completion Pointer" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPDMA_SRAM_TEST_FH2_CP_REG" acronym="CPSW_NC_CPDMA_SRAM_TEST_FH2_CP_REG" offset="213832" width="32" description="Test CPDMA FHost Channel 2 Completion Pointer">
		<bitfield id="TEST_FH2_CP" width="32" begin="31" end="0" resetval="0x0" description="Test CPDMA FHost Channel 2 Completion Pointer" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPDMA_SRAM_TEST_FH3_CP_REG" acronym="CPSW_NC_CPDMA_SRAM_TEST_FH3_CP_REG" offset="213836" width="32" description="Test CPDMA FHost Channel 3 Completion Pointer">
		<bitfield id="TEST_FH3_CP" width="32" begin="31" end="0" resetval="0x0" description="Test CPDMA FHost Channel 3 Completion Pointer" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPDMA_SRAM_TEST_FH4_CP_REG" acronym="CPSW_NC_CPDMA_SRAM_TEST_FH4_CP_REG" offset="213840" width="32" description="Test CPDMA FHost Channel 4 Completion Pointer">
		<bitfield id="TEST_FH4_CP" width="32" begin="31" end="0" resetval="0x0" description="Test CPDMA FHost Channel 4 Completion Pointer" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPDMA_SRAM_TEST_FH5_CP_REG" acronym="CPSW_NC_CPDMA_SRAM_TEST_FH5_CP_REG" offset="213844" width="32" description="Test CPDMA FHost Channel 5 Completion Pointer">
		<bitfield id="TEST_FH5_CP" width="32" begin="31" end="0" resetval="0x0" description="Test CPDMA FHost Channel 5 Completion Pointer" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPDMA_SRAM_TEST_FH6_CP_REG" acronym="CPSW_NC_CPDMA_SRAM_TEST_FH6_CP_REG" offset="213848" width="32" description="Test CPDMA FHost Channel 6 Completion Pointer">
		<bitfield id="TEST_FH6_CP" width="32" begin="31" end="0" resetval="0x0" description="Test CPDMA FHost Channel 6 Completion Pointer" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPDMA_SRAM_TEST_FH7_CP_REG" acronym="CPSW_NC_CPDMA_SRAM_TEST_FH7_CP_REG" offset="213852" width="32" description="Test CPDMA FHost Channel 7 Completion Pointer">
		<bitfield id="TEST_FH7_CP" width="32" begin="31" end="0" resetval="0x0" description="Test CPDMA FHost Channel 7 Completion Pointer" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPDMA_SRAM_TEST_TH0_CP_REG" acronym="CPSW_NC_CPDMA_SRAM_TEST_TH0_CP_REG" offset="213856" width="32" description="Test CPDMA THost Channel 0 Completion Pointer">
		<bitfield id="TEST_TH0_CP" width="32" begin="31" end="0" resetval="0x0" description="Test CPDMA THost Channel 0 Completion Pointer" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPDMA_SRAM_TEST_TH1_CP_REG" acronym="CPSW_NC_CPDMA_SRAM_TEST_TH1_CP_REG" offset="213860" width="32" description="Test CPDMA THost Channel 1 Completion Pointer">
		<bitfield id="TEST_TH1_CP" width="32" begin="31" end="0" resetval="0x0" description="Test CPDMA THost Channel 1 Completion Pointer" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPDMA_SRAM_TEST_TH2_CP_REG" acronym="CPSW_NC_CPDMA_SRAM_TEST_TH2_CP_REG" offset="213864" width="32" description="Test CPDMA THost Channel 2 Completion Pointer">
		<bitfield id="TEST_TH2_CP" width="32" begin="31" end="0" resetval="0x0" description="Test CPDMA THost Channel 2 Completion Pointer" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPDMA_SRAM_TEST_TH3_CP_REG" acronym="CPSW_NC_CPDMA_SRAM_TEST_TH3_CP_REG" offset="213868" width="32" description="Test CPDMA THost Channel 3 Completion Pointer">
		<bitfield id="TEST_TH3_CP" width="32" begin="31" end="0" resetval="0x0" description="Test CPDMA THost Channel 3 Completion Pointer" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPDMA_SRAM_TEST_TH4_CP_REG" acronym="CPSW_NC_CPDMA_SRAM_TEST_TH4_CP_REG" offset="213872" width="32" description="Test CPDMA THost Channel 4 Completion Pointer">
		<bitfield id="TEST_TH4_CP" width="32" begin="31" end="0" resetval="0x0" description="Test CPDMA THost Channel 4 Completion Pointer" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPDMA_SRAM_TEST_TH5_CP_REG" acronym="CPSW_NC_CPDMA_SRAM_TEST_TH5_CP_REG" offset="213876" width="32" description="Test CPDMA THost Channel 5 Completion Pointer">
		<bitfield id="TEST_TH5_CP" width="32" begin="31" end="0" resetval="0x0" description="Test CPDMA THost Channel 5 Completion Pointer" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPDMA_SRAM_TEST_TH6_CP_REG" acronym="CPSW_NC_CPDMA_SRAM_TEST_TH6_CP_REG" offset="213880" width="32" description="Test CPDMA THost Channel 6 Completion Pointer">
		<bitfield id="TEST_TH6_CP" width="32" begin="31" end="0" resetval="0x0" description="Test CPDMA THost Channel 6 Completion Pointer" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPDMA_SRAM_TEST_TH7_CP_REG" acronym="CPSW_NC_CPDMA_SRAM_TEST_TH7_CP_REG" offset="213884" width="32" description="Test CPDMA THost Channel 7 Completion Pointer">
		<bitfield id="TEST_TH7_CP" width="32" begin="31" end="0" resetval="0x0" description="Test CPDMA THost Channel 7 Completion Pointer" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_STAT_RXGOODFRAMES_j" acronym="CPSW_NC_STAT_RXGOODFRAMES_j" offset="237568" width="32" description="Total number of good frames received">
		<bitfield id="COUNT" width="32" begin="31" end="0" resetval="0x0" description="Total number of good frames received" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_STAT_RXBROADCASTFRAMES_j" acronym="CPSW_NC_STAT_RXBROADCASTFRAMES_j" offset="237572" width="32" description="Total number of good broadcast frames received">
		<bitfield id="COUNT" width="32" begin="31" end="0" resetval="0x0" description="Total number of good broadcast frames received" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_STAT_RXMULTICASTFRAMES_j" acronym="CPSW_NC_STAT_RXMULTICASTFRAMES_j" offset="237576" width="32" description="Total number of good multicast frames received">
		<bitfield id="COUNT" width="32" begin="31" end="0" resetval="0x0" description="Total number of good multicast frames received" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_STAT_RXPAUSEFRAMES_j" acronym="CPSW_NC_STAT_RXPAUSEFRAMES_j" offset="237580" width="32" description="Total number of pause frames received">
		<bitfield id="COUNT" width="32" begin="31" end="0" resetval="0x0" description="Total number of pause frames received" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_STAT_RXCRCERRORS_j" acronym="CPSW_NC_STAT_RXCRCERRORS_j" offset="237584" width="32" description="Total number of CRC errors frames received">
		<bitfield id="COUNT" width="32" begin="31" end="0" resetval="0x0" description="Total number of CRC errors frames received" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_STAT_RXALIGNCODEERRORS_j" acronym="CPSW_NC_STAT_RXALIGNCODEERRORS_j" offset="237588" width="32" description="Total number of alignment/code errors received">
		<bitfield id="COUNT" width="32" begin="31" end="0" resetval="0x0" description="Total number of alignment/code errors received" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_STAT_RXOVERSIZEDFRAMES_j" acronym="CPSW_NC_STAT_RXOVERSIZEDFRAMES_j" offset="237592" width="32" description="Total number of oversized frames received">
		<bitfield id="COUNT" width="32" begin="31" end="0" resetval="0x0" description="Total number of oversized frames received" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_STAT_RXJABBERFRAMES_j" acronym="CPSW_NC_STAT_RXJABBERFRAMES_j" offset="237596" width="32" description="Total number of jabber frames received">
		<bitfield id="COUNT" width="32" begin="31" end="0" resetval="0x0" description="Total number of jabber frames received" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_STAT_RXUNDERSIZEDFRAMES_j" acronym="CPSW_NC_STAT_RXUNDERSIZEDFRAMES_j" offset="237600" width="32" description="Total number of undersized frames received">
		<bitfield id="COUNT" width="32" begin="31" end="0" resetval="0x0" description="Total number of undersized frames received" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_STAT_RXFRAGMENTS_j" acronym="CPSW_NC_STAT_RXFRAGMENTS_j" offset="237604" width="32" description="Total number of fragmented frames received">
