ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263X/CPSW_CPSW_52800000h.xml
		<bitfield id="COUNT" width="32" begin="31" end="0" resetval="0x0" description="Total number of fragmented frames received" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_STAT_ALE_DROP_j" acronym="CPSW_NC_STAT_ALE_DROP_j" offset="237608" width="32" description="Total number of frames dropped by the ALE">
		<bitfield id="COUNT" width="32" begin="31" end="0" resetval="0x0" description="Total number of frames dropped by the ALE" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_STAT_ALE_OVERRUN_DROP_j" acronym="CPSW_NC_STAT_ALE_OVERRUN_DROP_j" offset="237612" width="32" description="Total number of overrun frames dropped by the ALE">
		<bitfield id="COUNT" width="32" begin="31" end="0" resetval="0x0" description="Total number of overrun frames dropped by the ALE" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_STAT_RXOCTETS_j" acronym="CPSW_NC_STAT_RXOCTETS_j" offset="237616" width="32" description="Total number of received bytes in good frames">
		<bitfield id="COUNT" width="32" begin="31" end="0" resetval="0x0" description="Total number of received bytes in good frames" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_STAT_TXGOODFRAMES_j" acronym="CPSW_NC_STAT_TXGOODFRAMES_j" offset="237620" width="32" description="Total number of good frames transmitted">
		<bitfield id="COUNT" width="32" begin="31" end="0" resetval="0x0" description="Total number of good frames transmitted" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_STAT_TXBROADCASTFRAMES_j" acronym="CPSW_NC_STAT_TXBROADCASTFRAMES_j" offset="237624" width="32" description="Total number of good broadcast frames transmitted">
		<bitfield id="COUNT" width="32" begin="31" end="0" resetval="0x0" description="Total number of good broadcast frames transmitted" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_STAT_TXMULTICASTFRAMES_j" acronym="CPSW_NC_STAT_TXMULTICASTFRAMES_j" offset="237628" width="32" description="Total number of good multicast frames transmitted">
		<bitfield id="COUNT" width="32" begin="31" end="0" resetval="0x0" description="Total number of good multicast frames transmitted" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_STAT_TXPAUSEFRAMES_j" acronym="CPSW_NC_STAT_TXPAUSEFRAMES_j" offset="237632" width="32" description="Total number of pause frames transmitted">
		<bitfield id="COUNT" width="32" begin="31" end="0" resetval="0x0" description="Total number of pause frames transmitted" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_STAT_TXDEFERREDFRAMES_j" acronym="CPSW_NC_STAT_TXDEFERREDFRAMES_j" offset="237636" width="32" description="Total number of deferred frames transmitted">
		<bitfield id="COUNT" width="32" begin="31" end="0" resetval="0x0" description="Total number of deferred frames transmitted" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_STAT_TXCOLLISIONFRAMES_j" acronym="CPSW_NC_STAT_TXCOLLISIONFRAMES_j" offset="237640" width="32" description="Total number of transmitted frames experiencing a collision">
		<bitfield id="COUNT" width="32" begin="31" end="0" resetval="0x0" description="Total number of transmitted frames experiencing a collision" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_STAT_TXSINGLECOLLFRAMES_j" acronym="CPSW_NC_STAT_TXSINGLECOLLFRAMES_j" offset="237644" width="32" description="Total number of transmitted frames experiencing a single collision">
		<bitfield id="COUNT" width="32" begin="31" end="0" resetval="0x0" description="Total number of transmitted frames experiencing a single collision" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_STAT_TXMULTCOLLFRAMES_j" acronym="CPSW_NC_STAT_TXMULTCOLLFRAMES_j" offset="237648" width="32" description="Total number of transmitted frames experiencing multiple collisions">
		<bitfield id="COUNT" width="32" begin="31" end="0" resetval="0x0" description="Total number of transmitted frames experiencing multiple collisions" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_STAT_TXEXCESSIVECOLLISIONS_j" acronym="CPSW_NC_STAT_TXEXCESSIVECOLLISIONS_j" offset="237652" width="32" description="Total number of transmitted frames abandoned due to excessive collisions">
		<bitfield id="COUNT" width="32" begin="31" end="0" resetval="0x0" description="Total number of transmitted frames abandoned due to excessive collisions" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_STAT_TXLATECOLLISIONS_j" acronym="CPSW_NC_STAT_TXLATECOLLISIONS_j" offset="237656" width="32" description="Total number of transmitted frames abandoned due to a late collision">
		<bitfield id="COUNT" width="32" begin="31" end="0" resetval="0x0" description="Total number of transmitted frames abandoned due to a late collision" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_STAT_RXIPGERROR_j" acronym="CPSW_NC_STAT_RXIPGERROR_j" offset="237660" width="32" description="Total number of receive inter-packet gap errors (10G only)">
		<bitfield id="COUNT" width="32" begin="31" end="0" resetval="0x0" description="Total number of receive inter-packet gap errors (10G only)" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_STAT_TXCARRIERSENSEERRORS_j" acronym="CPSW_NC_STAT_TXCARRIERSENSEERRORS_j" offset="237664" width="32" description="Total number of transmitted frames that experienced a carrier loss">
		<bitfield id="COUNT" width="32" begin="31" end="0" resetval="0x0" description="Total number of transmitted frames that experienced a carrier loss" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_STAT_TXOCTETS_j" acronym="CPSW_NC_STAT_TXOCTETS_j" offset="237668" width="32" description="Total number of bytes in all good frames transmitted">
		<bitfield id="COUNT" width="32" begin="31" end="0" resetval="0x0" description="Total number of bytes in all good frames transmitted" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_STAT_OCTETFRAMES64_j" acronym="CPSW_NC_STAT_OCTETFRAMES64_j" offset="237672" width="32" description="Total number of 64-byte frames received and transmitted">
		<bitfield id="COUNT" width="32" begin="31" end="0" resetval="0x0" description="Total number of 64-byte frames received and transmitted" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_STAT_OCTETFRAMES65T127_j" acronym="CPSW_NC_STAT_OCTETFRAMES65T127_j" offset="237676" width="32" description="Total number of frames of size 65 to 127 bytes received and transmitted">
		<bitfield id="COUNT" width="32" begin="31" end="0" resetval="0x0" description="Total number of frames of size 65 to 127 bytes received and transmitted" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_STAT_OCTETFRAMES128T255_j" acronym="CPSW_NC_STAT_OCTETFRAMES128T255_j" offset="237680" width="32" description="Total number of frames of size 128 to 255 bytes received and transmitted">
		<bitfield id="COUNT" width="32" begin="31" end="0" resetval="0x0" description="Total number of frames of size 128 to 255 bytes received and transmitted" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_STAT_OCTETFRAMES256T511_j" acronym="CPSW_NC_STAT_OCTETFRAMES256T511_j" offset="237684" width="32" description="Total number of frames of size 256 to 511 bytes received and transmitted">
		<bitfield id="COUNT" width="32" begin="31" end="0" resetval="0x0" description="Total number of frames of size 256 to 511 bytes received and transmitted" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_STAT_OCTETFRAMES512T1023_j" acronym="CPSW_NC_STAT_OCTETFRAMES512T1023_j" offset="237688" width="32" description="Total number of frames of size 512 to 1023 bytes received and transmitted">
		<bitfield id="COUNT" width="32" begin="31" end="0" resetval="0x0" description="Total number of frames of size 512 to 1023 bytes received and transmitted" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_STAT_OCTETFRAMES1024TUP_j" acronym="CPSW_NC_STAT_OCTETFRAMES1024TUP_j" offset="237692" width="32" description="Total number of frames of size 1024 to rx_maxlen bytes received and 1024 bytes or greater transmitted">
		<bitfield id="COUNT" width="32" begin="31" end="0" resetval="0x0" description="Total number of frames of size 1024 to rx_maxlen bytes received and 1024 bytes or greater transmitted" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_STAT_NETOCTETS_j" acronym="CPSW_NC_STAT_NETOCTETS_j" offset="237696" width="32" description="Total number of bytes received and transmitted">
		<bitfield id="COUNT" width="32" begin="31" end="0" resetval="0x0" description="Total number of bytes received and transmitted" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_STAT_RX_BOTTOM_OF_FIFO_DROP_j" acronym="CPSW_NC_STAT_RX_BOTTOM_OF_FIFO_DROP_j" offset="237700" width="32" description="Receive Bottom of FIFO Drop">
		<bitfield id="COUNT" width="32" begin="31" end="0" resetval="0x0" description="Receive Bottom of FIFO Drop" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_STAT_PORTMASK_DROP_j" acronym="CPSW_NC_STAT_PORTMASK_DROP_j" offset="237704" width="32" description="Total number of dropped frames received due to portmask">
		<bitfield id="COUNT" width="32" begin="31" end="0" resetval="0x0" description="Total number of dropped frames received due to portmask" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_STAT_RX_TOP_OF_FIFO_DROP_j" acronym="CPSW_NC_STAT_RX_TOP_OF_FIFO_DROP_j" offset="237708" width="32" description="Receive Top of FIFO Drop">
		<bitfield id="COUNT" width="32" begin="31" end="0" resetval="0x0" description="Receive Top of FIFO Drop" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_STAT_ALE_RATE_LIMIT_DROP_j" acronym="CPSW_NC_STAT_ALE_RATE_LIMIT_DROP_j" offset="237712" width="32" description="Total number of dropped frames due to ALE Rate Limiting">
		<bitfield id="COUNT" width="32" begin="31" end="0" resetval="0x0" description="Total number of dropped frames due to ALE Rate Limiting" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_STAT_ALE_VID_INGRESS_DROP_j" acronym="CPSW_NC_STAT_ALE_VID_INGRESS_DROP_j" offset="237716" width="32" description="Total number of dropped frames due to ALE VID Ingress">
		<bitfield id="COUNT" width="32" begin="31" end="0" resetval="0x0" description="Total number of dropped frames due to ALE VID Ingress" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_STAT_ALE_DA_EQ_SA_DROP_j" acronym="CPSW_NC_STAT_ALE_DA_EQ_SA_DROP_j" offset="237720" width="32" description="Total number of dropped frames due to DA=SA">
		<bitfield id="COUNT" width="32" begin="31" end="0" resetval="0x0" description="Total number of dropped frames due to DA=SA" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_STAT_ALE_BLOCK_DROP_j" acronym="CPSW_NC_STAT_ALE_BLOCK_DROP_j" offset="237724" width="32" description="Total number of dropped frames due to ALE Block Mode">
		<bitfield id="COUNT" width="32" begin="31" end="0" resetval="0x0" description="Total number of dropped frames due to ALE Block Mode" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_STAT_ALE_SECURE_DROP_j" acronym="CPSW_NC_STAT_ALE_SECURE_DROP_j" offset="237728" width="32" description="Total number of dropped frames due to ALE Secure Mode">
		<bitfield id="COUNT" width="32" begin="31" end="0" resetval="0x0" description="Total number of dropped frames due to ALE Secure Mode" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_STAT_ALE_AUTH_DROP_j" acronym="CPSW_NC_STAT_ALE_AUTH_DROP_j" offset="237732" width="32" description="Total number of dropped frames due to ALE Authentication">
		<bitfield id="COUNT" width="32" begin="31" end="0" resetval="0x0" description="Total number of dropped frames due to ALE Authentication" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_STAT_ALE_UNKN_UNI_j" acronym="CPSW_NC_STAT_ALE_UNKN_UNI_j" offset="237736" width="32" description="ALE Receive Unknown Unicast">
		<bitfield id="COUNT" width="32" begin="31" end="0" resetval="0x0" description="ALE Receive Unknown Unicast" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_STAT_ALE_UNKN_UNI_BCNT_j" acronym="CPSW_NC_STAT_ALE_UNKN_UNI_BCNT_j" offset="237740" width="32" description="ALE Receive Unknown Unicast Bytecount">
		<bitfield id="COUNT" width="32" begin="31" end="0" resetval="0x0" description="ALE Receive Unknown Unicast Bytecount" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_STAT_ALE_UNKN_MLT_j" acronym="CPSW_NC_STAT_ALE_UNKN_MLT_j" offset="237744" width="32" description="ALE Receive Unknown Multicast">
		<bitfield id="COUNT" width="32" begin="31" end="0" resetval="0x0" description="ALE Receive Unknown Multicast" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_STAT_ALE_UNKN_MLT_BCNT_j" acronym="CPSW_NC_STAT_ALE_UNKN_MLT_BCNT_j" offset="237748" width="32" description="ALE Receive Unknown Multicast Bytecount">
		<bitfield id="COUNT" width="32" begin="31" end="0" resetval="0x0" description="ALE Receive Unknown Multicast Bytecount" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_STAT_ALE_UNKN_BRD_j" acronym="CPSW_NC_STAT_ALE_UNKN_BRD_j" offset="237752" width="32" description="ALE Receive Unknown Broadcast">
		<bitfield id="COUNT" width="32" begin="31" end="0" resetval="0x0" description="ALE Receive Unknown Broadcast" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_STAT_ALE_UNKN_BRD_BCNT_j" acronym="CPSW_NC_STAT_ALE_UNKN_BRD_BCNT_j" offset="237756" width="32" description="ALE Receive Unknown Broadcast Bytecount">
		<bitfield id="COUNT" width="32" begin="31" end="0" resetval="0x0" description="ALE Receive Unknown Broadcast Bytecount" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_STAT_ALE_POL_MATCH_j" acronym="CPSW_NC_STAT_ALE_POL_MATCH_j" offset="237760" width="32" description="ALE Policer Matched">
		<bitfield id="COUNT" width="32" begin="31" end="0" resetval="0x0" description="ALE Policer Matched" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_STAT_ALE_POL_MATCH_RED_j" acronym="CPSW_NC_STAT_ALE_POL_MATCH_RED_j" offset="237764" width="32" description="ALE Policer Matched and Condition Red">
		<bitfield id="COUNT" width="32" begin="31" end="0" resetval="0x0" description="ALE Policer Matched and Condition Red" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_STAT_ALE_POL_MATCH_YELLOW_j" acronym="CPSW_NC_STAT_ALE_POL_MATCH_YELLOW_j" offset="237768" width="32" description="ALE Policer Matched and Condition Yellow">
		<bitfield id="COUNT" width="32" begin="31" end="0" resetval="0x0" description="ALE Policer Matched and Condition Yellow" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_STAT_ALE_MULT_SA_DROP_j" acronym="CPSW_NC_STAT_ALE_MULT_SA_DROP_j" offset="237772" width="32" description="ALE Multicast Source Address Drop">
		<bitfield id="COUNT" width="32" begin="31" end="0" resetval="0x0" description="ALE Multicast Source Address drop" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_STAT_ALE_DUAL_VLAN_DROP_j" acronym="CPSW_NC_STAT_ALE_DUAL_VLAN_DROP_j" offset="237776" width="32" description="ALE Dual VLAN Drop">
		<bitfield id="COUNT" width="32" begin="31" end="0" resetval="0x0" description="ALE Dual VLAN drop" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_STAT_ALE_LEN_ERROR_DROP_j" acronym="CPSW_NC_STAT_ALE_LEN_ERROR_DROP_j" offset="237780" width="32" description="ALE Length Error Drop">
		<bitfield id="COUNT" width="32" begin="31" end="0" resetval="0x0" description="ALE Length Error drop" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_STAT_ALE_IP_NEXT_HDR_DROP_j" acronym="CPSW_NC_STAT_ALE_IP_NEXT_HDR_DROP_j" offset="237784" width="32" description="ALE IP Next Header Drop">
		<bitfield id="COUNT" width="32" begin="31" end="0" resetval="0x0" description="ALE Next Header drop" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_STAT_ALE_IPV4_FRAG_DROP_j" acronym="CPSW_NC_STAT_ALE_IPV4_FRAG_DROP_j" offset="237788" width="32" description="ALE IPV4 Frag Drop">
		<bitfield id="COUNT" width="32" begin="31" end="0" resetval="0x0" description="ALE IPV4 Fragment drop" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_STAT_TX_MEMORY_PROTECT_ERROR_j" acronym="CPSW_NC_STAT_TX_MEMORY_PROTECT_ERROR_j" offset="237948" width="32" description="Transmit Memory Protect CRC Error">
		<bitfield id="COUNT" width="8" begin="7" end="0" resetval="0x0" description="Transmit Memory Protect CRC Error" range="7:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_STAT_ENET_PN_TX_PRI_REG_j_k" acronym="CPSW_NC_STAT_ENET_PN_TX_PRI_REG_j_k" offset="237952" width="32" description="ENET Port n PRIORITY N Packet Count">
		<bitfield id="PN_TX_PRIN" width="32" begin="31" end="0" resetval="0x0" description="ENET TX Priority Packet Count" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_STAT_ENET_PN_TX_PRI_BCNT_REG_j_k" acronym="CPSW_NC_STAT_ENET_PN_TX_PRI_BCNT_REG_j_k" offset="237984" width="32" description="ENET Port n PRIORITY N Packet Byte Count">
		<bitfield id="PN_TX_PRIN_BCNT" width="32" begin="31" end="0" resetval="0x0" description="ENET Port n PRIORITY N Packet Byte Count" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_STAT_ENET_PN_TX_PRI_DROP_REG_j_k" acronym="CPSW_NC_STAT_ENET_PN_TX_PRI_DROP_REG_j_k" offset="238016" width="32" description="ENET Port n PRIORITY N Packet Drop Count">
		<bitfield id="PN_TX_PRIN_DROP" width="32" begin="31" end="0" resetval="0x0" description="ENET Port n PRIORITY N Packet Drop Count" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_STAT_ENET_PN_TX_PRI_DROP_BCNT_REG_j_k" acronym="CPSW_NC_STAT_ENET_PN_TX_PRI_DROP_BCNT_REG_j_k" offset="238048" width="32" description="ENET Port n PRIORITY N Packet Drop Byte Count">
		<bitfield id="PN_TX_PRIN_DROP_BCNT" width="32" begin="31" end="0" resetval="0x0" description="ENET Port n PRIORITY N Packet Drop Byte Count" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPTS_IDVER_REG" acronym="CPSW_NC_CPTS_IDVER_REG" offset="249856" width="32" description="Identification and Version Register">
		<bitfield id="IDENT" width="16" begin="31" end="16" resetval="0x20106" description="Identification value" range="31:16" rwaccess="R"/>
	<bitfield id="RTL_VER" width="5" begin="15" end="11" resetval="0x0" description="RTL version value" range="15:11" rwaccess="R"/>
	<bitfield id="MAJOR_VER" width="3" begin="10" end="8" resetval="0x1" description="Major version value" range="10:8" rwaccess="R"/>
	<bitfield id="MINOR_VER" width="8" begin="7" end="0" resetval="0x13" description="Minor version value" range="7:0" rwaccess="R"/>
	</register><register id="CPSW_NC_CPTS_CONTROL_REG" acronym="CPSW_NC_CPTS_CONTROL_REG" offset="249860" width="32" description="Time Sync Control Register">
		<bitfield id="TS_SYNC_SEL" width="4" begin="31" end="28" resetval="0x0" description="TS_SYNC output timestamp counter bit select -    0000 - TS_SYNC disabled.   0001 - TS_SYNC is timestamp counter bit 17   0010 - TS_SYNC is timestamp counter bit 18   ...    1110 - TS_SYNC is timestamp counter bit 30   1111 - TS_SYNC is timestamp counter bit 31" range="31:28" rwaccess="R/W"/>
	<bitfield id="TS_GENF_CLR_EN" width="1" begin="17" end="17" resetval="0x0" description="GENF (and ESTF) Clear Enable -    0 - A TS_GENFn output is not cleared when the associated ts_genf_length[31:0] is cleared to zero.   1 - A TS_GENFn output is cleared when the associated ts_genf_length[31:0] is cleared to zero." range="17" rwaccess="R/W"/>
	<bitfield id="TS_RX_NO_EVENT" width="1" begin="16" end="16" resetval="0x0" description="Timestamp Ethernet Receive produces no events -    0 - Ethernet receive timesync events enabled.   1 - Ethernet receive timesync events disabled." range="16" rwaccess="R/W"/>
	<bitfield id="HW8_TS_PUSH_EN" width="1" begin="15" end="15" resetval="0x0" description="Hardware push 8 enable" range="15" rwaccess="R/W"/>
	<bitfield id="HW7_TS_PUSH_EN" width="1" begin="14" end="14" resetval="0x0" description="Hardware push 7 enable" range="14" rwaccess="R/W"/>
	<bitfield id="HW6_TS_PUSH_EN" width="1" begin="13" end="13" resetval="0x0" description="Hardware push 6 enable" range="13" rwaccess="R/W"/>
	<bitfield id="HW5_TS_PUSH_EN" width="1" begin="12" end="12" resetval="0x0" description="Hardware push 5 enable" range="12" rwaccess="R/W"/>
	<bitfield id="HW4_TS_PUSH_EN" width="1" begin="11" end="11" resetval="0x0" description="Hardware push 4 enable" range="11" rwaccess="R/W"/>
	<bitfield id="HW3_TS_PUSH_EN" width="1" begin="10" end="10" resetval="0x0" description="Hardware push 3 enable" range="10" rwaccess="R/W"/>
	<bitfield id="HW2_TS_PUSH_EN" width="1" begin="9" end="9" resetval="0x0" description="Hardware push 2 enable" range="9" rwaccess="R/W"/>
	<bitfield id="HW1_TS_PUSH_EN" width="1" begin="8" end="8" resetval="0x0" description="Hardware push 1 enable" range="8" rwaccess="R/W"/>
	<bitfield id="TS_PPM_DIR" width="1" begin="7" end="7" resetval="0x0" description="PPM Correction Direction -    0 - Increase the time_stamp[63:0] value by the PPM value.   1 - Decrease the time_stamp[63:0] value by the PPM value." range="7" rwaccess="R/W"/>
	<bitfield id="TS_COMP_TOG" width="1" begin="6" end="6" resetval="0x0" description="Timestamp Compare Toggle mode -    0 - TS_COMP is in non-toggle mode.   1 - TS_COMP is in toggle mode." range="6" rwaccess="R/W"/>
	<bitfield id="MODE" width="1" begin="5" end="5" resetval="0x0" description="64-Bit Mode -    0 - The timestamp is 32-bits with the upper 32-bits forced to zero.       1 - The timestamp is 64-bits." range="5" rwaccess="R/W"/>
	<bitfield id="SEQUENCE_EN" width="1" begin="4" end="4" resetval="0x0" description="Sequence Enable -    0 - The timestamp value increments with the selected RFTCLK (normal operation).   1 - The timestamp for received packets is the sequence number of the received packet (first packet is 1, second packet is 2, etc). This can be used for test purposes." range="4" rwaccess="R/W"/>
	<bitfield id="TSTAMP_EN" width="1" begin="3" end="3" resetval="0x0" description="Host Receive Timestamp Enable -    0 - Timestamps are disabled on received packets to host.   1 - Timestamps enabled on received packets to host (cpts_en must be set)." range="3" rwaccess="R/W"/>
	<bitfield id="TS_COMP_POLARITY" width="1" begin="2" end="2" resetval="0x1" description="TS_COMP Polarity    0 - TS_COMP is asserted low   1 - TS_COMP is asserted high" range="2" rwaccess="R/W"/>
	<bitfield id="INT_TEST" width="1" begin="1" end="1" resetval="0x0" description="Interrupt Test - When set, this bit allows the raw interrupt to be written to facilitate interrupt test." range="1" rwaccess="R/W"/>
	<bitfield id="CPTS_EN" width="1" begin="0" end="0" resetval="0x0" description="Time Sync Enable - When disabled (cleared to zero), the CPTS RCLK domain is held in reset." range="0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPTS_RFTCLK_SEL_REG" acronym="CPSW_NC_CPTS_RFTCLK_SEL_REG" offset="249864" width="32" description="RFTCLK Select Register">
		<bitfield id="RFTCLK_SEL" width="5" begin="4" end="0" resetval="0x0" description="Reference Clock Select - This signal is used to control an external multiplexor that selects one of up to 32 clocks for time sync reference (RFTCLK).  This rftclk_sel value can be written only when the cpts_en bit and the tstamp_en bit are cleared to zero in the TS_Control register." range="4:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPTS_TS_PUSH_REG" acronym="CPSW_NC_CPTS_TS_PUSH_REG" offset="249868" width="32" description="Time Stamp Event Push Register">
