ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263X/CPSW_CPSW_52800000h.xml
		<bitfield id="TS_PUSH" width="1" begin="0" end="0" resetval="0x0" description="Time stamp event push - When a logic high is written to this bit a time stamp event is pushed onto the event FIFO.  The time stamp value is the time of the write of this register, not the time of the event read.  The time stamp value can then be read on interrupt via the event registers.  Software should not push a second time stamp event onto the event FIFO until the first time stamp value has been read from the event FIFO (there should be only one time stamp event in the event FIFO at any given time).  This bit is write only and always reads zero." range="0" rwaccess="W"/>
	</register><register id="CPSW_NC_CPTS_TS_LOAD_VAL_REG" acronym="CPSW_NC_CPTS_TS_LOAD_VAL_REG" offset="249872" width="32" description="Time Stamp Load Low Value Register">
		<bitfield id="TS_LOAD_VAL" width="32" begin="31" end="0" resetval="0x0" description="Time Stamp Load Low Value - Writing the ts_load_en bit causes ts_load[63:0] to be written into the time stamp.  The time stamp value is read by initiating a time stamp push event, not by reading this register.  When reading this register, the value read is not the time stamp, but is the value that was last written to this register.  " range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPTS_TS_LOAD_EN_REG" acronym="CPSW_NC_CPTS_TS_LOAD_EN_REG" offset="249876" width="32" description="Time Stamp Load Enable Register">
		<bitfield id="TS_LOAD_EN" width="1" begin="0" end="0" resetval="0x0" description="Time Stamp Load - Writing a one to this bit enables the time stamp value to be written with the value in ts_load[63:0].  This bit is write only and will be cleared by the hardware after one clock. The upper 32-bits of the timestamp are forced to zero in 32-bit mode." range="0" rwaccess="W"/>
	</register><register id="CPSW_NC_CPTS_TS_COMP_VAL_REG" acronym="CPSW_NC_CPTS_TS_COMP_VAL_REG" offset="249880" width="32" description="Time Stamp Comparison Low Value Register">
		<bitfield id="TS_COMP_VAL" width="32" begin="31" end="0" resetval="0x0" description="Time Stamp Comparison Low Value - Writing a non-zero value to the TS_Comp_Length[31:0] register causes a pulse of TS_Comp_Length RCLK periods on the TS_COMP output and a comparison event when the time_stamp counter value is equivalent to  ts_comp_val.  " range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPTS_TS_COMP_LEN_REG" acronym="CPSW_NC_CPTS_TS_COMP_LEN_REG" offset="249884" width="32" description="Time Stamp Comparison Length Register">
		<bitfield id="TS_COMP_LENGTH" width="32" begin="31" end="0" resetval="0x0" description="Time Stamp Comparison Length - Writing a non-zero value to this field enables the time stamp comparison event and output.  This value should be zero when the TS_Comp_Low and TS_Comp_High registers are written.  " range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPTS_INTSTAT_RAW_REG" acronym="CPSW_NC_CPTS_INTSTAT_RAW_REG" offset="249888" width="32" description="Interrupt Status Register Raw">
		<bitfield id="TS_PEND_RAW" width="1" begin="0" end="0" resetval="0x0" description="TS_PEND_RAW int read (before enable).  Writable when int_test = 1 A one in this bit indicates that there are one or more events in the event FIFO." range="0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPTS_INTSTAT_MASKED_REG" acronym="CPSW_NC_CPTS_INTSTAT_MASKED_REG" offset="249892" width="32" description="Interrupt Status Register Masked">
		<bitfield id="TS_PEND" width="1" begin="0" end="0" resetval="0x0" description="TS_PEND masked interrupt read (after enable)" range="0" rwaccess="R"/>
	</register><register id="CPSW_NC_CPTS_INT_ENABLE_REG" acronym="CPSW_NC_CPTS_INT_ENABLE_REG" offset="249896" width="32" description="Interrupt Enable Register">
		<bitfield id="TS_PEND_EN" width="1" begin="0" end="0" resetval="0x0" description="TS_PEND masked interrupt enable" range="0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPTS_TS_COMP_NUDGE_REG" acronym="CPSW_NC_CPTS_TS_COMP_NUDGE_REG" offset="249900" width="32" description="Time Stamp Comparison Nudge Register">
		<bitfield id="NUDGE" width="8" begin="7" end="0" resetval="0x0" description="Timestamp Comparison Nudge Value - This two's complement number is added to the ts_comp_length[31:0] value to increase or decrease the TS_COMP length by the ts_comp_nudge amount.  Only a single high or low time is adjusted and the ts_comp_nudge value is cleared to zero when the nudge has occurred.  " range="7:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPTS_EVENT_POP_REG" acronym="CPSW_NC_CPTS_EVENT_POP_REG" offset="249904" width="32" description="Event Pop Register">
		<bitfield id="EVENT_POP" width="1" begin="0" end="0" resetval="0x0" description="Event Pop - When a logic high is written to this bit an event is popped off the event FIFO.  The event FIFO pop occurs as part of the interrupt process after the event has been read from the Event_0-3 registers.  Popping an event discards the event and causes the next event, if any, to be moved to the top of the FIFO ready to be read by software on interrupt." range="0" rwaccess="W"/>
	</register><register id="CPSW_NC_CPTS_EVENT_0_REG" acronym="CPSW_NC_CPTS_EVENT_0_REG" offset="249908" width="32" description="Event 0 Register">
		<bitfield id="TIME_STAMP" width="32" begin="31" end="0" resetval="0x0" description="Time Stamp lower 32-bits - The timestamp is valid for transmit, receive, and time stamp push event types.  The timestamp value is not valid for counter roll event types." range="31:0" rwaccess="R"/>
	</register><register id="CPSW_NC_CPTS_EVENT_1_REG" acronym="CPSW_NC_CPTS_EVENT_1_REG" offset="249912" width="32" description="Event 1 Register">
		<bitfield id="PREMPT_QUEUE" width="1" begin="29" end="29" resetval="0x0" description="Prempt Queue (iet_incl = 1) -    0 - The packet was received/transmitted on the express queue.   1 - The packet was received/transmitted on the prempt queue." range="29" rwaccess="R"/>
	<bitfield id="PORT_NUMBER" width="5" begin="28" end="24" resetval="0x0" description="Port Number - indicates the port number (encoded) of an Ethernet event or the encoded hardware timestamp number." range="28:24" rwaccess="R"/>
	<bitfield id="EVENT_TYPE" width="4" begin="23" end="20" resetval="0x0" description="Time Sync Event Type -    0000 - Time Stamp Push Event   0001 - Time Stamp Rollover Event   0010 - Time Stamp Half Rollover Event   0011 - Hardware Time Stamp Push Event   0100 - Ethernet Receive Event   0101 - Ethernet Transmit Event   0110 - Time Stamp Compare Event   0111 - Host Transmit Event   1000 - reserved   ...   1111 - reserved" range="23:20" rwaccess="R"/>
	<bitfield id="MESSAGE_TYPE" width="4" begin="19" end="16" resetval="0x0" description="Message type - The message type value that was contained in an Ethernet transmit or receive time sync packet.  This field is valid only for Ethernet transmit or receive events." range="19:16" rwaccess="R"/>
	<bitfield id="SEQUENCE_ID" width="16" begin="15" end="0" resetval="0x0" description="Sequence ID - The 16-bit sequence id is the value that was contained in an Ethernet transmit or receive time sync packet.  This field is valid only for Ethernet transmit or receive events." range="15:0" rwaccess="R"/>
	</register><register id="CPSW_NC_CPTS_EVENT_2_REG" acronym="CPSW_NC_CPTS_EVENT_2_REG" offset="249916" width="32" description="Event 2 Register">
		<bitfield id="DOMAIN" width="8" begin="7" end="0" resetval="0x0" description="Domain - The 8-bit domain is the value that was contained in an Ethernet transmit or receive time sync packet.  This field is valid only for Ethernet transmit or receive events." range="7:0" rwaccess="R"/>
	</register><register id="CPSW_NC_CPTS_EVENT_3_REG" acronym="CPSW_NC_CPTS_EVENT_3_REG" offset="249920" width="32" description="Event 3 Register">
		<bitfield id="TIME_STAMP" width="32" begin="31" end="0" resetval="0x0" description="Time Stamp - The timestamp upper 32-bits are valid for transmit, receive, and time stamp push event types.  This value is zero in 32-bit mode." range="31:0" rwaccess="R"/>
	</register><register id="CPSW_NC_CPTS_TS_LOAD_HIGH_VAL_REG" acronym="CPSW_NC_CPTS_TS_LOAD_HIGH_VAL_REG" offset="249924" width="32" description="Time Stamp Load High Value Register">
		<bitfield id="TS_LOAD_VAL" width="32" begin="31" end="0" resetval="0x0" description="Time Stamp Load high Value - Writing the ts_load_en bit causes the value contained in this register (and the ts_load[63:0]) to be written into the time stamp.  The time stamp value is read by initiating a time stamp push event, not by reading this register.  When reading this register, the value read is not the time stamp, but is the value that was last written to this register.   This value is unused in 32-bit mode." range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPTS_TS_COMP_HIGH_VAL_REG" acronym="CPSW_NC_CPTS_TS_COMP_HIGH_VAL_REG" offset="249928" width="32" description="Time Stamp Comparison High Value Register">
		<bitfield id="TS_COMP_HIGH_VAL" width="32" begin="31" end="0" resetval="0x0" description="Time Stamp Comparison High Value - Writing a non-zero value to the TS_Comp_Length[31:0] register causes a pulse of TS_Comp_Length RCLK periods on the TS_COMP output and a comparison event when the time_stamp counter value is equivalent to  ts_comp_val[63:0].  This value is unused in 32-bit mode.  The upper 32-bits in this register should be written before the lower 32-bits in the TS_Comp_Low register." range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPTS_TS_ADD_VAL_REG" acronym="CPSW_NC_CPTS_TS_ADD_VAL_REG" offset="249932" width="32" description="TS Add Value Register">
		<bitfield id="ADD_VAL" width="3" begin="2" end="0" resetval="0x0" description="The ts_add_value[2:0] is added to 1 to comprise the timestamp increment value.  The timestamp increment value is added to the current timestamp (time_stamp[63:0]) on each RCLK.  The timestamp increment value can be adjusted by nudge and ppm also. The ts_add_val[2:0] value may be non-zero in 64-bit mode only.  " range="2:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPTS_TS_PPM_LOW_VAL_REG" acronym="CPSW_NC_CPTS_TS_PPM_LOW_VAL_REG" offset="249936" width="32" description="Time Stamp PPM Low Value Register">
		<bitfield id="TS_PPM_LOW_VAL" width="32" begin="31" end="0" resetval="0x0" description="Time Stamp PPM Low Value - The 64-bit PPM value takes effect when this low value is written.  The high value should be written first.     Note:  There should be at least 10 clocks in between writes to the low register to ensure that the previous operation has been seen." range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPTS_TS_PPM_HIGH_VAL_REG" acronym="CPSW_NC_CPTS_TS_PPM_HIGH_VAL_REG" offset="249940" width="32" description="Time Stamp PPM High Value Register">
		<bitfield id="TS_PPM_HIGH_VAL" width="10" begin="9" end="0" resetval="0x0" description="Time Stamp PPM High Value - This value should be written first (before the low value is written).  The minimum value of the ts_ppm is 0x400 (all 42 bits)." range="9:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPTS_TS_NUDGE_VAL_REG" acronym="CPSW_NC_CPTS_TS_NUDGE_VAL_REG" offset="249944" width="32" description="Time Stamp Nudge Value Register">
		<bitfield id="TS_NUDGE_VAL" width="8" begin="7" end="0" resetval="0x0" description="Timestamp Nudge Value - This two's complement number is added to the time_stamp[63:0] value to increase or decrease the timestamp value by the ts_nudge amount.  The ts_nudge value is cleared to zero when the nudge has occurred.  " range="7:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPTS_TS_CONFIG" acronym="CPSW_NC_CPTS_TS_CONFIG" offset="250064" width="32" description="Time Stamp Configuration Read">
		<bitfield id="EVNT_FIFO_DEPTH" width="8" begin="15" end="8" resetval="0x32" description="This is the configured value for the depth of the event FIFO.  This parameter is passed in at module generation." range="15:8" rwaccess="R"/>
	<bitfield id="NUM_GENF" width="8" begin="7" end="0" resetval="0x2" description="This is the configured value for the number of GENF outputs.  This parameter is passed in at module generation." range="7:0" rwaccess="R"/>
	</register><register id="CPSW_NC_ALE_MOD_VER" acronym="CPSW_NC_ALE_MOD_VER" offset="253952" width="32" description="The Module and Version Register identifies the module identifier and revision of the ALE_3g512e module.">
		<bitfield id="MODULE_ID" width="16" begin="31" end="16" resetval="0x41" description="ALE_3g512e module ID." range="31:16" rwaccess="R"/>
	<bitfield id="RTL_VERSION" width="5" begin="15" end="11" resetval="0x2" description="RTL Version." range="15:11" rwaccess="R"/>
	<bitfield id="MAJOR_REVISION" width="3" begin="10" end="8" resetval="0x1" description="Major Revision." range="10:8" rwaccess="R"/>
	<bitfield id="CUSTOM_REVISION" width="2" begin="7" end="6" resetval="0x0" description="Custom Revision." range="7:6" rwaccess="R"/>
	<bitfield id="MINOR_REVISION" width="6" begin="5" end="0" resetval="0x5" description="Minor Revision." range="5:0" rwaccess="R"/>
	</register><register id="CPSW_NC_ALE_STATUS" acronym="CPSW_NC_ALE_STATUS" offset="253956" width="32" description="The ALE status provides information on the ALE configuration and state. The ramdepth is used to determine how IPv6 entries are stored in the table. IPv6 entries are stored in two entries where IPv6 Entry Hi is designated by the odd slice index and Lo is designated by the even slice index. The slice index is above the ram depth like {SliceIndex,RamIndex}. So, for a 64 deep RAM index of 0x005, the Hi portion of the IPv6 entry is located at 0x005|(0x040) and the Lo portion is located at 0x005 &#38; (~0x040).">
		<bitfield id="UREGANDREGMSK12" width="1" begin="31" end="31" resetval="0x1" description="When set, the unregistered multicast field is a mask versus an index on 12 bit boundary in the ALE table." range="31" rwaccess="R"/>
	<bitfield id="UREGANDREGMSK08" width="1" begin="30" end="30" resetval="0x0" description="When set, the unregistered multicast field is a mask versus an index on 8 bit boundary in the ALE table." range="30" rwaccess="R"/>
	<bitfield id="POLCNTDIV8" width="8" begin="15" end="8" resetval="0x4" description="This is the number of Classifiers the ALE implements divided by 8. A value of 4 indicates 32 policer engines total." range="15:8" rwaccess="R"/>
	<bitfield id="RAMDEPTH128" width="1" begin="7" end="7" resetval="0x0" description="The number of ALE entries per slice of the table when this is set it indicates the depth is 128 if both ramdepth128 and ramdepth32 are zero the depth is 64." range="7" rwaccess="R"/>
	<bitfield id="RAMDEPTH32" width="1" begin="6" end="6" resetval="0x0" description="The number of ALE entries per slice of the table when this is set it indicates the depth is 32 if both ramdepth128 and ramdepth32 are zero the depth is 64." range="6" rwaccess="R"/>
	<bitfield id="KLUENTRIES" width="5" begin="4" end="0" resetval="0x0" description="This is the number of table entries total divided by 1024. A value of 1 indicates 1024 table entries. A value of 8 indicates 8192 table entries." range="4:0" rwaccess="R"/>
	</register><register id="CPSW_NC_ALE_CONTROL" acronym="CPSW_NC_ALE_CONTROL" offset="253960" width="32" description="The ALE Control Register is used to set the ALE modes used for all ports.">
		<bitfield id="ENABLE_ALE" width="1" begin="31" end="31" resetval="0x0" description="Enable ALE  0 - Drop all packets  1 - Enable ALE packet processing" range="31" rwaccess="R/W"/>
	<bitfield id="CLEAR_TABLE" width="1" begin="30" end="30" resetval="0x0" description="Clear ALE address table - Setting this bit causes the ALE hardware to write all table bit values to zero. Software must perform a clear table operation as part of the ALE setup/configuration process. Setting this bit causes all ALE accesses to be held up for 64 clocks while the clear is performed. Access to all ALE registers will be blocked (wait states) until the 64 clocks have completed. This bit cannot be read as one because the read is blocked until the clear table is completed at which time this bit is cleared to zero." range="30" rwaccess="R/W"/>
	<bitfield id="AGE_OUT_NOW" width="1" begin="29" end="29" resetval="0x0" description="Age Out Address Table Now - Setting this bit causes the ALE hardware to remove (free up) any ageable table entry that does not have a set touch bit. This bit is cleared when the age out process has completed. This bit may be read. The age out process takes four times the number of table entries clock cycles (4096 cycles for 1K addresses) best case (no ale packet processing during ageout) and sixty five times the number of table entries clock cycles (66560 cycles for 1K addresses) absolute worst case." range="29" rwaccess="R/W"/>
	<bitfield id="MIRROR_DP" width="2" begin="25" end="24" resetval="0x0" description="Mirror Destination Port - This field defines the port to which destination traffic destined will be duplicated. That is all traffic that is forwarded to this port will also be mirrored to the  mirror_top port." range="25:24" rwaccess="R/W"/>
	<bitfield id="UPD_BW_CTRL" width="3" begin="23" end="21" resetval="0x0" description="The  upd_bw_ctrl field allows for up to 8 times the rate in which adds, updates, touches, writes, and aging updates can occur. At frequencies of 350Mhz, the table update rate should be at it lowest or 5 Million updates per second. When operating the switch core at frequencies or above, the  upd_bw_ctrl can be programmed more aggressive. If the  upd_bw_ctrl is set but the frequency of the switch subsystem is below the associated value, ALE will drop packets due to insufficient time to complete lookup under high traffic loads.  0 - 350Mhz, 5M  1 - 359Mhz, 11M  2 - 367Mhz, 16M  3 - 375Mhz, 22M  4 - 384Mhz, 28M  5 - 392Mhz, 34M  6 - 400Mhz, 39M  7 - 409Mhz, 45M" range="23:21" rwaccess="R/W"/>
	<bitfield id="MIRROR_TOP" width="2" begin="17" end="16" resetval="0x0" description="Mirror To Port - This field defines the destination port for the mirror traffic. If the traffic is received or transmitted on the mirror destination port it will not be duplicated. Traffic defined as mirror traffic only may be dropped by the switch due to congestion." range="17:16" rwaccess="R/W"/>
	<bitfield id="UPD_STATIC" width="1" begin="15" end="15" resetval="0x0" description="Update Static Entries - A static Entry is an entry that is not agable. When clear this bit will prevent any static entry (agable bit clear) from being updated due to port change. When set it allows static entries (agable bit clear) to update the source port if required. This bit should normally be '0' for most switch configurations." range="15" rwaccess="R/W"/>
	<bitfield id="LRN_HOST_DST" width="1" begin="14" end="14" resetval="0x0" description="Learn Host Destination - This field is set to only learn unicast packet source addresses that are destined to the host port. This bit is only valid for 3 port switches and allows the ALE table to only contain addresses the host port is concerned about. This bit is affectively disabled when  en_host_uni_flood is set since any unknown unicast is also sent to the host port for extended bridging operations." range="14" rwaccess="R/W"/>
	<bitfield id="UVLAN_NO_LEARN" width="1" begin="13" end="13" resetval="0x0" description="Unknown VLAN No Learn - This field when set will prevent source addresses of unknown VLAN IDs from being automatically added into the look up table if learning is enabled." range="13" rwaccess="R/W"/>
	<bitfield id="MIRROR_MEN" width="1" begin="12" end="12" resetval="0x0" description="Mirror Match Entry Enable - This field enables the match mirror option. When this bit is set any traffic whose destination, source, VLAN or OUI matches the  mirror_midx entry index will have that traffic also sent to the  mirror_top port." range="12" rwaccess="R/W"/>
	<bitfield id="MIRROR_DEN" width="1" begin="11" end="11" resetval="0x0" description="Mirror Destination Port Enable - This field enables the destination port mirror option. When this bit is set any traffic destined for the  mirror_dp port will have its transmit traffic also sent to the  mirror_top port." range="11" rwaccess="R/W"/>
	<bitfield id="MIRROR_SEN" width="1" begin="10" end="10" resetval="0x0" description="Mirror Source Port Enable - This field enables the source port mirror option. When this bit is set any port with the  pX_mirror_sp set in the ALE Port Control registers set will have its received traffic also sent to the  mirror_top port." range="10" rwaccess="R/W"/>
	<bitfield id="EN_HOST_UNI_FLOOD" width="1" begin="8" end="8" resetval="0x0" description="Unknown unicast packets flood to host  0 - unknown unicast packets are not sent to the host  1 - unknown unicast packets flood to host port as well as other ports" range="8" rwaccess="R/W"/>
	<bitfield id="LEARN_NO_VLANID" width="1" begin="7" end="7" resetval="0x0" description="Learn No VID -  0 - VID is learned with the source address  1 - VID is not learned with the source address (source address is not tied to VID). Determines the entry type." range="7" rwaccess="R/W"/>
	<bitfield id="ENABLE_VID0_MODE" width="1" begin="6" end="6" resetval="0x0" description="Enable VLAN ID = 0 Mode  0 - Process the priority tagged packet with VID = PORT_VLAN[11:0].  1 - Process the priority tagged packet with VID = 0." range="6" rwaccess="R/W"/>
	<bitfield id="ENABLE_OUI_DENY" width="1" begin="5" end="5" resetval="0x0" description="Enable OUI Deny Mode - When set, any packet with a non-matching OUI source address will be dropped to the host unless the packet destination address matches a supervisory destination address table entry. When cleared, any packet source address matching an OUI address table entry will be dropped to the host unless the destination address matches with a supervisory destination address table entry." range="5" rwaccess="R/W"/>
	<bitfield id="ENABLE_BYPASS" width="1" begin="4" end="4" resetval="0x0" description="ALE Bypass - When set, packets received on non-host ports are sent to the host. It is expected that packets from the host are directed to the particular port.  0 - no bypass  1 - bypass the ALE" range="4" rwaccess="R/W"/>
	<bitfield id="BCAST_MCAST_CTL" width="1" begin="3" end="3" resetval="0x0" description="Rate Limit Transmit mode  0 - Broadcast and multicast rate limit counters are received port based  1 - Broadcast and multicast rate limit counters are transmit port based" range="3" rwaccess="R/W"/>
	<bitfield id="ALE_VLAN_AWARE" width="1" begin="2" end="2" resetval="0x0" description="ALE VLAN Aware - Determines how traffic is forwarded using VLAN rules.  0 - Simple switch rules, packets forwarded to all ports for unknown destinations.  1 - VLAN Aware rules, packets forwarded based on VLAN members" range="2" rwaccess="R/W"/>
	<bitfield id="ENABLE_AUTH_MODE" width="1" begin="1" end="1" resetval="0x0" description="Enable MAC Authorization Mode - Mac authorization mode requires that all table entries be made by the host software. There is no auto learning of addresses in authorization mode and the packet will be dropped if the source address is not found (and the destination address is not a multicast address with the super table entry bit set).  0 - The ALE is not in MAC authorization mode  1 - The ALE is in MAC authorization mode" range="1" rwaccess="R/W"/>
	<bitfield id="ENABLE_RATE_LIMIT" width="1" begin="0" end="0" resetval="0x0" description="Enable Broadcast and Multicast Rate Limit  0 - Broadcast/Multicast rates not limited  1 - Broadcast/Multicast packet reception limited to the port control register rate limit fields." range="0" rwaccess="R/W"/>
