ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263X/CPSW_CPSW_52800000h.xml
	</register><register id="CPSW_NC_ALE_CTRL2" acronym="CPSW_NC_ALE_CTRL2" offset="253964" width="32" description="The ALE Control 2 Register is used to set the extended features used for all ports.">
		<bitfield id="TRK_EN_DST" width="1" begin="31" end="31" resetval="0x0" description="Trunk Enable Destination Address - This field enables the destination MAC address to be used with the hash function G(X) = 1 + X + X^3 and affect the trunk port transmit link determination." range="31" rwaccess="R/W"/>
	<bitfield id="TRK_EN_SRC" width="1" begin="30" end="30" resetval="0x0" description="Trunk Enable Source Address - This field enables the source MAC address to be used with the hash function G(X) = 1 + X + X^3 and affect the trunk port transmit link determination." range="30" rwaccess="R/W"/>
	<bitfield id="TRK_EN_PRI" width="1" begin="29" end="29" resetval="0x0" description="Trunk Enable Priority - This field enables the VLAN Priority bits to be used with the hash function G(X) = 1 + X + X^3 and affect the trunk port transmit link determination. In the event that DSCP mapping is enabled and there is no VLAN the DSCP priority will be used. For all other non IP frames without VLAN the port default priority is used." range="29" rwaccess="R/W"/>
	<bitfield id="TRK_EN_IVLAN" width="1" begin="27" end="27" resetval="0x0" description="Trunk Enable Inner VLAN - This field enables the inner VLAN ID value (C-VLANID) to be used with the hash function G(X) = 1 + X + X^3 and affect the trunk port transmit link determination." range="27" rwaccess="R/W"/>
	<bitfield id="TRK_EN_SIP" width="1" begin="25" end="25" resetval="0x0" description="Trunk Enable Source IP Address - This field enables the source IP address to be used with the hash function G(X) = 1 + X + X^3 and affect the trunk port transmit link determination. This feature supports No tag, Priority tagged, VLAN tagged, Q-in-Q double tagging for both IPV6 and IPV4." range="25" rwaccess="R/W"/>
	<bitfield id="TRK_EN_DIP" width="1" begin="24" end="24" resetval="0x0" description="Trunk Enable Destination IP Address - This field enables the destination IP address to be used with the hash function G(X) = 1 + X + X^3 and affect the trunk port transmit link determination. This feature supports No tag, Priority tagged, VLAN tagged, Q-in-Q double tagging for both IPV6 and IPV4." range="24" rwaccess="R/W"/>
	<bitfield id="DROP_BADLEN" width="1" begin="23" end="23" resetval="0x0" description="Drop Bad Length will drop any packet that the 802.3 length field is larger than the packet. Ethertypes 0-1500 are 802.3 lengths, all others are Ether types." range="23" rwaccess="R/W"/>
	<bitfield id="NODROP_SRCMCST" width="1" begin="22" end="22" resetval="0x0" description="No Drop Source Multicast will disable the dropping of any source address with the multicast bit set." range="22" rwaccess="R/W"/>
	<bitfield id="DEFNOFRAG" width="1" begin="21" end="21" resetval="0x0" description="Default No Frag field will cause an IPv4 fragmented packet to be dropped if a VLAN entry is not found." range="21" rwaccess="R/W"/>
	<bitfield id="DEFLMTNXTHDR" width="1" begin="20" end="20" resetval="0x0" description="Default limit next header field will cause an IPv4 protocol or IPv6 next header packet to be dropped if a VLAN entry is not found and the protocol or next header does not match the  ALE_NXT_HDR register values." range="20" rwaccess="R/W"/>
	<bitfield id="TRK_BASE" width="3" begin="18" end="16" resetval="0x0" description="Trunk Base - This field is the hash formula starting value. Changing this value will cause the packet distribution on trunk ports to be changed. If all the  trk_en_dst,  trk_en_src,  trk_en_pri and  trk_en_vlan are '0', this value is used as the distribution index. That is a '0' will select the 1st bit of an 'N' link trunk, a '1' will select the second, etc.  Below is the distribution across the trunk links. The first number in the  italic sequence indicates the traffic is sent to the lowest numbered port of a trunk group. For example if you have a 3 port trunk, the hash result 0 will go to the base port (0), hash result 1 will go to the highest port of the trunk group (2), hash result 2 will go to the middle port (1), etc.  1 -  00000000  2 -  01010101  3 -  02102102  4 -  03210321" range="18:16" rwaccess="R/W"/>
	<bitfield id="MULTIHOST" width="1" begin="15" end="15" resetval="0x0" description="The ~multihost allows host traffic to be sent bact to the host if the DA is market for the host port." range="15" rwaccess="R/W"/>
	<bitfield id="MIRROR_MIDX" width="9" begin="8" end="0" resetval="0x0" description="Mirror Index - This field is the ALE lookup table entry index that when a match occurs will cause this traffic to be mirrored to the  mirror_top port. That is any VLAN, ONU or address with or withou VLAN can be selected for traffic mirroring." range="8:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_ALE_PRESCALE" acronym="CPSW_NC_ALE_PRESCALE" offset="253968" width="32" description="The ALE Prescale Register is used to set the Broadcast and Multicast rate limiting prescaler value. ">
		<bitfield id="ALE_PRESCALE" width="20" begin="19" end="0" resetval="0x0" description="ALE Prescale - The input clock is divided by this value for use in the multicast/broadcast rate limiters. The minimum operating value is 0x10. The prescaler is off when the value is zero." range="19:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_ALE_AGING_CTRL" acronym="CPSW_NC_ALE_AGING_CTRL" offset="253972" width="32" description="The ALE Aging Control sets the aging interval which will cause periodic aging to occur. This value specifies the minimum time between aging starts.">
		<bitfield id="PRESCALE_2_DISABLE" width="1" begin="31" end="31" resetval="0x0" description="ALE Prescaler 2 Disable - When set will divide the aging interval by 1000. This bit is designed for device verification and should not be used in production software. Combination of PreScale1Disable and PreScale2Disable will divide the aging interval by 1,000,000 for test purposes." range="31" rwaccess="R/W"/>
	<bitfield id="PRESCALE_1_DISABLE" width="1" begin="30" end="30" resetval="0x0" description="ALE Prescaler 1 Disable - When set will divide the aging interval by 1000. This bit is designed for device verification and should not be used in production software. Combination of PreScale1Disable and PreScale2Disable will divide the aging interval by 1,000,000 for test purposes." range="30" rwaccess="R/W"/>
	<bitfield id="ALE_AGING_TIMER" width="24" begin="23" end="0" resetval="0x0" description="ALE Aging Timer - This field specifies the number of clock cycles times 1,000,000 between aging operations." range="23:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_ALE_NXT_HDR" acronym="CPSW_NC_ALE_NXT_HDR" offset="253980" width="32" description="The ALE Next Header is used to limit the IPv6 Next header or IPv4 Protocol values found in the IP header. It is enabled via the ~iLmtNxtHdr bit in the VLAN entry. All four ~iip_nxt_hdr0-3 are compared when enabled, so if only one is required, set them all to the one value to be tested.">
		<bitfield id="IP_NXT_HDR3" width="8" begin="31" end="24" resetval="0x0" description="The  ip_nxt_hdr3 is the forth protocol or next header compared when enabled." range="31:24" rwaccess="R/W"/>
	<bitfield id="IP_NXT_HDR2" width="8" begin="23" end="16" resetval="0x0" description="The  ip_nxt_hdr2 is the third protocol or next header compared when enabled." range="23:16" rwaccess="R/W"/>
	<bitfield id="IP_NXT_HDR1" width="8" begin="15" end="8" resetval="0x0" description="The  ip_nxt_hdr1 is the second protocol or next header compared when enabled." range="15:8" rwaccess="R/W"/>
	<bitfield id="IP_NXT_HDR0" width="8" begin="7" end="0" resetval="0x0" description="The  ip_nxt_hdr0 is the first protocol or next header compared when enabled." range="7:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_ALE_TBLCTL" acronym="CPSW_NC_ALE_TBLCTL" offset="253984" width="32" description="The ALE table control register is used to read or write that ALE table entries. After writing to this register any read or write to any ALE register will be stalled until the read or write operation completes.">
		<bitfield id="TABLEWR" width="1" begin="31" end="31" resetval="0x0" description="Table Write - This bit is used to write the table words to the lookup table.  0 - Table Read Operation is performed. The contents of the   TABLEIDX entry will be read into the   ALE_TBLWx registers  1 - Table write operation is performed. This will take the current contents from the   ALE_TBLWx registers and write them to the table at the specified   TABLEIDX." range="31" rwaccess="R/W"/>
	<bitfield id="TABLEIDX" width="9" begin="8" end="0" resetval="0x0" description="The table index is used to determine which lookup table entry is read or written." range="8:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_ALE_TBLW2" acronym="CPSW_NC_ALE_TBLW2" offset="254004" width="32" description="The ALE Table Word 2 is the most significant word of an ALE table entry.">
		<bitfield id="TABLEWRD2" width="7" begin="6" end="0" resetval="0x0" description="Table Entry bits [71:64] " range="6:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_ALE_TBLW1" acronym="CPSW_NC_ALE_TBLW1" offset="254008" width="32" description="The ALE Table Word 1 is the middle word of an ALE table entry.">
		<bitfield id="TABLEWRD1" width="32" begin="31" end="0" resetval="0x0" description="Table Entry bits [63:32] " range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_ALE_TBLW0" acronym="CPSW_NC_ALE_TBLW0" offset="254012" width="32" description="The ALE Table Word 0 is the least significant word of an ALE table entry.">
		<bitfield id="TABLEWRD0" width="32" begin="31" end="0" resetval="0x0" description="Table Entry bits [31:0] " range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_ALE_I0_PORTCTL0_j" acronym="CPSW_NC_ALE_I0_PORTCTL0_j" offset="254016" width="32" description="The ALE Port Control Register sets the port specific modes of operation.">
		<bitfield id="I0_REG_P0_BCAST_LIMIT" width="8" begin="31" end="24" resetval="0x0" description="Broadcast Packet Rate Limit - Each prescale pulse loads this field into the port broadcast rate limit counter. The port counters are decremented with each packet received or transmitted depending on whether the mode is transmit or receive. If the counters decrement to zero, then further packets are rate limited until the next prescale pulse. Broadcast rate limiting is enabled by a non-zero value in this field." range="31:24" rwaccess="R/W"/>
	<bitfield id="I0_REG_P0_MCAST_LIMIT" width="8" begin="23" end="16" resetval="0x0" description="Multicast Packet Rate Limit - Each prescale pulse loads this field into the port multicast rate limit counter. The port counters are decremented with each packet received or transmitted depending on whether the mode is transmit or receive. If the counters decrement to zero, then further packets are rate limited until the next prescale pulse. Multicast rate limiting is enabled by a non-zero value in this field.The  mcast_limit is the number of Multicast packets that will be forwaded per  ale_prescale time. " range="23:16" rwaccess="R/W"/>
	<bitfield id="I0_REG_P0_DROP_DOUBLE_VLAN" width="1" begin="15" end="15" resetval="0x0" description="Drop Double VLAN - When set cause any received packet with double VLANs to be dropped. That is if there are two ctag or two stag fields in the packet it will be dropped." range="15" rwaccess="R/W"/>
	<bitfield id="I0_REG_P0_DROP_DUAL_VLAN" width="1" begin="14" end="14" resetval="0x0" description="Drop Dual VLAN - When set will cause any received packet with dual VLAN stag followed by ctag to be dropped." range="14" rwaccess="R/W"/>
	<bitfield id="I0_REG_P0_MACONLY_CAF" width="1" begin="13" end="13" resetval="0x0" description="Mac Only Copy All Frames - When set a Mac Only port will transfer all received good frames to the host. When clear a Mac Only port will transfer packets to the host based on ALE destination address lookup operation (which operates more like an Ethernet Mac). A Mac Only port is a port with  maconly set." range="13" rwaccess="R/W"/>
	<bitfield id="I0_REG_P0_DIS_PAUTHMOD" width="1" begin="12" end="12" resetval="0x0" description="Disable Port authorization - When set will allow unknown addresses to arrive on a switch in authorization mode. It is intended for device to device network connection on ports which do not require MACSEC encryption." range="12" rwaccess="R/W"/>
	<bitfield id="I0_REG_P0_MACONLY" width="1" begin="11" end="11" resetval="0x0" description="MAC Only - When set enables this port be treated like a MAC port for the host. All traffic received is only sent to the host. The host must direct traffic to this port as the lookup engine will not send traffic to the ports with the  p0_maconly bit set and the  p0_no_learn also set. If  p0_maconly bit is set and the  p0_no_learn is not set, the host can send non-directed packets that can be sent to the destination of a MacOnly port. It is also possible that The host can broadcast to all ports including MacOnly ports in this mode." range="11" rwaccess="R/W"/>
	<bitfield id="I0_REG_P0_TRUNKEN" width="1" begin="10" end="10" resetval="0x0" description="Trunk Enable - This field is used to enable a port into a trunk. Any port can be used as a trunk port, any two or more ports with the  p0_trunken its set and having the same  p0_trunknum will be placed in the same trunk. There is no requirement for trunk ports to be adjacent. If all ports are enabled in the same trunk, no traffic can flow as traffic received within a trunk is never trasnmitted out the same trunk. If only a single port is a member of a trunk, it looks like a normal port with exception of entries in the look up table will be noted as a trunk entry." range="10" rwaccess="R/W"/>
	<bitfield id="I0_REG_P0_TRUNKNUM" width="2" begin="9" end="8" resetval="0x0" description="Trunk Number - This field is used as the trunk number when the  p0_trunken is also set. Ports with the same trunk number that have the  p0_trunken also set will have traffic distributed within the trunk based on the result of the hash function descrived above." range="9:8" rwaccess="R/W"/>
	<bitfield id="I0_REG_P0_MIRROR_SP" width="1" begin="7" end="7" resetval="0x0" description="Mirror Source Port - This field enables the source port mirror option. When this bit is set any traffic received on the port with the reg_p0_mirror_sp bit set will have its received traffic also sent to the  mirror_top port." range="7" rwaccess="R/W"/>
	<bitfield id="I0_REG_P0_NO_SA_UPDATE" width="1" begin="5" end="5" resetval="0x0" description="No Source Address Update - When set will not update the source addresses for this port." range="5" rwaccess="R/W"/>
	<bitfield id="I0_REG_P0_NO_LEARN" width="1" begin="4" end="4" resetval="0x0" description="No Learn - When set will not learn the source addresses for this port." range="4" rwaccess="R/W"/>
	<bitfield id="I0_REG_P0_VID_INGRESS_CHECK" width="1" begin="3" end="3" resetval="0x0" description="VLAN Ingress Check - When set if a packet received is not a member of the VLAN, the packet will be dropped." range="3" rwaccess="R/W"/>
	<bitfield id="I0_REG_P0_DROP_UN_TAGGED" width="1" begin="2" end="2" resetval="0x0" description="If Drop Untagged - When set will drop packets without a VLAN tag." range="2" rwaccess="R/W"/>
	<bitfield id="I0_REG_P0_PORTSTATE" width="2" begin="1" end="0" resetval="0x0" description="Port State - Defins the current port state used for lookup operations.  0 - Disabled  1 - Blocked  2 - Learning  3 - Forwarding" range="1:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_ALE_UVLAN_MEMBER" acronym="CPSW_NC_ALE_UVLAN_MEMBER" offset="254096" width="32" description="The ALE Unknown VLAN Member Mask Register is used to specify the member list for unknown VLAN ID.">
		<bitfield id="UVLAN_MEMBER_LIST" width="3" begin="2" end="0" resetval="0x0" description="Unknown VLAN Member List - Each bit represents the port member status for unknown VLANs." range="2:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_ALE_UVLAN_URCAST" acronym="CPSW_NC_ALE_UVLAN_URCAST" offset="254100" width="32" description="The ALE Unknown VLAN Unregistered Multicast Flood Mask Register is used to specify which egress ports unregistered multicast addresses egress for the unregistered VLAN ID.">
		<bitfield id="UVLAN_UNREG_MCAST_FLOOD_MASK" width="3" begin="2" end="0" resetval="0x0" description="Unknown VLAN Unregister Multicast Flood Mask - Each bit represents the port to which unregistered multicast are sent for unregistered VLANs." range="2:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_ALE_UVLAN_RMCAST" acronym="CPSW_NC_ALE_UVLAN_RMCAST" offset="254104" width="32" description="The ALE Unknown VLAN Registered Multicast Flood Mask Register is used to specify which egress ports registered multicast addresses egress for the unregistered VLAN ID.">
		<bitfield id="UVLAN_REG_MCAST_FLOOD_MASK" width="3" begin="2" end="0" resetval="0x0" description="Unknown VLAN Register Multicast Flood Mask - Each bit represents the port to which registered multicast are sent for unregistered VLANs. This field is ANDed with the registered multicast mask to determine the destinations for unregistered VLANs." range="2:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_ALE_UVLAN_UNTAG" acronym="CPSW_NC_ALE_UVLAN_UNTAG" offset="254108" width="32" description="The ALE Unknown VLAN force Untagged Egress Mask Register is used to specify which egress ports the VLAN ID will be removed.">
		<bitfield id="UVLAN_FORCE_UNTAGGED_EGRESS" width="3" begin="2" end="0" resetval="0x0" description="Unknown VLAN Force Untagged Egress Mask - Each bit represents the port where the VLAN will be removed for unregistered VLANs." range="2:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_ALE_FAST_LUT" acronym="CPSW_NC_ALE_FAST_LUT" offset="254132" width="32" description="The Fast LUT registers allows the ports to be placed in Fast LUT mode.">
		<bitfield id="FAST_LUT" width="3" begin="2" end="0" resetval="0x0" description="The ~Fast_LUT field alows any port to be Fast_LUT mode, which will cause all lookup operations to start based on DA/SA and VLAN only. That is any data beyong the first 32 are not used in the lookup process. " range="2:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_ALE_STAT_DIAG" acronym="CPSW_NC_ALE_STAT_DIAG" offset="254136" width="32" description="The ALE Statistic Output Diagnostic Register allows the output statistics to diagnose the SW counters. This register is for diagnostice only.">
		<bitfield id="PBCAST_DIAG" width="1" begin="15" end="15" resetval="0x0" description="When set and the  port_diag is set to zero, will allow all ports to see the same stat diagnostic increment." range="15" rwaccess="R/W"/>
	<bitfield id="PORT_DIAG" width="2" begin="9" end="8" resetval="0x0" description="The port selected that a received packet will cause the selected error to increment" range="9:8" rwaccess="R/W"/>
	<bitfield id="STAT_DIAG" width="4" begin="3" end="0" resetval="0x0" description="When non-zero will cause the selected statistic to increment on the next frame received. For the selected Port.   0: Disabled  1: Destination Equal Source Drop Stat will count  2: VLAN Ingress Check Drop Stat will count  3: Source Multicast Drop Stat will count  4: Dual VLAN Drop Stat will count  5: Ether Type length error Drop Stat will count  6: Next Hop Limit Drop Stat will count  7: IPv4 Fragment Drop Stat will count  8: Classifier Hit Stat will count  9: Classifier Red Drop Stat will count  10: Classifier Yellow Drop Stat will count  11: ALE Overflow Drop Stat will count  12: Rate Limit Drop Stat will count  13: Blocked Address Drop Stat will count  14: Secure Address Drop Stat will count  15: Authorization Drop Stat will count." range="3:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_ALE_OAM_LB_CTRL" acronym="CPSW_NC_ALE_OAM_LB_CTRL" offset="254140" width="32" description="The ALE OAM Control allows ports to be put into OAM Loopback, only non-supervisor packet are looped back to the source port.">
		<bitfield id="OAM_LB_CTRL" width="3" begin="2" end="0" resetval="0x0" description="The  oam_lb_ctrl allows any port to be put into OAM loopback, that is any packet received will be returned to the same port with an egressop of 0xFF which swaps the source and destination address. BPDUs will still flow through as normal so that OAM can be remotly requested and disabled." range="2:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_ALE_EGRESSOP" acronym="CPSW_NC_ALE_EGRESSOP" offset="254204" width="32" description="The Egress Operation register allows enabled classifiers with any match like IPSA or IPDA match to use the CPSW Egress Packet Operations Inter VLAN Routing sub functions. If the packet was destined for the host or is destined to any port without any errors, but matches a clasifier that has a programmed egress opcode, it will be forwarded to the destination ports where the destination ports will use the thier egress opcode entry to modify the packet. InterVLAN Routing and mirroring need to be understood, they are orthogonal functions. Care must be taken not to violate VLAN rules as this can redirect packets based on classifier matches.">
		<bitfield id="EGRESS_OP" width="8" begin="31" end="24" resetval="0x0" description="The Egress Operation defines the operation performed by the CPSW Egress Packet Operations  0: NOP : 1-n: Defines which egress Operation will be performed. This allows Inter VLAN routing to be configured for high bandwidth traffic, reducing CPU load.  0xff: Swap SA and DA of packet, this is intended to allow OAM diagnostics for a link." range="31:24" rwaccess="R/W"/>
	<bitfield id="EGRESS_TRK" width="3" begin="23" end="21" resetval="0x0" description="The Egress Trunk Index is the calculated trunk index from the SA, DA or VLAN if modified to that InterVLAN routing will work on trunks as well. The DA, SA and VLAN are ignored for trunk generation on InterVLAN Routing so that this field is the index generated from the Egress Op replacements elclusive or'd together into a three bit index." range="23:21" rwaccess="R/W"/>
	<bitfield id="TTL_CHECK" width="1" begin="20" end="20" resetval="0x0" description="The TTL Check will cause any packet that fails TTL checks to not be routed to the Inter VLAN Routing sub functions. The packet will be routed to the host it was destined to." range="20" rwaccess="R/W"/>
	<bitfield id="DEST_PORTS" width="3" begin="2" end="0" resetval="0x0" description="The Destination Ports is a list of the ports the classified packet will be set to. If a destination is a Trunk, all the port bits for that trunck must be set." range="2:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_ALE_POLICECFG0" acronym="CPSW_NC_ALE_POLICECFG0" offset="254208" width="32" description="The Policing Config 0 holds the port, frame priority and ONU address index as well as match enables for port, frame priority and ONU address matching.">
		<bitfield id="PORT_MEN" width="1" begin="31" end="31" resetval="0x0" description="Port Match Enable - Enabled port match for the selected policing/classifier entry" range="31" rwaccess="R/W"/>
	<bitfield id="TRUNKID" width="1" begin="30" end="30" resetval="0x0" description="Trunk ID - When set indicates the port number is a trunk group." range="30" rwaccess="R/W"/>
	<bitfield id="PORT_NUM" width="2" begin="26" end="25" resetval="0x0" description="Port Number - Specifies the port address to match for the selected policing/classifier entry" range="26:25" rwaccess="R/W"/>
	<bitfield id="PRI_MEN" width="1" begin="19" end="19" resetval="0x0" description="Priority Match Enable - Enables frame priority match for the selected policing/classifier entry" range="19" rwaccess="R/W"/>
