ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263X/CPSW_CPSW_52800000h.xml
	<bitfield id="PRI_VAL" width="3" begin="18" end="16" resetval="0x0" description="Priority Value - Specifies the frame priority to match for the selected policing/classifier entry" range="18:16" rwaccess="R/W"/>
	<bitfield id="ONU_MEN" width="1" begin="15" end="15" resetval="0x0" description="OUI Match Enable - Enables frame ONU address match for the selected policing/classifier entry" range="15" rwaccess="R/W"/>
	<bitfield id="ONU_INDEX" width="9" begin="8" end="0" resetval="0x0" description="OUI Table Entry Index - Specifies the ALE ONU address lookup table index to match for the selected policing/classifier entry" range="8:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_ALE_POLICECFG1" acronym="CPSW_NC_ALE_POLICECFG1" offset="254212" width="32" description="The Policing Config 1 holds the match enable/match index for the L2 Destination and L2 source addresses">
		<bitfield id="DST_MEN" width="1" begin="31" end="31" resetval="0x0" description="Destination Address Match Enable - Enables frame L2 destination address match for the selected policing/classifier entry" range="31" rwaccess="R/W"/>
	<bitfield id="DST_INDEX" width="9" begin="24" end="16" resetval="0x0" description="Destination Address Table Entry Index - Specifies the ALE L2 destination address lookup table index to match for the selected policing/classifier entry" range="24:16" rwaccess="R/W"/>
	<bitfield id="SRC_MEN" width="1" begin="15" end="15" resetval="0x0" description="Source Address Match Enable - Enables frame L2 source address match for the selected policing/classifier entry" range="15" rwaccess="R/W"/>
	<bitfield id="SRC_INDEX" width="9" begin="8" end="0" resetval="0x0" description="Source Address Table Entry Index - Specifies the ALE L2 source address lookup table index to match for the selected policing/classifier entry" range="8:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_ALE_POLICECFG2" acronym="CPSW_NC_ALE_POLICECFG2" offset="254216" width="32" description="The Policing Config 2 holds the match enable/match index for the Outer VLAN and Inner VLAN addresses">
		<bitfield id="OVLAN_MEN" width="1" begin="31" end="31" resetval="0x0" description="Outer VLAN Match Enable - Enables frame Outer VLAN address match for the selected policing/classifier entry" range="31" rwaccess="R/W"/>
	<bitfield id="OVLAN_INDEX" width="9" begin="24" end="16" resetval="0x0" description="Outer VLAN Table Entry Index - Specifies the ALE Outer VLAN address lookup table index to match for the selected policing/classifier entry" range="24:16" rwaccess="R/W"/>
	<bitfield id="IVLAN_MEN" width="1" begin="15" end="15" resetval="0x0" description="Inner VLAN Match Enable - Enables frame Inner VLAN address match for the selected policing/classifier entry" range="15" rwaccess="R/W"/>
	<bitfield id="IVLAN_INDEX" width="9" begin="8" end="0" resetval="0x0" description="Inner VLAN Table Entry Index - Specifies the ALE Inner VLAN address lookup table index to match for the selected policing/classifier entry" range="8:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_ALE_POLICECFG3" acronym="CPSW_NC_ALE_POLICECFG3" offset="254220" width="32" description="The Policing Config 3 holds the match enable/match index for the Ether Type and IP Source address">
		<bitfield id="ETHERTYPE_MEN" width="1" begin="31" end="31" resetval="0x0" description="EtherType Match Enable - Enables frame Ether Type match for the selected policing/classifier entry" range="31" rwaccess="R/W"/>
	<bitfield id="ETHERTYPE_INDEX" width="9" begin="24" end="16" resetval="0x0" description="EtherType Table Entry Index - Specifies the ALE Ether Type lookup table index to match for the selected policing/classifier entry" range="24:16" rwaccess="R/W"/>
	<bitfield id="IPSRC_MEN" width="1" begin="15" end="15" resetval="0x0" description="IP Source Address Match Enable - Enables frame IP Source address match for the selected policing/classifier entry" range="15" rwaccess="R/W"/>
	<bitfield id="IPSRC_INDEX" width="9" begin="8" end="0" resetval="0x0" description="IP Source Address Table Entry Index - Specifies the ALE IP Source address lookup table index to match for the selected policing/classifier entry" range="8:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_ALE_POLICECFG4" acronym="CPSW_NC_ALE_POLICECFG4" offset="254224" width="32" description="The Policing Config 4 holds the match enable/match index for the IP Destination address">
		<bitfield id="IPDST_MEN" width="1" begin="31" end="31" resetval="0x0" description="IP Destination Address Match Enable - Enables frame IP Destination address match for the selected policing/classifier entry" range="31" rwaccess="R/W"/>
	<bitfield id="IPDST_INDEX" width="9" begin="24" end="16" resetval="0x0" description="IP Destination Address Table Entry Index - Specifies the ALE IP Destination address lookup table index to match for the selected policing/classifier entry" range="24:16" rwaccess="R/W"/>
	</register><register id="CPSW_NC_ALE_POLICECFG6" acronym="CPSW_NC_ALE_POLICECFG6" offset="254232" width="32" description="The PIR counter is a 37 bit internal counter where ~ipir_idle_inc_val is added every clock and the frame size &#60;&#60; 18 is subtracted at EOF if not RED at LUT time. If the counter is negative the packet will be marked RED, else it can be YELLOW or GREEN based on the CIR counter. If only this counter is used (aka cir_idle_inc_val==0) Packet are marked RED or GREEN based on PIR counter only.">
		<bitfield id="PIR_IDLE_INC_VAL" width="32" begin="31" end="0" resetval="0x0" description="Peak Information Rate Idle Increment Value - The number added to the PIR counter every clock cycle. If zero the PIR counter is disabled and packets will never be marked or processed as RED." range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_ALE_POLICECFG7" acronym="CPSW_NC_ALE_POLICECFG7" offset="254236" width="32" description="The CIR counter is a 37 bit internal counter where ~icir_idle_inc_val is added every clock and the frame size &#60;&#60; 18 is subtracted at EOF if not RED or YELLOW at LUT time. If the counter is positive the packet will be marked GREEN, else it can be YELLOW or RED based on the PIR counter. If only this counter is used (aka pir_idle_inc_val==0) Packet are marked YELLOW or GREEN based on CIR counter only.">
		<bitfield id="CIR_IDLE_INC_VAL" width="32" begin="31" end="0" resetval="0x0" description="Committed Information Idle Increment Value - The number added to the CIR counter every clock cycle. If zero the CIR counter is disabled and packets will never be marked or processed as YELLOW." range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_ALE_POLICETBLCTL" acronym="CPSW_NC_ALE_POLICETBLCTL" offset="254240" width="32" description="The Policing Table Control is used to read or write the selected policing/classifier entry. The selected policing/classifier entry is only read or written after this register is written based on the value of the ~iwrite_enable bit. ">
		<bitfield id="WRITE_ENABLE" width="1" begin="31" end="31" resetval="0x0" description="Write Enable - Setting this bit will write the POLICECFG0-7 to the  pol_tbl_idx selected policing/classifier entry. Clearing this bit will read the  pol_tbl_idx selected policing/classifier entry into the POLICECFG0-7 registers." range="31" rwaccess="R/W"/>
	<bitfield id="POL_TBL_IDX" width="5" begin="4" end="0" resetval="0x0" description="Policer Entry Index - This field specifies the policing/classifier entry to be read or written. When writing to this field without setting the  write_enable=1 will cause the selected policing/classifier entry to be loaded into the POLICECFG0-7 registers. When writing to this field with setting the  write_enable=1 will cause the selected policing/classifier entry to be updated from the POLICECFG0-7 registers." range="4:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_ALE_POLICECONTROL" acronym="CPSW_NC_ALE_POLICECONTROL" offset="254244" width="32" description="The Control Enables color marking as well as internal ALE packet dropping rules.">
		<bitfield id="POLICING_EN" width="1" begin="31" end="31" resetval="0x0" description="Policing Enable - Enables the policing to color the packets, this also enables red or yellow drop capabilities." range="31" rwaccess="R/W"/>
	<bitfield id="RED_DROP_EN" width="1" begin="29" end="29" resetval="0x0" description="RED Drop Enable - Enables the ALE to drop the red colored packets." range="29" rwaccess="R/W"/>
	<bitfield id="YELLOW_DROP_EN" width="1" begin="28" end="28" resetval="0x0" description="WELLOW Drop Enable - Enables the ALE to drop yellow packets based on the  yellowthresh value. This field would normally not be used as to let the switch drop packets at a buffer threshold instead. In the event that the switch does not enable buffer threshold dropping, YELLOW packets can be dropped based on this feature." range="28" rwaccess="R/W"/>
	<bitfield id="YELLOWTHRESH" width="3" begin="26" end="24" resetval="0x0" description="Yellow Threshold - When set enables a portion of the yellow packets to be dropped based on the  yellow_drop_en enable.  0-100%  1=50%  2-33%  3-25%  4=20%  5-17%  6-14%  7-13%" range="26:24" rwaccess="R/W"/>
	<bitfield id="POLMCHMODE" width="2" begin="23" end="22" resetval="0x0" description="Policing Match Mode - This field determines what happens to packets that fail to hit any policing/classifier entry.  0 - No Hit packets are marked GREEN  1 - No Hit packets are marked YELLOW  2 - No Hit packets are marked RED  3 - No Hit packets are marked based on policing/classifier entry=0 state." range="23:22" rwaccess="R/W"/>
	<bitfield id="PRIORITY_THREAD_EN" width="1" begin="21" end="21" resetval="0x0" description="Priority Thread Enable - This field determines if priority is OR'd to the default thread when no classifiers hit and the default thread is enabled." range="21" rwaccess="R/W"/>
	<bitfield id="MAC_ONLY_DEF_DIS" width="1" begin="20" end="20" resetval="0x0" description="MAC Only Default Disable - This field when set disables the default thread on MAC Only Ports. That is the default thread will be {port,priority}. If the traffic matches a classifier with a thread mapping, the classifier thread mapping still occurs." range="20" rwaccess="R/W"/>
	</register><register id="CPSW_NC_ALE_POLICETESTCTL" acronym="CPSW_NC_ALE_POLICETESTCTL" offset="254248" width="32" description="The Policing Test Control enables the ability to determine which policing entry has been hit and whether they reported a red or yellow rate condition.">
		<bitfield id="POL_CLRALL_HIT" width="1" begin="31" end="31" resetval="0x0" description="Policer Clear - This bit clears all the policing/classifier hit bits. This bit is self clearing. This can be used to test the fact that a policing/classifier entry has been hit." range="31" rwaccess="R/W"/>
	<bitfield id="POL_CLRALL_REDHIT" width="1" begin="30" end="30" resetval="0x0" description="Policer Clear RED - This bit clears all the policing/classifier RED hit bits. This bit is self clearing. This can be used to test the fact that a policing/classifier entry has been hit during a RED condition." range="30" rwaccess="R/W"/>
	<bitfield id="POL_CLRALL_YELLOWHIT" width="1" begin="29" end="29" resetval="0x0" description="Policer Clear YELLOW - This bit clears all the policing/classifier YELLOW hit bits. This bit is self clearing. This can be used to test the fact that a policing/classifier entry has been hit during a YELLOW condition." range="29" rwaccess="R/W"/>
	<bitfield id="POL_CLRSEL_ALL" width="1" begin="28" end="28" resetval="0x0" description="Police Clear Selected - This bit clears the selected policing/classifier hit, redhit and yellowhit bits. This bit is self clearing. " range="28" rwaccess="R/W"/>
	<bitfield id="POL_TEST_IDX" width="5" begin="4" end="0" resetval="0x0" description="Policer Test Index - This field selects which policing/classifier hit bits will be read or written." range="4:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_ALE_POLICEHSTAT" acronym="CPSW_NC_ALE_POLICEHSTAT" offset="254252" width="32" description="The policing hit status is a read only register that reads the hit bits of the selected policing/classifier.">
		<bitfield id="POL_HIT" width="1" begin="31" end="31" resetval="0x0" description="Policer Hit - This indicates that the selected policing/classifier via the  pol_test_idx field has been hit by a packet seen on any port that matches the policing/classifier entry match." range="31" rwaccess="R"/>
	<bitfield id="POL_REDHIT" width="1" begin="30" end="30" resetval="0x0" description="Policer Hit RED - This indicates that the selected policing/classifier via the  pol_test_idx field has been hit during a RED condition by a packet seen on any port that matches the policing/classifier entry match." range="30" rwaccess="R"/>
	<bitfield id="POL_YELLOWHIT" width="1" begin="29" end="29" resetval="0x0" description="Policer Hit YELLOW - This indicates that the selected policing/classifier via the  pol_test_idx field has been hit during a YELLOW condition by a packet seen on any port that matches the policing/classifier entry match." range="29" rwaccess="R"/>
	</register><register id="CPSW_NC_ALE_THREADMAPDEF" acronym="CPSW_NC_ALE_THREADMAPDEF" offset="254260" width="32" description="The THREAD Mapping Default Value register is used to set the default thread ID when no classifier is matched,">
		<bitfield id="DEFTHREAD_EN" width="1" begin="15" end="15" resetval="0x0" description="Default Tread Enable - When set the switch will use the  defthreadval for the host interface thread ID if no classifier is matched. If clear the switch will generate its own thread ID based on port and priority if there is no classifier match." range="15" rwaccess="R/W"/>
	<bitfield id="DEFTHREADVAL" width="6" begin="5" end="0" resetval="0x0" description="Default Thread Value - This field specifies the default thread ID value." range="5:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_ALE_THREADMAPCTL" acronym="CPSW_NC_ALE_THREADMAPCTL" offset="254264" width="32" description="The THREAD Mapping Control register allows the highest matched classifier to return a particular thread ID for traffic sent to the host. This allows particular classifier matched traffic to be placed an a particular hosts queue.">
		<bitfield id="CLASSINDEX" width="5" begin="4" end="0" resetval="0x0" description="Classifier Index - This is the classifier index entry that the thread enable and thread value will be read or written by the  THREADMAPVAL register." range="4:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_ALE_THREADMAPVAL" acronym="CPSW_NC_ALE_THREADMAPVAL" offset="254268" width="32" description="The THREAD Mapping Value register is used to set the thread ID for a particular classifier entry.">
		<bitfield id="THREAD_EN" width="1" begin="15" end="15" resetval="0x0" description="Thread Enable - When set the switch will use the  threadval for the selected classifier match. If clear the the thread ID will be determined by the  THREADMAPDEF register settings." range="15" rwaccess="R/W"/>
	<bitfield id="THREADVAL" width="6" begin="5" end="0" resetval="0x0" description="Thread Value - This field is the thread ID value that is used to map a classifier hit to thread ID for host traffic." range="5:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_ECC_REV" acronym="CPSW_NC_ECC_REV" offset="258048" width="32" description="Revision parameters">
		<bitfield id="SCHEME" width="2" begin="31" end="30" resetval="0x1" description="Scheme" range="31:30" rwaccess="R"/>
	<bitfield id="BU" width="2" begin="29" end="28" resetval="0x2" description="bu" range="29:28" rwaccess="R"/>
	<bitfield id="MODULE_ID" width="12" begin="27" end="16" resetval="0x1696" description="Module ID" range="27:16" rwaccess="R"/>
	<bitfield id="REVRTL" width="5" begin="15" end="11" resetval="0x6" description="RTL version" range="15:11" rwaccess="R"/>
	<bitfield id="REVMAJ" width="3" begin="10" end="8" resetval="0x2" description="Major version" range="10:8" rwaccess="R"/>
	<bitfield id="CUSTOM" width="2" begin="7" end="6" resetval="0x0" description="Custom version" range="7:6" rwaccess="R"/>
	<bitfield id="REVMIN" width="6" begin="5" end="0" resetval="0x1" description="Minor version" range="5:0" rwaccess="R"/>
	</register><register id="CPSW_NC_ECC_VECTOR" acronym="CPSW_NC_ECC_VECTOR" offset="258056" width="32" description="ECC Vector Register">
		<bitfield id="RD_SVBUS_DONE" width="1" begin="24" end="24" resetval="0x0" description="Status to indicate if read on serial VBUS is complete, write of any value will clear this bit." range="24" rwaccess="R/W1TC"/>
	<bitfield id="RD_SVBUS_ADDRESS" width="8" begin="23" end="16" resetval="0x0" description="Read address" range="23:16" rwaccess="R/W"/>
	<bitfield id="RD_SVBUS" width="1" begin="15" end="15" resetval="0x0" description="Write 1 to trigger a read on the serial VBUS" range="15" rwaccess="R/W1TS"/>
	<bitfield id="ECC_VECTOR" width="11" begin="10" end="0" resetval="0x0" description="Value written to select the corresponding ECC RAM for control or status" range="10:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_ECC_STAT" acronym="CPSW_NC_ECC_STAT" offset="258060" width="32" description="Misc Status">
		<bitfield id="NUM_RAMS" width="11" begin="10" end="0" resetval="0x20" description="Indicates the number of RAMS serviced by the ECC aggregator" range="10:0" rwaccess="R"/>
	</register><register id="CPSW_NC_ECC_RESERVED_SVBUS_j" acronym="CPSW_NC_ECC_RESERVED_SVBUS_j" offset="258064" width="32" description="Reference other documents that contain the ECC RAM wrapper and EDC controller serial vbus register sets.">
		<bitfield id="DATA" width="32" begin="31" end="0" resetval="0x0" description="Serial VBUS register data" range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_ECC_SEC_EOI_REG" acronym="CPSW_NC_ECC_SEC_EOI_REG" offset="258108" width="32" description="EOI Register">
		<bitfield id="EOI_WR" width="1" begin="0" end="0" resetval="0x0" description="EOI Register" range="0" rwaccess="R/W1TS"/>
	</register><register id="CPSW_NC_ECC_SEC_STATUS_REG0" acronym="CPSW_NC_ECC_SEC_STATUS_REG0" offset="258112" width="32" description="Interrupt Status Register 0">
		<bitfield id="RAMECC19_PEND" width="1" begin="19" end="19" resetval="0x0" description="Interrupt Pending Status for ramecc19_pend" range="19" rwaccess="R/W1TS"/>
	<bitfield id="RAMECC18_PEND" width="1" begin="18" end="18" resetval="0x0" description="Interrupt Pending Status for ramecc18_pend" range="18" rwaccess="R/W1TS"/>
	<bitfield id="RAMECC17_PEND" width="1" begin="17" end="17" resetval="0x0" description="Interrupt Pending Status for ramecc17_pend" range="17" rwaccess="R/W1TS"/>
	<bitfield id="RAMECC16_PEND" width="1" begin="16" end="16" resetval="0x0" description="Interrupt Pending Status for ramecc16_pend" range="16" rwaccess="R/W1TS"/>
	<bitfield id="RAMECC15_PEND" width="1" begin="15" end="15" resetval="0x0" description="Interrupt Pending Status for ramecc15_pend" range="15" rwaccess="R/W1TS"/>
	<bitfield id="RAMECC14_PEND" width="1" begin="14" end="14" resetval="0x0" description="Interrupt Pending Status for ramecc14_pend" range="14" rwaccess="R/W1TS"/>
	<bitfield id="RAMECC13_PEND" width="1" begin="13" end="13" resetval="0x0" description="Interrupt Pending Status for ramecc13_pend" range="13" rwaccess="R/W1TS"/>
	<bitfield id="RAMECC12_PEND" width="1" begin="12" end="12" resetval="0x0" description="Interrupt Pending Status for ramecc12_pend" range="12" rwaccess="R/W1TS"/>
	<bitfield id="RAMECC11_PEND" width="1" begin="11" end="11" resetval="0x0" description="Interrupt Pending Status for ramecc11_pend" range="11" rwaccess="R/W1TS"/>
	<bitfield id="RAMECC10_PEND" width="1" begin="10" end="10" resetval="0x0" description="Interrupt Pending Status for ramecc10_pend" range="10" rwaccess="R/W1TS"/>
	<bitfield id="RAMECC9_PEND" width="1" begin="9" end="9" resetval="0x0" description="Interrupt Pending Status for ramecc9_pend" range="9" rwaccess="R/W1TS"/>
	<bitfield id="RAMECC8_PEND" width="1" begin="8" end="8" resetval="0x0" description="Interrupt Pending Status for ramecc8_pend" range="8" rwaccess="R/W1TS"/>
	<bitfield id="RAMECC7_PEND" width="1" begin="7" end="7" resetval="0x0" description="Interrupt Pending Status for ramecc7_pend" range="7" rwaccess="R/W1TS"/>
	<bitfield id="RAMECC6_PEND" width="1" begin="6" end="6" resetval="0x0" description="Interrupt Pending Status for ramecc6_pend" range="6" rwaccess="R/W1TS"/>
	<bitfield id="RAMECC5_PEND" width="1" begin="5" end="5" resetval="0x0" description="Interrupt Pending Status for ramecc5_pend" range="5" rwaccess="R/W1TS"/>
	<bitfield id="RAMECC4_PEND" width="1" begin="4" end="4" resetval="0x0" description="Interrupt Pending Status for ramecc4_pend" range="4" rwaccess="R/W1TS"/>
	<bitfield id="RAMECC3_PEND" width="1" begin="3" end="3" resetval="0x0" description="Interrupt Pending Status for ramecc3_pend" range="3" rwaccess="R/W1TS"/>
	<bitfield id="RAMECC2_PEND" width="1" begin="2" end="2" resetval="0x0" description="Interrupt Pending Status for ramecc2_pend" range="2" rwaccess="R/W1TS"/>
	<bitfield id="RAMECC1_PEND" width="1" begin="1" end="1" resetval="0x0" description="Interrupt Pending Status for ramecc1_pend" range="1" rwaccess="R/W1TS"/>
	<bitfield id="RAMECC0_PEND" width="1" begin="0" end="0" resetval="0x0" description="Interrupt Pending Status for ramecc0_pend" range="0" rwaccess="R/W1TS"/>
	</register><register id="CPSW_NC_ECC_SEC_ENABLE_SET_REG0" acronym="CPSW_NC_ECC_SEC_ENABLE_SET_REG0" offset="258176" width="32" description="Interrupt Enable Set Register 0">
		<bitfield id="RAMECC19_ENABLE_SET" width="1" begin="19" end="19" resetval="0x0" description="Interrupt Enable Set Register for ramecc19_pend" range="19" rwaccess="R/W1TS"/>
	<bitfield id="RAMECC18_ENABLE_SET" width="1" begin="18" end="18" resetval="0x0" description="Interrupt Enable Set Register for ramecc18_pend" range="18" rwaccess="R/W1TS"/>
	<bitfield id="RAMECC17_ENABLE_SET" width="1" begin="17" end="17" resetval="0x0" description="Interrupt Enable Set Register for ramecc17_pend" range="17" rwaccess="R/W1TS"/>
	<bitfield id="RAMECC16_ENABLE_SET" width="1" begin="16" end="16" resetval="0x0" description="Interrupt Enable Set Register for ramecc16_pend" range="16" rwaccess="R/W1TS"/>
	<bitfield id="RAMECC15_ENABLE_SET" width="1" begin="15" end="15" resetval="0x0" description="Interrupt Enable Set Register for ramecc15_pend" range="15" rwaccess="R/W1TS"/>
	<bitfield id="RAMECC14_ENABLE_SET" width="1" begin="14" end="14" resetval="0x0" description="Interrupt Enable Set Register for ramecc14_pend" range="14" rwaccess="R/W1TS"/>
	<bitfield id="RAMECC13_ENABLE_SET" width="1" begin="13" end="13" resetval="0x0" description="Interrupt Enable Set Register for ramecc13_pend" range="13" rwaccess="R/W1TS"/>
	<bitfield id="RAMECC12_ENABLE_SET" width="1" begin="12" end="12" resetval="0x0" description="Interrupt Enable Set Register for ramecc12_pend" range="12" rwaccess="R/W1TS"/>
	<bitfield id="RAMECC11_ENABLE_SET" width="1" begin="11" end="11" resetval="0x0" description="Interrupt Enable Set Register for ramecc11_pend" range="11" rwaccess="R/W1TS"/>
	<bitfield id="RAMECC10_ENABLE_SET" width="1" begin="10" end="10" resetval="0x0" description="Interrupt Enable Set Register for ramecc10_pend" range="10" rwaccess="R/W1TS"/>
	<bitfield id="RAMECC9_ENABLE_SET" width="1" begin="9" end="9" resetval="0x0" description="Interrupt Enable Set Register for ramecc9_pend" range="9" rwaccess="R/W1TS"/>
	<bitfield id="RAMECC8_ENABLE_SET" width="1" begin="8" end="8" resetval="0x0" description="Interrupt Enable Set Register for ramecc8_pend" range="8" rwaccess="R/W1TS"/>
	<bitfield id="RAMECC7_ENABLE_SET" width="1" begin="7" end="7" resetval="0x0" description="Interrupt Enable Set Register for ramecc7_pend" range="7" rwaccess="R/W1TS"/>
