ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263X/CPSW_CPSW_52800000h.xml
	<bitfield id="RAMECC6_ENABLE_SET" width="1" begin="6" end="6" resetval="0x0" description="Interrupt Enable Set Register for ramecc6_pend" range="6" rwaccess="R/W1TS"/>
	<bitfield id="RAMECC5_ENABLE_SET" width="1" begin="5" end="5" resetval="0x0" description="Interrupt Enable Set Register for ramecc5_pend" range="5" rwaccess="R/W1TS"/>
	<bitfield id="RAMECC4_ENABLE_SET" width="1" begin="4" end="4" resetval="0x0" description="Interrupt Enable Set Register for ramecc4_pend" range="4" rwaccess="R/W1TS"/>
	<bitfield id="RAMECC3_ENABLE_SET" width="1" begin="3" end="3" resetval="0x0" description="Interrupt Enable Set Register for ramecc3_pend" range="3" rwaccess="R/W1TS"/>
	<bitfield id="RAMECC2_ENABLE_SET" width="1" begin="2" end="2" resetval="0x0" description="Interrupt Enable Set Register for ramecc2_pend" range="2" rwaccess="R/W1TS"/>
	<bitfield id="RAMECC1_ENABLE_SET" width="1" begin="1" end="1" resetval="0x0" description="Interrupt Enable Set Register for ramecc1_pend" range="1" rwaccess="R/W1TS"/>
	<bitfield id="RAMECC0_ENABLE_SET" width="1" begin="0" end="0" resetval="0x0" description="Interrupt Enable Set Register for ramecc0_pend" range="0" rwaccess="R/W1TS"/>
	</register><register id="CPSW_NC_ECC_SEC_ENABLE_CLR_REG0" acronym="CPSW_NC_ECC_SEC_ENABLE_CLR_REG0" offset="258240" width="32" description="Interrupt Enable Clear Register 0">
		<bitfield id="RAMECC19_ENABLE_CLR" width="1" begin="19" end="19" resetval="0x0" description="Interrupt Enable Clear Register for ramecc19_pend" range="19" rwaccess="R/W1TC"/>
	<bitfield id="RAMECC18_ENABLE_CLR" width="1" begin="18" end="18" resetval="0x0" description="Interrupt Enable Clear Register for ramecc18_pend" range="18" rwaccess="R/W1TC"/>
	<bitfield id="RAMECC17_ENABLE_CLR" width="1" begin="17" end="17" resetval="0x0" description="Interrupt Enable Clear Register for ramecc17_pend" range="17" rwaccess="R/W1TC"/>
	<bitfield id="RAMECC16_ENABLE_CLR" width="1" begin="16" end="16" resetval="0x0" description="Interrupt Enable Clear Register for ramecc16_pend" range="16" rwaccess="R/W1TC"/>
	<bitfield id="RAMECC15_ENABLE_CLR" width="1" begin="15" end="15" resetval="0x0" description="Interrupt Enable Clear Register for ramecc15_pend" range="15" rwaccess="R/W1TC"/>
	<bitfield id="RAMECC14_ENABLE_CLR" width="1" begin="14" end="14" resetval="0x0" description="Interrupt Enable Clear Register for ramecc14_pend" range="14" rwaccess="R/W1TC"/>
	<bitfield id="RAMECC13_ENABLE_CLR" width="1" begin="13" end="13" resetval="0x0" description="Interrupt Enable Clear Register for ramecc13_pend" range="13" rwaccess="R/W1TC"/>
	<bitfield id="RAMECC12_ENABLE_CLR" width="1" begin="12" end="12" resetval="0x0" description="Interrupt Enable Clear Register for ramecc12_pend" range="12" rwaccess="R/W1TC"/>
	<bitfield id="RAMECC11_ENABLE_CLR" width="1" begin="11" end="11" resetval="0x0" description="Interrupt Enable Clear Register for ramecc11_pend" range="11" rwaccess="R/W1TC"/>
	<bitfield id="RAMECC10_ENABLE_CLR" width="1" begin="10" end="10" resetval="0x0" description="Interrupt Enable Clear Register for ramecc10_pend" range="10" rwaccess="R/W1TC"/>
	<bitfield id="RAMECC9_ENABLE_CLR" width="1" begin="9" end="9" resetval="0x0" description="Interrupt Enable Clear Register for ramecc9_pend" range="9" rwaccess="R/W1TC"/>
	<bitfield id="RAMECC8_ENABLE_CLR" width="1" begin="8" end="8" resetval="0x0" description="Interrupt Enable Clear Register for ramecc8_pend" range="8" rwaccess="R/W1TC"/>
	<bitfield id="RAMECC7_ENABLE_CLR" width="1" begin="7" end="7" resetval="0x0" description="Interrupt Enable Clear Register for ramecc7_pend" range="7" rwaccess="R/W1TC"/>
	<bitfield id="RAMECC6_ENABLE_CLR" width="1" begin="6" end="6" resetval="0x0" description="Interrupt Enable Clear Register for ramecc6_pend" range="6" rwaccess="R/W1TC"/>
	<bitfield id="RAMECC5_ENABLE_CLR" width="1" begin="5" end="5" resetval="0x0" description="Interrupt Enable Clear Register for ramecc5_pend" range="5" rwaccess="R/W1TC"/>
	<bitfield id="RAMECC4_ENABLE_CLR" width="1" begin="4" end="4" resetval="0x0" description="Interrupt Enable Clear Register for ramecc4_pend" range="4" rwaccess="R/W1TC"/>
	<bitfield id="RAMECC3_ENABLE_CLR" width="1" begin="3" end="3" resetval="0x0" description="Interrupt Enable Clear Register for ramecc3_pend" range="3" rwaccess="R/W1TC"/>
	<bitfield id="RAMECC2_ENABLE_CLR" width="1" begin="2" end="2" resetval="0x0" description="Interrupt Enable Clear Register for ramecc2_pend" range="2" rwaccess="R/W1TC"/>
	<bitfield id="RAMECC1_ENABLE_CLR" width="1" begin="1" end="1" resetval="0x0" description="Interrupt Enable Clear Register for ramecc1_pend" range="1" rwaccess="R/W1TC"/>
	<bitfield id="RAMECC0_ENABLE_CLR" width="1" begin="0" end="0" resetval="0x0" description="Interrupt Enable Clear Register for ramecc0_pend" range="0" rwaccess="R/W1TC"/>
	</register><register id="CPSW_NC_ECC_DED_EOI_REG" acronym="CPSW_NC_ECC_DED_EOI_REG" offset="258364" width="32" description="EOI Register">
		<bitfield id="EOI_WR" width="1" begin="0" end="0" resetval="0x0" description="EOI Register" range="0" rwaccess="R/W1TS"/>
	</register><register id="CPSW_NC_ECC_DED_STATUS_REG0" acronym="CPSW_NC_ECC_DED_STATUS_REG0" offset="258368" width="32" description="Interrupt Status Register 0">
		<bitfield id="RAMECC19_PEND" width="1" begin="19" end="19" resetval="0x0" description="Interrupt Pending Status for ramecc19_pend" range="19" rwaccess="R/W1TS"/>
	<bitfield id="RAMECC18_PEND" width="1" begin="18" end="18" resetval="0x0" description="Interrupt Pending Status for ramecc18_pend" range="18" rwaccess="R/W1TS"/>
	<bitfield id="RAMECC17_PEND" width="1" begin="17" end="17" resetval="0x0" description="Interrupt Pending Status for ramecc17_pend" range="17" rwaccess="R/W1TS"/>
	<bitfield id="RAMECC16_PEND" width="1" begin="16" end="16" resetval="0x0" description="Interrupt Pending Status for ramecc16_pend" range="16" rwaccess="R/W1TS"/>
	<bitfield id="RAMECC15_PEND" width="1" begin="15" end="15" resetval="0x0" description="Interrupt Pending Status for ramecc15_pend" range="15" rwaccess="R/W1TS"/>
	<bitfield id="RAMECC14_PEND" width="1" begin="14" end="14" resetval="0x0" description="Interrupt Pending Status for ramecc14_pend" range="14" rwaccess="R/W1TS"/>
	<bitfield id="RAMECC13_PEND" width="1" begin="13" end="13" resetval="0x0" description="Interrupt Pending Status for ramecc13_pend" range="13" rwaccess="R/W1TS"/>
	<bitfield id="RAMECC12_PEND" width="1" begin="12" end="12" resetval="0x0" description="Interrupt Pending Status for ramecc12_pend" range="12" rwaccess="R/W1TS"/>
	<bitfield id="RAMECC11_PEND" width="1" begin="11" end="11" resetval="0x0" description="Interrupt Pending Status for ramecc11_pend" range="11" rwaccess="R/W1TS"/>
	<bitfield id="RAMECC10_PEND" width="1" begin="10" end="10" resetval="0x0" description="Interrupt Pending Status for ramecc10_pend" range="10" rwaccess="R/W1TS"/>
	<bitfield id="RAMECC9_PEND" width="1" begin="9" end="9" resetval="0x0" description="Interrupt Pending Status for ramecc9_pend" range="9" rwaccess="R/W1TS"/>
	<bitfield id="RAMECC8_PEND" width="1" begin="8" end="8" resetval="0x0" description="Interrupt Pending Status for ramecc8_pend" range="8" rwaccess="R/W1TS"/>
	<bitfield id="RAMECC7_PEND" width="1" begin="7" end="7" resetval="0x0" description="Interrupt Pending Status for ramecc7_pend" range="7" rwaccess="R/W1TS"/>
	<bitfield id="RAMECC6_PEND" width="1" begin="6" end="6" resetval="0x0" description="Interrupt Pending Status for ramecc6_pend" range="6" rwaccess="R/W1TS"/>
	<bitfield id="RAMECC5_PEND" width="1" begin="5" end="5" resetval="0x0" description="Interrupt Pending Status for ramecc5_pend" range="5" rwaccess="R/W1TS"/>
	<bitfield id="RAMECC4_PEND" width="1" begin="4" end="4" resetval="0x0" description="Interrupt Pending Status for ramecc4_pend" range="4" rwaccess="R/W1TS"/>
	<bitfield id="RAMECC3_PEND" width="1" begin="3" end="3" resetval="0x0" description="Interrupt Pending Status for ramecc3_pend" range="3" rwaccess="R/W1TS"/>
	<bitfield id="RAMECC2_PEND" width="1" begin="2" end="2" resetval="0x0" description="Interrupt Pending Status for ramecc2_pend" range="2" rwaccess="R/W1TS"/>
	<bitfield id="RAMECC1_PEND" width="1" begin="1" end="1" resetval="0x0" description="Interrupt Pending Status for ramecc1_pend" range="1" rwaccess="R/W1TS"/>
	<bitfield id="RAMECC0_PEND" width="1" begin="0" end="0" resetval="0x0" description="Interrupt Pending Status for ramecc0_pend" range="0" rwaccess="R/W1TS"/>
	</register><register id="CPSW_NC_ECC_DED_ENABLE_SET_REG0" acronym="CPSW_NC_ECC_DED_ENABLE_SET_REG0" offset="258432" width="32" description="Interrupt Enable Set Register 0">
		<bitfield id="RAMECC19_ENABLE_SET" width="1" begin="19" end="19" resetval="0x0" description="Interrupt Enable Set Register for ramecc19_pend" range="19" rwaccess="R/W1TS"/>
	<bitfield id="RAMECC18_ENABLE_SET" width="1" begin="18" end="18" resetval="0x0" description="Interrupt Enable Set Register for ramecc18_pend" range="18" rwaccess="R/W1TS"/>
	<bitfield id="RAMECC17_ENABLE_SET" width="1" begin="17" end="17" resetval="0x0" description="Interrupt Enable Set Register for ramecc17_pend" range="17" rwaccess="R/W1TS"/>
	<bitfield id="RAMECC16_ENABLE_SET" width="1" begin="16" end="16" resetval="0x0" description="Interrupt Enable Set Register for ramecc16_pend" range="16" rwaccess="R/W1TS"/>
	<bitfield id="RAMECC15_ENABLE_SET" width="1" begin="15" end="15" resetval="0x0" description="Interrupt Enable Set Register for ramecc15_pend" range="15" rwaccess="R/W1TS"/>
	<bitfield id="RAMECC14_ENABLE_SET" width="1" begin="14" end="14" resetval="0x0" description="Interrupt Enable Set Register for ramecc14_pend" range="14" rwaccess="R/W1TS"/>
	<bitfield id="RAMECC13_ENABLE_SET" width="1" begin="13" end="13" resetval="0x0" description="Interrupt Enable Set Register for ramecc13_pend" range="13" rwaccess="R/W1TS"/>
	<bitfield id="RAMECC12_ENABLE_SET" width="1" begin="12" end="12" resetval="0x0" description="Interrupt Enable Set Register for ramecc12_pend" range="12" rwaccess="R/W1TS"/>
	<bitfield id="RAMECC11_ENABLE_SET" width="1" begin="11" end="11" resetval="0x0" description="Interrupt Enable Set Register for ramecc11_pend" range="11" rwaccess="R/W1TS"/>
	<bitfield id="RAMECC10_ENABLE_SET" width="1" begin="10" end="10" resetval="0x0" description="Interrupt Enable Set Register for ramecc10_pend" range="10" rwaccess="R/W1TS"/>
	<bitfield id="RAMECC9_ENABLE_SET" width="1" begin="9" end="9" resetval="0x0" description="Interrupt Enable Set Register for ramecc9_pend" range="9" rwaccess="R/W1TS"/>
	<bitfield id="RAMECC8_ENABLE_SET" width="1" begin="8" end="8" resetval="0x0" description="Interrupt Enable Set Register for ramecc8_pend" range="8" rwaccess="R/W1TS"/>
	<bitfield id="RAMECC7_ENABLE_SET" width="1" begin="7" end="7" resetval="0x0" description="Interrupt Enable Set Register for ramecc7_pend" range="7" rwaccess="R/W1TS"/>
	<bitfield id="RAMECC6_ENABLE_SET" width="1" begin="6" end="6" resetval="0x0" description="Interrupt Enable Set Register for ramecc6_pend" range="6" rwaccess="R/W1TS"/>
	<bitfield id="RAMECC5_ENABLE_SET" width="1" begin="5" end="5" resetval="0x0" description="Interrupt Enable Set Register for ramecc5_pend" range="5" rwaccess="R/W1TS"/>
	<bitfield id="RAMECC4_ENABLE_SET" width="1" begin="4" end="4" resetval="0x0" description="Interrupt Enable Set Register for ramecc4_pend" range="4" rwaccess="R/W1TS"/>
	<bitfield id="RAMECC3_ENABLE_SET" width="1" begin="3" end="3" resetval="0x0" description="Interrupt Enable Set Register for ramecc3_pend" range="3" rwaccess="R/W1TS"/>
	<bitfield id="RAMECC2_ENABLE_SET" width="1" begin="2" end="2" resetval="0x0" description="Interrupt Enable Set Register for ramecc2_pend" range="2" rwaccess="R/W1TS"/>
	<bitfield id="RAMECC1_ENABLE_SET" width="1" begin="1" end="1" resetval="0x0" description="Interrupt Enable Set Register for ramecc1_pend" range="1" rwaccess="R/W1TS"/>
	<bitfield id="RAMECC0_ENABLE_SET" width="1" begin="0" end="0" resetval="0x0" description="Interrupt Enable Set Register for ramecc0_pend" range="0" rwaccess="R/W1TS"/>
	</register><register id="CPSW_NC_ECC_DED_ENABLE_CLR_REG0" acronym="CPSW_NC_ECC_DED_ENABLE_CLR_REG0" offset="258496" width="32" description="Interrupt Enable Clear Register 0">
		<bitfield id="RAMECC19_ENABLE_CLR" width="1" begin="19" end="19" resetval="0x0" description="Interrupt Enable Clear Register for ramecc19_pend" range="19" rwaccess="R/W1TC"/>
	<bitfield id="RAMECC18_ENABLE_CLR" width="1" begin="18" end="18" resetval="0x0" description="Interrupt Enable Clear Register for ramecc18_pend" range="18" rwaccess="R/W1TC"/>
	<bitfield id="RAMECC17_ENABLE_CLR" width="1" begin="17" end="17" resetval="0x0" description="Interrupt Enable Clear Register for ramecc17_pend" range="17" rwaccess="R/W1TC"/>
	<bitfield id="RAMECC16_ENABLE_CLR" width="1" begin="16" end="16" resetval="0x0" description="Interrupt Enable Clear Register for ramecc16_pend" range="16" rwaccess="R/W1TC"/>
	<bitfield id="RAMECC15_ENABLE_CLR" width="1" begin="15" end="15" resetval="0x0" description="Interrupt Enable Clear Register for ramecc15_pend" range="15" rwaccess="R/W1TC"/>
	<bitfield id="RAMECC14_ENABLE_CLR" width="1" begin="14" end="14" resetval="0x0" description="Interrupt Enable Clear Register for ramecc14_pend" range="14" rwaccess="R/W1TC"/>
	<bitfield id="RAMECC13_ENABLE_CLR" width="1" begin="13" end="13" resetval="0x0" description="Interrupt Enable Clear Register for ramecc13_pend" range="13" rwaccess="R/W1TC"/>
	<bitfield id="RAMECC12_ENABLE_CLR" width="1" begin="12" end="12" resetval="0x0" description="Interrupt Enable Clear Register for ramecc12_pend" range="12" rwaccess="R/W1TC"/>
	<bitfield id="RAMECC11_ENABLE_CLR" width="1" begin="11" end="11" resetval="0x0" description="Interrupt Enable Clear Register for ramecc11_pend" range="11" rwaccess="R/W1TC"/>
	<bitfield id="RAMECC10_ENABLE_CLR" width="1" begin="10" end="10" resetval="0x0" description="Interrupt Enable Clear Register for ramecc10_pend" range="10" rwaccess="R/W1TC"/>
	<bitfield id="RAMECC9_ENABLE_CLR" width="1" begin="9" end="9" resetval="0x0" description="Interrupt Enable Clear Register for ramecc9_pend" range="9" rwaccess="R/W1TC"/>
	<bitfield id="RAMECC8_ENABLE_CLR" width="1" begin="8" end="8" resetval="0x0" description="Interrupt Enable Clear Register for ramecc8_pend" range="8" rwaccess="R/W1TC"/>
	<bitfield id="RAMECC7_ENABLE_CLR" width="1" begin="7" end="7" resetval="0x0" description="Interrupt Enable Clear Register for ramecc7_pend" range="7" rwaccess="R/W1TC"/>
	<bitfield id="RAMECC6_ENABLE_CLR" width="1" begin="6" end="6" resetval="0x0" description="Interrupt Enable Clear Register for ramecc6_pend" range="6" rwaccess="R/W1TC"/>
	<bitfield id="RAMECC5_ENABLE_CLR" width="1" begin="5" end="5" resetval="0x0" description="Interrupt Enable Clear Register for ramecc5_pend" range="5" rwaccess="R/W1TC"/>
	<bitfield id="RAMECC4_ENABLE_CLR" width="1" begin="4" end="4" resetval="0x0" description="Interrupt Enable Clear Register for ramecc4_pend" range="4" rwaccess="R/W1TC"/>
	<bitfield id="RAMECC3_ENABLE_CLR" width="1" begin="3" end="3" resetval="0x0" description="Interrupt Enable Clear Register for ramecc3_pend" range="3" rwaccess="R/W1TC"/>
	<bitfield id="RAMECC2_ENABLE_CLR" width="1" begin="2" end="2" resetval="0x0" description="Interrupt Enable Clear Register for ramecc2_pend" range="2" rwaccess="R/W1TC"/>
	<bitfield id="RAMECC1_ENABLE_CLR" width="1" begin="1" end="1" resetval="0x0" description="Interrupt Enable Clear Register for ramecc1_pend" range="1" rwaccess="R/W1TC"/>
	<bitfield id="RAMECC0_ENABLE_CLR" width="1" begin="0" end="0" resetval="0x0" description="Interrupt Enable Clear Register for ramecc0_pend" range="0" rwaccess="R/W1TC"/>
	</register><register id="CPSW_NC_ECC_AGGR_ENABLE_SET" acronym="CPSW_NC_ECC_AGGR_ENABLE_SET" offset="258560" width="32" description="AGGR interrupt enable set Register">
		<bitfield id="TIMEOUT" width="1" begin="1" end="1" resetval="0x0" description="interrupt enable set for svbus timeout errors" range="1" rwaccess="R/W1TS"/>
	<bitfield id="PARITY" width="1" begin="0" end="0" resetval="0x0" description="interrupt enable set for parity errors" range="0" rwaccess="R/W1TS"/>
	</register><register id="CPSW_NC_ECC_AGGR_ENABLE_CLR" acronym="CPSW_NC_ECC_AGGR_ENABLE_CLR" offset="258564" width="32" description="AGGR interrupt enable clear Register">
		<bitfield id="TIMEOUT" width="1" begin="1" end="1" resetval="0x0" description="interrupt enable clear for svbus timeout errors" range="1" rwaccess="R/W1TC"/>
	<bitfield id="PARITY" width="1" begin="0" end="0" resetval="0x0" description="interrupt enable clear for parity errors" range="0" rwaccess="R/W1TC"/>
	</register><register id="CPSW_NC_ECC_AGGR_STATUS_SET" acronym="CPSW_NC_ECC_AGGR_STATUS_SET" offset="258568" width="32" description="AGGR interrupt status set Register">
		<bitfield id="TIMEOUT" width="2" begin="3" end="2" resetval="0x0" description="interrupt status set for svbus timeout errors" range="3:2" rwaccess="R/WI"/>
	<bitfield id="PARITY" width="2" begin="1" end="0" resetval="0x0" description="interrupt status set for parity errors" range="1:0" rwaccess="R/WI"/>
	</register><register id="CPSW_NC_ECC_AGGR_STATUS_CLR" acronym="CPSW_NC_ECC_AGGR_STATUS_CLR" offset="258572" width="32" description="AGGR interrupt status clear Register">
		<bitfield id="TIMEOUT" width="2" begin="3" end="2" resetval="0x0" description="interrupt status clear for svbus timeout errors" range="3:2" rwaccess="R/WD"/>
	<bitfield id="PARITY" width="2" begin="1" end="0" resetval="0x0" description="interrupt status clear for parity errors" range="1:0" rwaccess="R/WD"/>
	</register><register id="CPSW_NC_CPTS_TS_GENF_COMP_LOW_REG_j" acronym="CPSW_NC_CPTS_TS_GENF_COMP_LOW_REG_j" offset="250080" width="32" description="Time Stamp Generate Function Comparison Low Value">
		<bitfield id="COMP_LOW" width="32" begin="31" end="0" resetval="0x0" description="GENFn comparison value lower 32-bits.  This value should be written after the upper 32-bits.  The ts_GENFn_comp high and low should only be written when the ts_GENFn_length value is zero." range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPTS_TS_GENF_COMP_HIGH_REG_j" acronym="CPSW_NC_CPTS_TS_GENF_COMP_HIGH_REG_j" offset="250084" width="32" description="Time Stamp Generate Function Comparison high Value">
		<bitfield id="COMP_HIGH" width="32" begin="31" end="0" resetval="0x0" description="GENFn comparison value upper 32-bits.  This value should be written before the lower 32-bits are written.  The ts_GENFn_comp high and low should only be written when the ts_GENFn_length value is zero." range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPTS_TS_GENF_CONTROL_REG_j" acronym="CPSW_NC_CPTS_TS_GENF_CONTROL_REG_j" offset="250088" width="32" description="Time Stamp Generate Function Control">
		<bitfield id="PPM_DIR" width="1" begin="1" end="1" resetval="0x0" description="Generate function N PPM direction -          0 - A single RCLK is added to the generate function counter at the PPM rate which has the effect of decreasing the generate function frequency by the PPM amount.         1 - A single RCLK is subtracted from the generate function counter at the PPM rate which has the effect of increasing the generate function frequency by the PPM amount." range="1" rwaccess="R/W"/>
	<bitfield id="POLARITY_INV" width="1" begin="0" end="0" resetval="0x0" description="Generate function N Polarity -          0 - The output TS_GENFn signal asserts high.         1 - The output TS_GENFn signal asserts low" range="0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPTS_TS_GENF_LENGTH_REG_j" acronym="CPSW_NC_CPTS_TS_GENF_LENGTH_REG_j" offset="250092" width="32" description="Time Stamp Generate Function Length Value">
		<bitfield id="LENGTH" width="32" begin="31" end="0" resetval="0x0" description="GENFn length - The minimum operational value is decimal 5.         Note: Software is advised to write and then read the comparison value before writing a non-zero value to the genf length to ensure that the comparison value is synchronized across the boundary before the length." range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPTS_TS_GENF_PPM_LOW_REG_j" acronym="CPSW_NC_CPTS_TS_GENF_PPM_LOW_REG_j" offset="250096" width="32" description="Time Stamp Generate Function PPM Low Value">
		<bitfield id="PPM_LOW" width="32" begin="31" end="0" resetval="0x0" description="GENFn PPM Low Value - The 64-bit PPM value takes effect when this low value is written.  The high value should be written first." range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPTS_TS_GENF_PPM_HIGH_REG_j" acronym="CPSW_NC_CPTS_TS_GENF_PPM_HIGH_REG_j" offset="250100" width="32" description="Time Stamp Generate Function PPM High Value">
		<bitfield id="PPM_HIGH" width="10" begin="9" end="0" resetval="0x0" description="GENFn PPM High Value - This value should be written first (before the low value is written)." range="9:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPTS_TS_GENF_NUDGE_REG_j" acronym="CPSW_NC_CPTS_TS_GENF_NUDGE_REG_j" offset="250104" width="32" description="Time Stamp Generate Function Nudge Value">
		<bitfield id="NUDGE" width="8" begin="7" end="0" resetval="0x0" description="GENFn Nudge Value - This two's complement number is added to the generate counter value to increase or decrease the length by the ts_genfN_nudge amount.  Only a single high or low time is adjusted and the ts_genfN_nudge value is cleared to zero when the nudge has occurred.  " range="7:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPTS_TS_ESTF_COMP_LOW_REG_j" acronym="CPSW_NC_CPTS_TS_ESTF_COMP_LOW_REG_j" offset="250368" width="32" description="Time Stamp ESTF Generate Function Comparison Low Value">
		<bitfield id="COMP_LOW" width="32" begin="31" end="0" resetval="0x0" description="ESTFn comparison value lower 32-bits.  This value should be written after the upper 32-bits. The ts_ESTFn_comp high and low should only be written when the ts_ESTFn_length value is zero." range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPTS_TS_ESTF_COMP_HIGH_REG_j" acronym="CPSW_NC_CPTS_TS_ESTF_COMP_HIGH_REG_j" offset="250372" width="32" description="Time Stamp ESTF Generate Function Comparison high Value">
		<bitfield id="COMP_HIGH" width="32" begin="31" end="0" resetval="0x0" description="ESTFn comparison value upper 32-bits.  This value should be written before the lower 32-bits are written.  The ts_ESTFn_comp high and low should only be written when the ts_ESTFn_length value is zero." range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPTS_TS_ESTF_CONTROL_REG_j" acronym="CPSW_NC_CPTS_TS_ESTF_CONTROL_REG_j" offset="250376" width="32" description="Time Stamp ESTF Generate Function Control">
		<bitfield id="PPM_DIR" width="1" begin="1" end="1" resetval="0x0" description="Generate function N PPM direction -          0 - A single RCLK is added to the generate function counter at the PPM rate which has the effect of decreasing the generate function frequency by the PPM amount.         1 - A single RCLK is subtracted from the generate function counter at the PPM rate which has the effect of increasing the generate function frequency by the PPM amount." range="1" rwaccess="R/W"/>
	<bitfield id="POLARITY_INV" width="1" begin="0" end="0" resetval="0x0" description="Generate function N Polarity -          0 - The output TS_ESTFn signal asserts low.         1 - The output TS_ESTFn signal asserts high." range="0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPTS_TS_ESTF_LENGTH_REG_j" acronym="CPSW_NC_CPTS_TS_ESTF_LENGTH_REG_j" offset="250380" width="32" description="Time Stamp ESTF Generate Function Length Value">
