ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263X/CPSW_CPSW_52800000h.xml
		<bitfield id="LENGTH" width="32" begin="31" end="0" resetval="0x0" description="ESTFn length - The minimum operational value is decimal 5.         Note: Software is advised to write and then read the comparison value before writing a non-zero value to the genf length to ensure that the comparison value is synchronized across the boundary before the length." range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPTS_TS_ESTF_PPM_LOW_REG_j" acronym="CPSW_NC_CPTS_TS_ESTF_PPM_LOW_REG_j" offset="250384" width="32" description="Time Stamp ESTF Generate Function PPM Low Value">
		<bitfield id="PPM_LOW" width="32" begin="31" end="0" resetval="0x0" description="ESTFn PPM Low Value - The 64-bit PPM value takes effect when this low value is written.  The high value should be written first." range="31:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPTS_TS_ESTF_PPM_HIGH_REG_j" acronym="CPSW_NC_CPTS_TS_ESTF_PPM_HIGH_REG_j" offset="250388" width="32" description="Time Stamp ESTF Generate Function PPM High Value">
		<bitfield id="PPM_HIGH" width="10" begin="9" end="0" resetval="0x0" description="ESTFn PPM High Value - This value should be written first (before the low value is written)." range="9:0" rwaccess="R/W"/>
	</register><register id="CPSW_NC_CPTS_TS_ESTF_NUDGE_REG_j" acronym="CPSW_NC_CPTS_TS_ESTF_NUDGE_REG_j" offset="250392" width="32" description="Time Stamp ESTF Generate Function Nudge Value">
		<bitfield id="NUDGE" width="8" begin="7" end="0" resetval="0x0" description="ESTFn Nudge Value - This two's complement number is added to the generate counter value to increase or decrease the length by the ts_estfN_nudge amount.  Only a single high or low time is adjusted and the ts_estfN_nudge value is cleared to zero when the nudge has occurred.  " range="7:0" rwaccess="R/W"/>
	</register>
</module>